[{"category": "Play", "description": "My friends and I just wrapped up our latest Dungeon's & Dragons campaign, and we've been planning the next one. Our DM wants us to try out 6 characters for the first few months before we dive into a long term campaign. I think this is a pretty cool move, because you can make sure the character you're going to have for the next 1-2 years is flight tested and ready. Once we've play tested our characters over the initial trial period, we'll pick just one.\nFor the first one, I came up with kind of a bizarre character concept - a doctor/physician that loses everyone he loves to a plague, and becomes completely obsessed with finding a cure. He sells everything he owns and joins the monastic society that sponsors his former university. At the monastery, he continues in his obsessive research and neglects self care. Late one night he's reaching for a simple tincture of iodine and his hand slips on the bottle, bringing an entire bookshelf of potions down on top of him. He's badly scarred and the elders at the monastery think he should find peace seeking the cure on the road. He takes his meager possessions, 10 gold pieces and dons the only vestments of his former life - a plague doctor's outfit. At that moment he loses a great deal of his humanity and becomes The Black Kestrel.\nA character with a backstory that dark needs an equally awesome miniature for the table. Searching for 'Plague Doctor Miniatures' reveals a 54mm metal figurine - a scale much too big, and the Reaper Chronoscope Plague Doctor miniature. The Reaper miniature in my opinion is good, but I wanted something great. It's just a doctor holding a flask in a bird mask. That's it. Straight standing posture, like he/she's standing in a laboratory - and never going to travel out of his/her pox-stricken village.\nThat would never do for The Black Kestrel. As we wrapped up the campaign today, I realized I'd need a miniature soon, so I started searching for minis on my phone. I could take an existing miniature - a human-sized hooded figure carrying the right type of weapon, and kit bash it!\nIf you're curious about the character's class & race - he's a human cleric. If he makes the longterm cut, I want to take a few ranger levels so I can get an animal companion (hawk).\nI have been binge-watching Black Magic Craft on YouTube and he's been really inspiring for me. I've been painting miniatures out of the box, no frills since December. I've wanted to level up my game so kit bashing a mini like BMC would be a good next step.\nThis episode was pretty inspiring to get me started working with Milliput.\nCredit: Black Magic Craft - Custom Cadaver Collector Miniature for D&D (episode 093)\nSince then I've wanted to kit bash my own miniature, so I'm glad I couldn't just find a plague doctor miniature I liked! ;-)", "title": "Kit-Bashed Plague Doctor Miniature Model", "url": "https://www.instructables.com/id/Kit-Bashed-Plague-Doctor-Miniature-Model/", "steps": [{"step": 1, "steps_text": "I've included Amazon.com links for the 2 miniatures needed, but I'd highly suggest finding a local game or comic book store and visiting them. My local game shops provide a neat gaming culture scene and I love going to support them. Support local first!\n\nMaterials:\nNolzur's Marvelous Miniatures Male Elf Wizard 2 pack\nPathfinder Deep Cuts Wizard's Room\nBasic 2 part Milliput epoxy putty or similar\nSuper Glue/Cyanoacrylate\nAcrylicos Vallejo Primer, grey\nAcrylic miniature/model paint\nMatt Varnish\nTools:\nExacto/Hobby knives\nHobby saw\nNeedle files\nSculpting tools (use whatever you have on hand)\nPaint brushes\nPaint palette\nBaking parchment paper & painters tape\nA glass of water", "step_imgs": ["https://cdn.instructables.com/FDK/UQZG/JSPABXED/FDKUQZGJSPABXED.LARGE.jpg", "https://cdn.instructables.com/FFK/EG7Q/JSPABXEA/FFKEG7QJSPABXEA.LARGE.jpg", "https://cdn.instructables.com/FNR/ZIDI/JSPABXE6/FNRZIDIJSPABXE6.LARGE.jpg"], "step_title": "Step 1: Tools & Supplies"}, {"step": 2, "steps_text": "In my mind I see The Black Kestrel as very intimidating - so a wide stance with his legs, flowing robes in black and dark gray. In his gloved hands he carries a vial or flask of a green liquid, and a long cane. The cane in the game mechanics of Dungeons and Dragons is statted out to be a mace, since he's a cleric. So it will be his weapon, as well as his holy symbol for his cleric class.\nFinding the elf wizard miniature at my local game shop was great - I just needed to knock off the fire in his hand and sculpt a face.\nTo prep the miniature, first we want to take off the flashing from the mold seams. As shown his legs have lines running up the edges. Paint will stick to those high spots and it will be obvious that I didn't tidy up the mold lines. After the cleanup, we need to remove the fire magic clear plastic on his hand. I was afraid I'd need to cut gently and take off a little and a time. So I probed some pressure near his hand in the flame with my Exacto knife just to see how easy the plastic would cut. All of the sudden, the plastic fire shot off his hand, removed perfectly cleanly - and still serviceable as a flame for another model! The difference in materials - clear plastic and primed white plastic made separation really easy.\nSaving little bits inside a Chessex dice container is a fantastic organization tip!", "step_imgs": ["https://cdn.instructables.com/FU7/IPU2/JSPABXEF/FU7IPU2JSPABXEF.LARGE.jpg", "https://cdn.instructables.com/FY6/9NVA/JSPABXEH/FY69NVAJSPABXEH.LARGE.jpg", "https://cdn.instructables.com/FBV/XZ5W/JSPABXEG/FBVXZ5WJSPABXEG.LARGE.jpg", "https://cdn.instructables.com/FZ4/D4L0/JSPABXEJ/FZ4D4L0JSPABXEJ.LARGE.jpg"], "step_title": "Step 2: Prep the Miniature"}, {"step": 3, "steps_text": "Once the fire was off the hand, I needed to trim down the excess plastic in his palm to enable him to hold a flask or bottle. I used needle files, emery boards, hobby saws and exacto knives to carve out a channel in his palm - taking care to not cut off his thumb too much.\nI selected the round bulbous bottle with a narrow top because it would give lots of glue surface to adhere to his hand. He would grip the bottle by the top, so I measured it against a needle file to make sure I wouldn't cut too deep. The best tool ended up being the hobby saw to hog out most of the material (we're talking millimeters here) and then clean it up with the emery boards and files.\nOnce the channel was cut into his palm -- leaving all 5 fingers, I carefully glued the flask into his hand using a tiny drop of cyanoacrylate (super glue). Once it was set, I put a larger drop over the bottle and let it seep into his hand. I then used an old medicine bottle, and some blue sticky tack to anchor him down at an angle that would prevent glue running. I let the CA glue fully dry before disturbing it. I wanted to ensure the flask wouldn't fall out of his hand - especially since removing the fire (same clear plastic) was so easy!", "step_imgs": ["https://cdn.instructables.com/FNG/W1EV/JSPABXHM/FNGW1EVJSPABXHM.LARGE.jpg", "https://cdn.instructables.com/F9L/9BXO/JSPABXEK/F9L9BXOJSPABXEK.LARGE.jpg", "https://cdn.instructables.com/FFY/MNDN/JSPABXEP/FFYMNDNJSPABXEP.LARGE.jpg", "https://cdn.instructables.com/F44/DFVB/JSPABXES/F44DFVBJSPABXES.LARGE.jpg", "https://cdn.instructables.com/FQS/LE0X/JSPABXEM/FQSLE0XJSPABXEM.LARGE.jpg", "https://cdn.instructables.com/FXX/J6NN/JSPABXEW/FXXJ6NNJSPABXEW.LARGE.jpg"], "step_title": "Step 3: Hand Me 50CCs of Awesome..."}, {"step": 4, "steps_text": "At this point The Black Kestrel was really shaping up, so I took him and ran around the house to my wife and all my children and my dog. \"Hey look, but don't touch. Neat, yes? Do you like that he's holding a bottle! This is so good, my best work yet!\" ha ha ha.\nJust adding a new item in the model's hand is a new level up for me. So I guess I'm a level 3 modeler now? Time to choose my path feature... I think the kit-basher class feature is a great addition.\nLet's jump right into level 4 - sculpting with Milliput.\nMilliput and it's other cousins on the market (sometimes just called \"green stuff\") are a rock hard epoxy putty. It starts life as two separate tubes of clay-consistency sticky gunk. When you cut equal amounts and evenly mix them together (no streaks of any color - full uniform color) it kicks off a magic process and goes from sticky, to moldable like cold blue sticky tack (poster tack) to Sculpy/Fimo clay to rock hard.\nBeing a total newbie, I read the directions - which indicate that after an hour the putty will be firmer but workable. It seems like that was wisdom, but I ignored it. Being too excited I started sculpting while the Milliput was too soft.\nI taped down a piece of parchment paper to my desk and rolled a cylinder over it (sandwiched with more parchment) to flatten out a small amount.\nThen I cut out a small triangle with an Exacto knife. I learned that Milliput, especially when soft sticks to everything. Your fingers, itself, Exacto knives, dental picks, itself, unintended places on your model, itself, your fingers again... Use some water. Get your fingers wet, dip your tools in the water, it helps things not stick. It doesn't stick well to parchment paper.\nI took the triangle and shaped it into a beak shape and then mushed it into his face. Then I spent 10 minutes perfecting it. It was a beautiful beak face shape. I originally intended the eyes to be protruding from the surface like googles, but I couldn't find anything scale correct to punch out circles. The divot in a Lego minifig's head is not the right scale, ha ha. Instead, I poked in concave holes using a 2mm electronics standoff. The head was beautiful and perfect.... and I think you know where the plot is going to turn next.\n...\nYep. I wrecked it. I started sculpting some fingers on. I cut a small square and put it on the hand. The plan was to adhere the square to the hand over the bottle, then carve grooves in between the fingers - sculpt the fingers in situ, essentially. On one of my backstrokes carving the hand I smooshed his face (correct medical term). And had to start literally all over. I ripped off his face and attached a new triangle, re-sculpted it. Despite the failure, I fixed it pretty good and I'm really excited to do more Milliput sculptures in my models.\nSo... This is not the greatest face in the world... this is just a tribute.\nLessons learned:\nSculpt minor details first - start with the smallest stuff.\nSculpt key details last - maybe even wait for the other parts to dry\nBe patient and wait a bit to start working the Milliput so its a bit firmer.\nI'd rather slay a 100 goblins than 1 black dragon, but I've only ever done the latter.\nI cut a 1/4 inch of each side of the Milliput and had plenty left over. So I used the fire from his hand and sculpted a simple camp fire with the leftovers.", "step_imgs": ["https://cdn.instructables.com/F3T/0HEI/JSPABXJT/F3T0HEIJSPABXJT.LARGE.jpg", "https://cdn.instructables.com/FRM/QL18/JSPABXHT/FRMQL18JSPABXHT.LARGE.jpg", "https://cdn.instructables.com/FWN/517J/JSPABXHY/FWN517JJSPABXHY.LARGE.jpg", "https://cdn.instructables.com/F2K/8PJ0/JSPABXI2/F2K8PJ0JSPABXI2.LARGE.jpg", "https://cdn.instructables.com/F4K/A7N6/JSPABXIN/F4KA7N6JSPABXIN.LARGE.jpg", "https://cdn.instructables.com/F6N/56UD/JSPABXIP/F6N56UDJSPABXIP.LARGE.jpg", "https://cdn.instructables.com/FE2/ZLWT/JSPABXIR/FE2ZLWTJSPABXIR.LARGE.jpg"], "step_title": "Step 4: Sculpt the Face and Fingers"}, {"step": 5, "steps_text": "The Milliput package insert says that you can paint the hardened putty immediately, but I prefer to use a primer. I find that the even coating of under paint allows the acrylics to bond well. I know acrylics can bond well to primer, so that's what we're doing.\nReaper Bones plastic miniatures aren't primed - and I prime those too, with Acrylicos Vallejo grey primer.\nDeep Cuts miniatures, like the ones used here are pre-primed with Acrylicos Vallejo. But I primed the entire miniature again lightly to ensure that any oils, stray milliput or anything is well sealed and the paint would adhere evenly. I don't prime clear pieces obviously, so those can be masked with a bit of Silly Putty. You have to work a bit quickly though, because the Silly Putty moves and thins out a bit naturally from gravity.\nFor the paint job, I went with a black theme - but if I painted the entire miniature black head to toe, there would be no contrast, and no highlights and shadows.\n\nInstead, I did a charcoal gray base coat on everything except his mask, the items on his belt and his clear potion bottle. The mask I base coated a light bone color. The belt items were called out in black with the large pouch painted in light bone. Then I washed black all over the miniature except the areas painted in light bone. I want the mask and the potion bottle to be the focal point. The mask is washed in a sepia wash. The potion bottle is glazed part-way with green by mixing thinner medium and green paint. I also made sure the liquid in the bottle is level with the horizon line. After the wash dried, I dry brushed the miniature with charcoal gray and then lighter grays to bring out the highlights.\nI found a set of brushes at Hobby Lobby where one of the brushes has a bent tip, allowing reaching access into tight places. This was especially helpful painting the underside of his cape.", "step_imgs": ["https://cdn.instructables.com/F6V/0QD4/JTON3SFC/F6V0QD4JTON3SFC.LARGE.jpg", "https://cdn.instructables.com/FNA/SQV0/JTON3SEF/FNASQV0JTON3SEF.LARGE.jpg", "https://cdn.instructables.com/FBS/T3S9/JTON3SDJ/FBST3S9JTON3SDJ.LARGE.jpg", "https://cdn.instructables.com/FHB/3QVX/JTON3SDM/FHB3QVXJTON3SDM.LARGE.jpg", "https://cdn.instructables.com/FDN/B8YW/JTON3SGD/FDNB8YWJTON3SGD.LARGE.jpg"], "step_title": "Step 5: Priming & Painting"}, {"step": 6, "steps_text": "Normally I take the included base and just super glue the miniature to it.\nThis model is a level up on my skills, so I wanted to make the base a bit more embellished. I'm not a fan of putting the fake plants on the base and other materials. I think that it makes you look at the base first and then the miniature - and that's not how a focal point works.\nFor The Black Kestrel I glued the model to the base as normal, then built up a base with Milliput around the \"pudding\" base at his feet to meet the edge of the 1\" circular plastic base. Then I sculpted some details into the base and let it dry.\nFor the seal coat I always use brush on Matt Acrylic Varnish from Vallejo. It comes in a dropper bottle and fits into my Reaper Bones Learn to Paint Kit case. Wait a day to put the seal coat on to ensure the paint is all dry, else you might cause it to run in spots.\n\nThe photos above show The Black Kestrel in his laboratory working on a cure. The dungeon tiles pictured I picked up on Etsy.", "step_imgs": ["https://cdn.instructables.com/FGA/GJL9/JTON44Q2/FGAGJL9JTON44Q2.LARGE.jpg", "https://cdn.instructables.com/FQN/5HJZ/JTON44PW/FQN5HJZJTON44PW.LARGE.jpg", "https://cdn.instructables.com/FEO/YX7L/JTON44RE/FEOYX7LJTON44RE.LARGE.jpg", "https://cdn.instructables.com/FPV/ASQZ/JTON44RC/FPVASQZJTON44RC.LARGE.jpg"], "step_title": "Step 6: Basing & Seal Coat"}, {"step": 7, "steps_text": "It was late and I was tired. I was a young physician working long, late hours at the hospital in Kith, and it had begun to wear on me. My burden was softened that night when she came in - a broken clavicle, earned in a bar fight. Katya didn't tolerate sultry behavior, and nor did I. I mended her shoulder and she stole my heart. Months later we were wed, and a year later she bore our daughter. Everything was perfect, just like the stories the old bard tells in the town square for a copper piece. And that's when it all began to fall apart. First my daughter got the symptoms. Black fingers, toes. Bleeding, vomiting. Eventually she died - I felt so powerless, so helpless as a physician. I researched and documented everything - trying to find a cure, trying to spare another father from losing his child. And then, my wife, my beloved Katya had fallen to the plague. I was broken. I had nothing left, so I turned to the Order. I had studied at an Order University, so membership to the Order could be obtained anytime after graduation. But the commitment to the Order is a lifetime, and breaking that commitment meant consequences. I had spent my fortune as a physician and mortgaged my estate to try and find the cure. Finding myself homeless and alone I joined the Order. Just as seasons change and the moons drift in the sky, the epidemic ceased. The plague disappeared just as mysteriously as it had arrived. Haunted by my past I continued my work at the monastery, furiously trying to find a cure should the disease return. Late one night I was too fatigued to work, but continued nonetheless. Reaching for a simple tincture of iodine, my hands trembling on the bottle, at once lost their purchase and fell, knocking an entire bookcase of potions and vials all over my body. Broken and burned I lie on the ground, defeated like a bird with clipped wings. The members of the Order saved me that night, but my body was so burned and disfigured that I'd never be recognized by anyone. So shamed by my appearance, I cloaked myself in black, donned a black leather hat and gloves - and the only vestment of my former life - a plague doctor's mask.\nThe Order could not use a cleric so distracted at the monastery. I had kept my oath to serve and protect the innocent, but the Elders of the Order felt that I needed to spend some time among the people - serving, protecting and healing them to find inner peace again. I agreed with them, mostly because it would grant me the ability to research disease in the field and at larger libraries.\nDr Falco Tinnunculus died that day, and The Black Kestrel was born.\n\n\n----\n\nI've also uploaded The Black Kestrel's character sheet. If anyone ends up remaking this project and playing a campaign as The Black Kestrel or \"Kes\" for short, let me know in the comments below.", "step_imgs": ["https://cdn.instructables.com/F1S/3MHU/JTON45PY/F1S3MHUJTON45PY.LARGE.jpg"], "step_title": "Step 7: Bonus: the Black Kestrel Backstory"}], "channel": "Table Top"}, {"category": "Play", "description": "Choose your own piano adventure. Learn to build a quick floor piano, an oversized portable piano, or even add flat/sharp notes for a fully functional full scale!\nSupplies Needed:\nBuild One:\nHVAC tape (Available at Home Depot, Lowes, Hardware store)\nMakey Makey\nBuild Two and Three:\nAluminum foil\nLarge cardboard or Yoga Mat\nDuct Tape\nExtra long hook up wire from STEM pack\nExtra long alligator clips from STEM pack\nMakey Makey", "title": "3 Ways to Build a Makey Makey Floor Piano", "url": "https://www.instructables.com/id/3-Ways-to-Build-a-Makey-Makey-Floor-Piano/", "steps": [{"step": 1, "steps_text": "This super simple floor piano only takes about 10 minutes to set up!\nGrab some HVAC tape from your local hardware store. Please also note that the edge of HVAC tape can me be very sharp!\nUse this aluminum tape to make 6 piano keys on the floor. Then run a strip of foil tape along the bottom to be your EARTH connection. We ran the tape on the bottom and folded the corner to run our EARTH to the top, so the alligator clips would all be out of the way when people are playing this piano with their feet. You need to fold the tape and not tear it as the adhesive is not conductive on HVAC tape. (Picture 1)\nTo make it look more like a piano and protect other players from the sharp edges of the tape, use duct tape to cover the sharp edges and run one piece of duct tape across the bottom.between the key presses and EARTH. (Picture 2)\nAttach an each alligator clip to each foil strip then match each piano key to the piano app. Then make sure to connect EARTH to the grounding strip. The template in picture 3 should help you with your set up. When you step (in socked or bare feet) on a piano key with your heel on EARTH, you will play a piano note! Step on each key to play each note.\nWhat songs can you play?", "step_imgs": ["https://cdn.instructables.com/FTA/VIC8/JSEZ1FCE/FTAVIC8JSEZ1FCE.LARGE.jpg", "https://cdn.instructables.com/F6F/VUP1/JSEZ1G3K/F6FVUP1JSEZ1G3K.LARGE.jpg", "https://cdn.instructables.com/FIH/PYDH/JSEZ1G3U/FIHPYDHJSEZ1G3U.LARGE.jpg"], "step_title": "Step 1: Option 1: Super Simple Floor Piano"}, {"step": 2, "steps_text": "This large scale (see what we did there?) piano takes about one hour to set up. It works great on Eric's MK1 Sampling Keyboard for Makey Makey or this Scratch game.\nCreate a background for your large scale floor piano with a large piece of cardboard and butcher paper. This will make your whole set up transportable!\nGrab a roll of kitchen foil to make piano keys. We pulled out about 24\" and then cut that piece in half to make our keys. (Picture 1)\nSpace each foil out on your background before attaching!\nMake sure none of your foil keys are touching, then use a glue stick to adhere each key to your background. (Picture 2) Wrap each key press around to the back side of your backdrop.\nAttach a wire to each key press at the top edge of the cardboard as in picture 3. Use a small white hook up wire from your Makey Makey kit for each key press. Use some conductive fabric tape or copper tape to attach the metal part of the wire to the aluminum foil key press. (Note: You cannot use the HVAC tape for this as the conductive is not adhesive. So make sure the conductive tape you use also has conductive adhesive. This will ensure a good connection.)\nCreate an EARTH strip with HVAC tape. Each key press will be activated when a socked foot (or barefoot) steps on the earth strip and the key. So make sure your EARTH is close to each key, but not touching. To keep our wires safe, we ran the EARTH strip under neath the key presses, then folded the corner at the end and ran EARTH to the top of our backdrop. You can elbow patch two pieces of HVAC tape together with conductive fabric tape to make your EARTH strip wider.\nNOTE: HVAC tape is sharp on the edges! Make sure to smooth it down or cover the edges of the tape with Duct tape.", "step_imgs": ["https://cdn.instructables.com/FL8/JPO9/JSEZ1G4F/FL8JPO9JSEZ1G4F.LARGE.jpg", "https://cdn.instructables.com/FFH/QJ7M/JSEZ1G5C/FFHQJ7MJSEZ1G5C.LARGE.jpg", "https://cdn.instructables.com/FI1/BCG2/JSEZ1G69/FI1BCG2JSEZ1G69.LARGE.jpg", "https://cdn.instructables.com/F82/AREU/JSL34RQI/F82AREUJSL34RQI.LARGE.jpg"], "step_title": "Step 2: Option 2: Movable Floor Piano"}, {"step": 3, "steps_text": "To hook this up to Eric's MK1 Sampling Keyboard for Makey Makey or this Scratch game, follow the template in picture 1.\nAttach your STEM pack extra long alligator clips to the exposed end of your hook up wire and attach each key to Makey Makey as indicated in picture 1.\nInsulate each key press with duct tape and hook up to your computer to start playing! (Picture 2)", "step_imgs": ["https://cdn.instructables.com/FSL/DORF/JSEZ1FCI/FSLDORFJSEZ1FCI.LARGE.jpg", "https://cdn.instructables.com/FFT/O94M/JSEZ1G48/FFTO94MJSEZ1G48.LARGE.jpg"], "step_title": "Step 3: Hooking Up Makey Makey to the Full Scale Piano"}, {"step": 4, "steps_text": "Check out this template for adding sharps to your piano in picture 1. You'll have to remap a few keys to be letter presses on the back of your Makey Makey. To prepare follow this remap guide to make the mouse movements on the back right header into key presses.\nThe first step is to insulate your previous piano keys. You'll use the black duct tape to insulate your previous keys and BONUS it will make your piano look even more like a piano! (Picture 2)\nTo make the connections for your sharp/flat keys, you'll be making a different type of connection. We will run an EARTH strip to each key press. (This is actually how a circuit board is made for a keyboard! On a keyboard, when your finger presses a key, it makes a connection across two conductive traces. That sends a signal to the computer that you've pressed a key. You'll be doing the same thing with your feet for these piano keys! See picture 3 for a close up of what the conductive traces look like for the flat key and what it looks like to insulate your previous circuits with duct tape.\nWe are using 1\" conductive fabric tape for these key presses, if you have a the Inventor Booster Pack, there is a skinnier version of this tape in the kit. It has conductive adhesive, so it is good for making this more complicated circuit.", "step_imgs": ["https://cdn.instructables.com/FQ7/A1PX/JSEZ1FCL/FQ7A1PXJSEZ1FCL.LARGE.jpg", "https://cdn.instructables.com/F2W/VYJ8/JSEZ1G74/F2WVYJ8JSEZ1G74.LARGE.jpg", "https://cdn.instructables.com/FOV/MM5B/JSEZ1FCP/FOVMM5BJSEZ1FCP.LARGE.jpg"], "step_title": "Step 4: Adding Sharps: the Template and Overview"}, {"step": 5, "steps_text": "First off, you need to run an EARTH strip along the top of your piano. Make sure you've insulated your previous circuits with duct tape.\nFor each key press, you'll put down a conductive tape trace like in picture 1. Then using an extra long hook up wire, place conductive tape on top of the stripped wire to attach it on the top and the bottom to your key press tape trace as seen in picture 1. By sandwiching the wire you are ensuring connectivity. Especially since others will be stepping on these piano keys!\nCover your conductive tape and wiring on the top of your piano with black duct tape. This will insulate your circuit AND keep your wiring in place. In picture 1 and picture 2, you can also see where the EARTH connection is visible. In picture 2, we have NOT connected the EARTH connection for this key press to work yet. Notice that the black duct tape insulates your flat/sharp key press from your previous circuits. Also notice that this EARTH will run across the top of your piano to your previous EARTH connection from your oversized piano. For each flat/sharp key press, you'll run a tape trace down from this EARTH tape trace so that when someone steps on top of both, their foot will complete the circuit.\nRun your EARTH tape trace next to your key press as in picture 3. Make sure you connect to your EARTH strip on the top of your piano AND that this circuit trace runs parallel to your key press. Don't let these two conductive pathways cross or you will have a continuous circuit.\nYou've made a sharp key now! Use duct tape to insulate your earth connection as seen in picture 4.", "step_imgs": ["https://cdn.instructables.com/FQQ/O8LP/JTOMX2IE/FQQO8LPJTOMX2IE.LARGE.jpg", "https://cdn.instructables.com/FEC/GQ9S/JTOMX2PG/FECGQ9SJTOMX2PG.LARGE.jpg", "https://cdn.instructables.com/F3D/06CK/JTOMX2RV/F3D06CKJTOMX2RV.LARGE.jpg", "https://cdn.instructables.com/FHW/K3EC/JTOMX2RZ/FHWK3ECJTOMX2RZ.LARGE.jpg"], "step_title": "Step 5: Option 3: Adding Sharps"}, {"step": 6, "steps_text": "Repeat step 6 for each sharp key. Make sure you have a wire connected to each key press and you cover the exposed wire with conductive tape. Also make sure your key press does NOT touch EARTH. In picture 1 you can see how we are about to wire the next key and that EARTH is connected to the EARTH tape trace.\nIn picture 2, wiring is in place and secured with duct tape. Then we insulated EARTH in picture 3 by placing duct tape over the top and further securing our wiring.\nRepeat until all of your sharps are wired. Run the extra long hook up wires to the back headers of your Makey Makey. If you didn't already, make sure to remap the mouse movements on the back right header to key presses. Here is that remap guide if you need it!\nWe remapped two pins to the letters j and k. Then plugged in all the sharps with the extra long hook up wires from the STEM pack. Make sure you label all your wires in case they come unplugged!\nThis piano works with this Scratch piano coded to be a full octave including sharps/flats! https://scratch.mit.edu/projects/132053565/", "step_imgs": ["https://cdn.instructables.com/FPQ/71QZ/JTOMX3Y4/FPQ71QZJTOMX3Y4.LARGE.jpg", "https://cdn.instructables.com/FAR/PN0Q/JTOMX3V2/FARPN0QJTOMX3V2.LARGE.jpg", "https://cdn.instructables.com/FGI/T339/JTOMX3V3/FGIT339JTOMX3V3.LARGE.jpg", "https://cdn.instructables.com/FQH/100F/JTOMX418/FQH100FJTOMX418.LARGE.jpg"], "step_title": "Step 6: Wiring and Insulating Sharps"}, {"step": 7, "steps_text": "Hook up all of your keys to match this Scratch piano with full octave including sharps/flats!: https://scratch.mit.edu/projects/132053565/\nOr create your own piano in Scratch! Consider creating some laminated sheet music so your friends can attempt some simple songs.", "step_imgs": ["https://cdn.instructables.com/FH0/HXR0/JTOMX44X/FH0HXR0JTOMX44X.LARGE.jpg"], "step_title": "Step 7: Hook It Up and Play!"}, {"step": 8, "steps_text": "Once you've made your piano, you can start dreaming up other pianos. You could use the ultimate stomp pad guide to create switches for piano keys, or even put a piano on a stairwell. But make sure you hold on to the hand rail!\nWe also created a roll up piano (similar to this roll up maze by Frazer McKay) on a yoga mat so we can take it everywhere we go! Make sure to share your remixes in the gallery of this guide! We want to see how you #makeymakey a piano!", "step_imgs": ["https://cdn.instructables.com/FJ9/7HO8/JSEZ1G47/FJ97HO8JSEZ1G47.LARGE.jpg", "https://cdn.instructables.com/FOX/S2T7/JTOMX5RS/FOXS2T7JTOMX5RS.LARGE.jpg"], "step_title": "Step 8: Extensions: Staircase Piano or Roll Up Piano?"}], "channel": "Music"}, {"category": "Play", "description": "The first time I ever saw a hardware chess set was this instructable here and I knew I had to make one for myself. I loved the concept of using commonly available hardware to make chess pieces. With the large variety of hardware available I wanted to take the inspiration that instructable gave me and build my own unique set. Years have gone by since then, and I have had various ideas floating around in my head and now I finally got around to making it.", "title": "Hardware Chess Set", "url": "https://www.instructables.com/id/Hardware-Chess-Set-1/", "steps": [{"step": 1, "steps_text": "Materials:\nA variety of hardware pieces (I will list the specific pieces in the description for each chess piece)\n1/4\", 5/16\" and 3/8\" treaded rod\nEpoxy\nCitric acid (the stuff I found was in the hardware store meant for etching concrete but it is also used in canning and for making bath bombs)\nGun blue\nClear coat\n\nTools:\nDremel rotary tool with cut off discs and a wire sanding wheel\nDrill press\nPliers", "step_imgs": ["https://cdn.instructables.com/F8Q/0JCR/JT91RKO3/F8Q0JCRJT91RKO3.LARGE.jpg", "https://cdn.instructables.com/FVR/6GWX/JT91RKM2/FVR6GWXJT91RKM2.LARGE.jpg", "https://cdn.instructables.com/F3L/0JMR/JT91RKLT/F3L0JMRJT91RKLT.LARGE.jpg", "https://cdn.instructables.com/F3A/CIE9/JT91RKLY/F3ACIE9JT91RKLY.LARGE.jpg", "https://cdn.instructables.com/FI3/0H3J/JT91RKM6/FI30H3JJT91RKM6.LARGE.jpg", "https://cdn.instructables.com/FZ2/BTG5/JT91WWG3/FZ2BTG5JT91WWG3.LARGE.jpg"], "step_title": "Step 1: Materials and Tools"}, {"step": 2, "steps_text": "The pawn uses the following hardware:\n1/4\" × 1 1/2\" threaded rod\n1/4\" × 1\" fender washer\n5/16\" flat washer\n1/4\" flat washer\n1/4\" flanged nut\n1/4\" flanged insert nut\n1/4\" acorn nut\n\nUse the dremel tool to cut a piece of 1/4\" threaded rod to 1 1/2\" long. Epoxy the washers together with the largest one on the bottom and the smallest on top. Make sure they are centered. Screw the flanged nut onto the threaded rod far enough that the rod will go through the washers but not stick out the other side at all. Put a little epoxy on the threads and screw the flanged insert nut onto the rod from the other end all the way down to the flanged nut. Put a little more epoxy on the threads and screw the acorn nut on top of that. Put some epoxy on the bottom of the flanged nut and center it on the stack of washers.", "step_imgs": ["https://cdn.instructables.com/FI0/U3AW/JT91RLFI/FI0U3AWJT91RLFI.LARGE.jpg", "https://cdn.instructables.com/FFN/JHI6/JT91RLAO/FFNJHI6JT91RLAO.LARGE.jpg"], "step_title": "Step 2: Pawn"}, {"step": 3, "steps_text": "Hardware:\n1/4\" × 1 3/4\" threaded rod\n1/4\" × 1 1/4\" fender washer\n3/8\" flat washer\n5/16\" flat washer\n1/4\" flat washer\n1/4\" flanged nut\n1/4\" insert nut × 2 (non tapered)\n1/4\" split lock washer\n5/16\" castellated nut (castle nut)\n\nAs with the pawn, stack the washers from largest to smallest, put the flanged nut on the rod, and the insert nuts on top of that. Use pliers to flatten the split lock washer and epoxy it on top of the insert nuts and then epoxy the castellated nut on top of that. Put epoxy on the bottom of the flanged nut and attach to the stack of washers.", "step_imgs": ["https://cdn.instructables.com/FIH/PABL/JT91S3LH/FIHPABLJT91S3LH.LARGE.jpg", "https://cdn.instructables.com/F9B/D5UD/JT91S3EM/F9BD5UDJT91S3EM.LARGE.jpg"], "step_title": "Step 3: Rook"}, {"step": 4, "steps_text": "Materials:\n1/4\" × 2 1/2\" eye bolt\n1/4\" × 1 1/4\" fender washer\n3/8\" flat washer\n5/16\" flat washer\n1/4\" flat washer\n1/4\" flanged nut\n1/4\" nut × 2\n1/4\" split lock washer × 15\n1/4\" wing nut\n1/4\" acorn nut\n\nStack the washers as before. Cut the eye bolt down to 2 1/4\" and cut the end off the eye to form a hook. Slide the wing nut over the end of the hook and the acorn nut onto the end. Epoxy both in place. Slide the split washers on from the other end and epoxy in place. You will likely have to do them one at a time at first to get them evenly spaced around the curve. Put the two nuts on next, followed by the flanged nut and then attach the whole thing to the washer stack.", "step_imgs": ["https://cdn.instructables.com/F61/8V8O/JT91S93J/F618V8OJT91S93J.LARGE.jpg", "https://cdn.instructables.com/F71/FFS4/JT91S91Z/F71FFS4JT91S91Z.LARGE.jpg"], "step_title": "Step 4: Knight"}, {"step": 5, "steps_text": "Materials:\n1/4\" × 2 3/8\" threaded rod\n1/4\" × 1 1/4\" fender washer\n3/8\" flat washer\n5/16\" flat washer\n1/4\" flat washer × 2\n1/4\" flanged nut\n1/4\" × 1\" spacer\n1/4\" × 1/2\" spacer\n5/16\" acorn nut\n\nStack the washers except the second 1/4\" flat washer. Put the flanged nut on the rod and attach to the washer stack. Put the two spacers on top, followed by the second 1/4\" flat washer and topped with the 5/16\" acorn nut.", "step_imgs": ["https://cdn.instructables.com/F61/IDHS/JT91SDK1/F61IDHSJT91SDK1.LARGE.jpg", "https://cdn.instructables.com/FP3/JS7L/JT91SDJB/FP3JS7LJT91SDJB.LARGE.jpg"], "step_title": "Step 5: Bishop"}, {"step": 6, "steps_text": "Materials:\n5/16\" × 3\" threaded rod\n5/16\" × 1 1/4\" fender washer\n3/8\" flat washer\n5/16\" flat washer × 2\n5/16\" flanged nut\n5/16\" × 1\" spacer × 2\n#12 finish washer\n3/8\" flanged nut\n\nStack the washers, except the second 5/16\" flat washer and put the flanged nut on the rod. Attach the flanged nut/threaded rod assembly to the washer stack. Add the spacers, then the second 5/16\" flat washer, the finish washer, curved upwards and finally top with the 3/8\" flanged nut, upside down.", "step_imgs": ["https://cdn.instructables.com/FFS/AT5H/JT91WWC2/FFSAT5HJT91WWC2.LARGE.jpg", "https://cdn.instructables.com/FTJ/WN22/JT91WWAN/FTJWN22JT91WWAN.LARGE.jpg"], "step_title": "Step 6: Queen"}, {"step": 7, "steps_text": "Materials:\n3/8\" × 3 3/8\" threaded rod\n3/8\" × 1 1/2\" fender washer\n5/16\" × 1 1/4\" fender washer\n3/8\" flat washer\n5/16\" flat washer × 2\n3/8\" flanged nut\n3/8\" nut × 2\n3/8\" coupling nut\n1/2\" square nut\n1/8\" steel rivet\n\nApparently, I forgot to take a picture of the materials before building the kings. I managed to scrounge up an example of everything except the coupling nut but it is plain to see in the finished product picture.\nDrill a hole in one end of the threaded rod big enough for the shaft of the rivet to fit in. Cut the rivet shaft shorter so you don't have to drill as deep. Drill the center of the 5/16\" fender washer bigger if it won't fit over the rod. Stack the washers, except the second 5/16\" flat washer, and put the flanged nut on the end of the rod that does not have the hole. From the other end, add a 3/8\" nut, then the coupling nut, 5/16\" flat washer and the other nut. Top with the square nut and insert the rivet into the hole you drilled in the rod. Attach to the washer stack.", "step_imgs": ["https://cdn.instructables.com/FMY/OC1S/JT91SDNP/FMYOC1SJT91SDNP.LARGE.jpg", "https://cdn.instructables.com/F3T/TXUH/JT91SDOP/F3TTXUHJT91SDOP.LARGE.jpg", "https://cdn.instructables.com/FIZ/0W0W/JT91SDPK/FIZ0W0WJT91SDPK.LARGE.jpg"], "step_title": "Step 7: King"}, {"step": 8, "steps_text": "Mix up the citric acid in a plastic container and put the chess pieces in. Let soak for about 1 1/2 hours to dissolve the zinc coating. It doesn't seem to give off any fumes doing this but I would put it in a well ventilated area just to be safe. Once the zinc has dissolved, rinse the pieces with water and dry them off. Then polish them up with the wire wheel in your dremel. Give half of the pieces two coats of gun blue, rinsing with water, drying and polishing after each coat. Finally, give them all a couple light coats of protective clear coating.", "step_imgs": ["https://cdn.instructables.com/FV9/NKA1/JTCSM68U/FV9NKA1JTCSM68U.LARGE.jpg", "https://cdn.instructables.com/FA9/3QIK/JTCSM66C/FA93QIKJTCSM66C.LARGE.jpg", "https://cdn.instructables.com/FIO/7SKL/JTCSM67J/FIO7SKLJTCSM67J.LARGE.jpg"], "step_title": "Step 8: Finishing"}], "channel": "Table Top"}, {"category": "Play", "description": "Small and handy radio for your little ones. Let them play their favorite songs or fairytales. And that all in the wooden box!", "title": "Kids' Wooden Radio", "url": "https://www.instructables.com/id/Kids-Wooden-Radio/", "steps": [{"step": 1, "steps_text": "When I saw the Horbert radio I knew in instant I want to build something similar for my 2yo daughter. But yet I wanted to make it smaller and handier. Maybe put some lights there. So here we are. Radio for your little ones. It features 7 color buttons, small yet powerful speaker and mp3 player capable of playing songs or fairytales from SD card. Last but not least it features rainbow LEDs around the case to create nice ambient light which can be used as a night lamp while the bedtime fairytale is being played.", "step_imgs": ["https://cdn.instructables.com/FC9/JC7I/JTMST7D4/FC9JC7IJTMST7D4.LARGE.jpg", "https://cdn.instructables.com/FBJ/0OKH/JTMST7DZ/FBJ0OKHJTMST7DZ.LARGE.jpg", "https://cdn.instructables.com/F0K/QJ0G/JTMST7ES/F0KQJ0GJTMST7ES.LARGE.jpg", "https://cdn.instructables.com/FZP/FKVE/JTMST7E0/FZPFKVEJTMST7E0.LARGE.jpg"], "step_title": "Step 1: Story"}, {"step": 2, "steps_text": "I wanted to make the case wooden. It looks nice and I love working with wood. Luckily by the same time, my friend got himself a laser cutter to cut plywood. And it is awesome! Various shapes cut within a few seconds and with awesome accuracy! The graphics file is attached at the bottom of this article.\nDimensions: 90x140x35mm\nThe case is made out of 4mm plywood cut into 8 parts. Front and back plate. Four side plates. Battery and speaker cover. First I glued the four side plates together to form a frame. I've also used some extra wood to reinforce the corners because I want them to be round at the end so I need to have some extra material there to be able to sand the corners down a little bit.\nBefore I glued in the front piece I inserted a thin layer of plexiglass between the front plate and the frame. This will allow me to later attach the LEDs to create a nice shiny ring around the radio. Some extra design touch. I've used 4mm plexiglass which I cut into rough shape to fit on the frame. Plexiglass is glued to the frame and front plate with the use of super glue. Don't worry about the overlapping plexiglass, it will be sanded out with final shaping.", "step_imgs": ["https://cdn.instructables.com/FYQ/4BU8/JTMST57T/FYQ4BU8JTMST57T.LARGE.jpg", "https://cdn.instructables.com/FA7/P329/JTMST57W/FA7P329JTMST57W.LARGE.jpg", "https://cdn.instructables.com/FOS/0XWR/JTMST5AM/FOS0XWRJTMST5AM.LARGE.jpg", "https://cdn.instructables.com/FY4/O2DM/JTMST5AP/FY4O2DMJTMST5AP.LARGE.jpg", "https://cdn.instructables.com/FXB/21OA/JTMST5AS/FXB21OAJTMST5AS.LARGE.jpg", "https://cdn.instructables.com/FY9/9S0Y/JTMST5BF/FY99S0YJTMST5BF.LARGE.jpg"], "step_title": "Step 2: The Wooden Case"}, {"step": 3, "steps_text": "To add an extra coolness and effect in the dark I've added 4 RGB LEDs around the case. Plexiglass inserted earlier will allow the emitted light to spread around the case. I've used standard addressable WS2818 RGB LEDs daisy-chained together. One in each corner of the case.\nFirst, glue these tiny LEDs into the corners on top of the plexiglass with super glue. Don't forget to mark the pin 1 otherwise you won't be able to properly interconnect them - see my tiny black mark made by permanent marker. Second, interconnect them together. I've used 0.3mm copper wire with transparent insulation.\nVCC to VCC\nGND to GND\nOUT to IN of the next LED", "step_imgs": ["https://cdn.instructables.com/FDJ/JL5D/JTMST5H4/FDJJL5DJTMST5H4.LARGE.jpg", "https://cdn.instructables.com/FVH/2W03/JTMST5JZ/FVH2W03JTMST5JZ.LARGE.jpg", "https://cdn.instructables.com/FEQ/MR9F/JTMST5Q8/FEQMR9FJTMST5Q8.LARGE.jpg", "https://cdn.instructables.com/FSI/TC6O/JTMST5VY/FSITC6OJTMST5VY.LARGE.jpg"], "step_title": "Step 3: Ambient Rainbow Lights"}, {"step": 4, "steps_text": "Prior to gluing the back plate in place cut small holes on one side of the frame to fit Arduino NANO USB port, MP3 player SD card slot and power switch. I've decided to put them on the left side of the radio. Using a small knife and a square file I've cut precise holes. As small as possible to hide as much as possible.\nNow it is time to glue the back plate in place and form the final shape of the radio. After the glue set, I've used a bench sander to shape the round corners and clean up all the surfaces. To protect the edges I've also sanded them a little bit. Protect the wires coming out of the RGB LEDs to prevent any damage to the insulation while sanding.\nThe last step is to glue a speaker cover ring over the speaker hole. It will hold the speaker in place. As a final protection, I've applied clear lacquer in 4 layers.", "step_imgs": ["https://cdn.instructables.com/F8T/WN0W/JTMST6L3/F8TWN0WJTMST6L3.LARGE.jpg", "https://cdn.instructables.com/FA2/HQSS/JTMST6L4/FA2HQSSJTMST6L4.LARGE.jpg", "https://cdn.instructables.com/FCD/G3GR/JTMST65W/FCDG3GRJTMST65W.LARGE.jpg", "https://cdn.instructables.com/FFL/3M5B/JTMST5EO/FFL3M5BJTMST5EO.LARGE.jpg", "https://cdn.instructables.com/F3X/UQFQ/JTMST6GG/F3XUQFQJTMST6GG.LARGE.jpg", "https://cdn.instructables.com/F47/6SWH/JTMSTD9V/F476SWHJTMSTD9V.LARGE.jpg", "https://cdn.instructables.com/F71/MMXJ/JTMST6QB/F71MMXJJTMST6QB.LARGE.jpg"], "step_title": "Step 4: Finalizing the Case"}, {"step": 5, "steps_text": "To protect the speaker from being damaged by the curious fingers I wanted to put a mesh of some kind over the speaker hole. But since I don't own a 3D printer and I didn't have anything else suitable, I've created it by soldering 1mm brass rods into a mesh.\nIt's perfect. It's incredibly solid. Nothing can penetrate it and also looks pretty nice. To hide the solder joints I've sprayed it with white color. Speaker cover is glued into the radio with use of super glue.", "step_imgs": ["https://cdn.instructables.com/F5D/CKO4/JTMST79T/F5DCKO4JTMST79T.LARGE.jpg", "https://cdn.instructables.com/FPF/WP32/JTMST6TP/FPFWP32JTMST6TP.LARGE.jpg", "https://cdn.instructables.com/F1K/P8HY/JTMST71Q/F1KP8HYJTMST71Q.LARGE.jpg", "https://cdn.instructables.com/FKD/J84H/JTMST74M/FKDJ84HJTMST74M.LARGE.jpg"], "step_title": "Step 5: Speaker Cover Mesh"}, {"step": 6, "steps_text": "The heart of the radio is my favorite Arduino NANO board. It reads the states of 7 buttons, controls DFPlayer mini MP3 player and controls the addressable RGB LEDs. DFPlayer is a tiny MP3 player with built-in SD card slot and sound amplifier which can handle up to 3W speaker. I've used a 0.5W 8ohm speaker.", "step_imgs": ["https://cdn.instructables.com/FZM/34DB/JTMST589/FZM34DBJTMST589.LARGE.jpg"], "step_title": "Step 6: Inside the Radio"}, {"step": 7, "steps_text": "First of all, create the buttons platform. Radio contains 7 programmable buttons in total soldered to small piece of a perf board. Originally I wanted each button to have a different color to play 7 different songs. But it didn't look nice so I decided to have one black button to change the volume level and yellow, blue and red pairs to select previous or next song out of 3 groups of songs. Each button is connected to one digital pin of Arduino and they are all grounded via 1Kohm resistor.\nThe buttons don't have standard perf board friendly spacing so I had to place them into the holes in the case and solder them together with a piece of a brass rod using free form technique. Now when the layout of buttons was fixed it was time to solder it to the perf board upside down and add 7 wires to each button. Finally, I soldered the 8th wire for the common ground.", "step_imgs": ["https://cdn.instructables.com/FH6/23H2/JTMST5AL/FH623H2JTMST5AL.LARGE.jpg", "https://cdn.instructables.com/FO7/I0LI/JTMST58V/FO7I0LIJTMST58V.LARGE.jpg", "https://cdn.instructables.com/F5Y/90NK/JTMST5BI/F5Y90NKJTMST5BI.LARGE.jpg", "https://cdn.instructables.com/F5V/69TC/JTMST6NG/F5V69TCJTMST6NG.LARGE.jpg"], "step_title": "Step 7: The Buttons"}, {"step": 8, "steps_text": "Now when you have all the parts needed, let's finish the job. I first soldered all the wires between the Arduino Nano, DFPlayer, buttons, speaker, RGB LEDs, battery and on/off switch outside the radio because there is not enough room inside the case once they will be inserted. It also allowed me to test the electronics outside the case before all the components are irreversibly glued inside.\nFirst I inserted and glued Arduino NANO, DFPlayer and on/off switch into the case with use of Mamut Glue. The Mamut Glue gave me more time to precisely and nicely place the boards inside and will hold them better in the future because it is flexible. Next was a speaker mounted on the bottom of the speaker cover mesh again with Mamut Glue. And the last parts were the buttons and the battery pack. The battery pack sits in the hole on the back to allow easily replace the batteries. Later I replaced the 4xAA batteries with a single 9V battery. It's much lighter.\nIt is finished! Let's program it!", "step_imgs": ["https://cdn.instructables.com/FH1/8HPN/JTMST7AE/FH18HPNJTMST7AE.LARGE.jpg", "https://cdn.instructables.com/FO4/QYQG/JTMSTGRO/FO4QYQGJTMSTGRO.LARGE.jpg"], "step_title": "Step 8: Assembling It Together"}, {"step": 9, "steps_text": "I've simply used examples from DFPlayer site and added some code to read the buttons and control the LEDs from my Ever Blooming Mechanical Tulip project. The code is quite simple. Definitely not the cleanest I ever made but it works.\nIt requires the SD card to contains 3 folders named 01, 02, 03 for each color pair. Within each folder can be up to 255 songs named 001.mp3 to 255.mp3. I'd rather name the folders red, blue and yellow but DFPlayer does not support that.\nDFPlayer is pretty easy to use. It communicates via serial line and has a pretty nice library with various functions to read and control the state of the player. I would only add support for human readable folder and file names.\nDon't forget to share your creation! Like this article. Also, consider supporting me by buying some of my products in my Tindie store.\nYou can find me and my latest projects on my Twitter account.\nBelow are Arduino source code and DXF file for laser cutter with radio wooden parts.", "step_imgs": ["https://cdn.instructables.com/F8S/GR5E/JTMSTJUL/F8SGR5EJTMSTJUL.LARGE.jpg"], "step_title": "Step 9: Playing the Songs!"}], "channel": "Toys"}, {"category": "Play", "description": "I've always enjoyed magic with playing cards. With this new gimmick, you can take your magic to the next level! Even if you are not into magic, you may just want to make a cool looking piece of art that you can show off to your friends. If that's the case, grab some materials and let's get started!\nI hope you enjoy!", "title": "Playing Card Gimmick/Art", "url": "https://www.instructables.com/id/Playing-Card-GimmickArt/", "steps": [{"step": 1, "steps_text": "Tools:\nPen/Fine-tip sharpie\nNail polish remover\nZip-lock bag\nRubber Bands\nRuler (optional)\nX-ACTO Knife\nCutting board\nPlastic bag\nPencil\nToilet paper\nMaterials:\nPaper\nDeck of Cards (two different colors)", "step_imgs": [], "step_title": "Step 1: Tools and Materials"}, {"step": 2, "steps_text": "Take out a pencil and some paper and start sketching out your design. Above and to the left, you will see some creative versions of this project by Andy Elliot. I made mine into a magic gimmick, he made his into artwork. Take into consideration that your design must have some connection with the border of the card. Remember, this doesn't have to be perfect.\nTip: Be creative with your design, make it yours.", "step_imgs": ["https://cdn.instructables.com/FEV/BXIF/JTEMVOUQ/FEVBXIFJTEMVOUQ.LARGE.jpg", "https://cdn.instructables.com/F3W/MOKR/JTEMZZ8K/F3WMOKRJTEMZZ8K.LARGE.jpg"], "step_title": "Step 2: Sketch Out Your Design"}, {"step": 3, "steps_text": "Once you have your design finished and ready to go, I recommend you transferring it onto a playing card so that you have an idea of the scale. I just eyeballed for this step, so it's a bit different then the original.", "step_imgs": ["https://cdn.instructables.com/FS8/QOB6/JTEMZZ9G/FS8QOB6JTEMZZ9G.LARGE.jpg"], "step_title": "Step 3: Transfer Design to Playing Card"}, {"step": 4, "steps_text": "There are two main types of cards, spacers and figure cards.\nTo make spacers, get out your cutting board and cut out the middle part of the card with your X-ACTO knife, leaving the borders. Make sure your knife is sharp or else you'll have trouble cutting. If needed, use a ruler or straight edge to make this easier. Try to be as neat as possible.\nThe figure cards are the ones that are part of your design. Trace the design from from the card you made in step #3 onto the figure cards using your X-ACTO Knife.\nTip: After a while, your hands start cramping up. When this happens, wrap a couple of rubber bands around what you have, stick it in a zip-lock bag, and take a break.", "step_imgs": ["https://cdn.instructables.com/FAM/O8MC/JTEMZZC5/FAMO8MCJTEMZZC5.LARGE.jpg", "https://cdn.instructables.com/F69/KIU6/JTEMZZBA/F69KIU6JTEMZZBA.LARGE.jpg", "https://cdn.instructables.com/F9L/QWOR/JTEMZZD2/F9LQWORJTEMZZD2.LARGE.jpg", "https://cdn.instructables.com/FCV/12CJ/JTEMZZET/FCV12CJJTEMZZET.LARGE.jpg"], "step_title": "Step 4: Start Cutting"}, {"step": 5, "steps_text": "To make a blank card, start by picking a red card without a lot of ink on its face (preferably an ace). Take some toilet paper and pour some nail polish remover onto it. Start scrubbing the damp toilet paper on the ink of the card. The ink should start to rub off. Repeat this process until it rubs off completely.\nTip: The shine starts to wear off the card when it is rubbed with remover. To get a nice, even look, rub everywhere on the card to get all the shine off.", "step_imgs": ["https://cdn.instructables.com/F1I/B331/JTEN00NB/F1IB331JTEN00NB.LARGE.jpg", "https://cdn.instructables.com/FG6/1JK5/JTEN00NE/FG61JK5JTEN00NE.LARGE.jpg", "https://cdn.instructables.com/FGN/EB81/JTEN00NR/FGNEB81JTEN00NR.LARGE.jpg"], "step_title": "Step 5: Making a Blank Card"}, {"step": 6, "steps_text": "Go ahead and fill in the minor details. I used an pen to draw the small 2 of clubs behind the wand. I went over the figure cards again with the X-ACTO knife to get rid of little card hangings that I had missed.", "step_imgs": ["https://cdn.instructables.com/FST/4MLW/JTEMZZFP/FST4MLWJTEMZZFP.LARGE.jpg"], "step_title": "Step 6: The Tiny Details"}, {"step": 7, "steps_text": "Line up the cards how you want them to be. Glue them up from the blank card. If you want to, out-jog several cards to make it seem more realistic. After every card, press down on it for a few seconds with a heavy weight such as a dictionary.\nCongrats! You're done!\nIf you enjoyed this project, please vote for this Instructable.", "step_imgs": ["https://cdn.instructables.com/FOT/ZC3J/JTEMZZGL/FOTZC3JJTEMZZGL.LARGE.jpg", "https://cdn.instructables.com/F2R/6LGX/JTEN9X6P/F2R6LGXJTEN9X6P.LARGE.jpg", "https://cdn.instructables.com/FAS/JQDW/JTEN4VM8/FASJQDWJTEN4VM8.LARGE.jpg"], "step_title": "Step 7: Finishing Up"}], "channel": "Magic Tricks"}, {"category": "Play", "description": "I always wanted to own a personal arcade gaming style game controller, so when I noticed that my ex-employer was throwing away some old broken keyboards, I decided to take them home. These keyboards were the perfect ingredients for this project.\nThe other materials that I used to complete this project included: leftover plywood pieces, a leftover tile piece, small screws from broken toys and electronics, 2 broken flat 3 pin plugs, white and black plastic containers, tyre inner tube, 2 bicycle wheel spokes, Christmas balls or ball shape plastic container lids (like the green shampoo bottle in the above picture) and a small piece of iron sheet.", "title": "Game Controller Made 99.9% From Trash", "url": "https://www.instructables.com/id/Game-Controller-Made-999-From-Trash/", "steps": [{"step": 1, "steps_text": "For the joysticks, I used 4 rectangular pieces of iron sheet which I cut, drilled and folded as in the pictures above and attached a bolt (two 4\" long bolts and two 1.5\" long bolts) to each of them.", "step_imgs": ["https://cdn.instructables.com/FHI/PD6Z/JT4TLVZZ/FHIPD6ZJT4TLVZZ.LARGE.jpg", "https://cdn.instructables.com/FE9/UFDD/JT4TLW1N/FE9UFDDJT4TLW1N.LARGE.jpg", "https://cdn.instructables.com/FJT/CYUQ/JT4TLW1L/FJTCYUQJT4TLW1L.LARGE.jpg", "https://cdn.instructables.com/FZR/0L75/JT4TLW1U/FZR0L75JT4TLW1U.LARGE.jpg", "https://cdn.instructables.com/FKF/UNRE/JT4TLW8B/FKFUNREJT4TLW8B.LARGE.jpg", "https://cdn.instructables.com/FLQ/OD0D/JT4TLW3G/FLQOD0DJT4TLW3G.LARGE.jpg", "https://cdn.instructables.com/FGB/N4PO/JT4TLW54/FGBN4POJT4TLW54.LARGE.jpg"], "step_title": "Step 1: Making the Joysticks - Step 1"}, {"step": 2, "steps_text": "Taking the piece of metal found in the 3 pin plug, I removed the screw and drilled a hole opposite to the screw hole, so that the small metal cube has a hole on four of its sides. Then, I sanded the sides a little bit as in the above picture.", "step_imgs": ["https://cdn.instructables.com/FL3/4QBG/JT4TM8WN/FL34QBGJT4TM8WN.LARGE.jpg", "https://cdn.instructables.com/FA6/2I3H/JT4TM8WM/FA62I3HJT4TM8WM.LARGE.jpg", "https://cdn.instructables.com/F8F/CPNJ/JT4TLWI2/F8FCPNJJT4TLWI2.LARGE.jpg", "https://cdn.instructables.com/F6H/OKFT/JT4TMAIB/F6HOKFTJT4TMAIB.LARGE.jpg", "https://cdn.instructables.com/FT1/SQH4/JT4TLWI8/FT1SQH4JT4TLWI8.LARGE.jpg"], "step_title": "Step 2: Making the Joysticks - Step 2"}, {"step": 3, "steps_text": "Next, using a lollipop stick (I guess the inner ink tube of a ball pen also can do the trick), I joined the metal cube to 2 of the folded iron sheet pieces. I inserted pieces of soft fabric between the metal cube and the iron sheet to limit frictions. I used the small metal wire found under the space bar of the keyboard and inserted it in the lollipop stick to secure everything together. Now, as you might see in the last picture, the long bold pivots smoothly over the small bolt. :)", "step_imgs": ["https://cdn.instructables.com/F45/JZUR/JT91MGUS/F45JZURJT91MGUS.LARGE.jpg", "https://cdn.instructables.com/F20/OWVZ/JT4TLW8D/F20OWVZJT4TLW8D.LARGE.jpg", "https://cdn.instructables.com/FSU/EQ9E/JT4TLW96/FSUEQ9EJT4TLW96.LARGE.jpg", "https://cdn.instructables.com/FF4/IJPE/JT4TLWCF/FF4IJPEJT4TLWCF.LARGE.jpg", "https://cdn.instructables.com/FNN/3KNR/JT4TLW9G/FNN3KNRJT4TLW9G.LARGE.jpg", "https://cdn.instructables.com/F6D/QEWE/JT4TLW9X/F6DQEWEJT4TLW9X.LARGE.jpg", "https://cdn.instructables.com/FOU/669J/JT4TLW8G/FOU669JJT4TLW8G.LARGE.jpg", "https://cdn.instructables.com/FVN/WXVA/JT4TLW9Y/FVNWXVAJT4TLW9Y.LARGE.jpg", "https://cdn.instructables.com/F6G/T2OX/JT4TLWBU/F6GT2OXJT4TLWBU.LARGE.jpg"], "step_title": "Step 3: Making the Joysticks - Step 3 - Take a Break and Eat a Lollipop!!"}, {"step": 4, "steps_text": "Now that the joystick rods were ready, I cut 2 circles (1 wooden circle for each joystick) from a piece of 1/2\" plywood. I was planning to use the number pad part of the keyboard for the joystick, so the diameter of the circle is the distance between number 4 to number 6.\nAfter cutting the circle, I drilled four holes at 90 degrees apart from the center of the circle and fastened some bolts and nuts in it as shown in the picture.", "step_imgs": ["https://cdn.instructables.com/FVA/ERPY/JT4TLWBW/FVAERPYJT4TLWBW.LARGE.jpg", "https://cdn.instructables.com/F1D/KE7O/JT4TLWCE/F1DKE7OJT4TLWCE.LARGE.jpg"], "step_title": "Step 4: Making the Joysticks - Step 4"}, {"step": 5, "steps_text": "Using a bicycle spoke, I made a spring that would fit exactly as in the above picture. I, then, cut the number pad part of the keyboard and fitted the joystick to the space where number 5 was located.\nI cut a piece of 3/4\" plywood @ 54 cm x 12 cm and drilled 2 holes to attach the 2 joysticks to it.\nNote: If you do not wish to cut your keyboard, you can also fix the above mechanism directly to your existing keyboard. You will just need to sacrifice the number 5 button of your keyboard's number pad. ;)", "step_imgs": ["https://cdn.instructables.com/FAO/SJC6/JT4TLWCG/FAOSJC6JT4TLWCG.LARGE.jpg", "https://cdn.instructables.com/F6V/OI18/JT8X89Z9/F6VOI18JT8X89Z9.LARGE.jpg", "https://cdn.instructables.com/F8I/SLFP/JT8X7GPD/F8ISLFPJT8X7GPD.LARGE.jpg", "https://cdn.instructables.com/F01/72AL/JT8X8A1B/F0172ALJT8X8A1B.LARGE.jpg", "https://cdn.instructables.com/FZV/N5WQ/JT8X7IY6/FZVN5WQJT8X7IY6.LARGE.jpg", "https://cdn.instructables.com/FD7/UI5F/JT8X7H5R/FD7UI5FJT8X7H5R.LARGE.jpg", "https://cdn.instructables.com/FG1/D87Z/JT8X7H8Y/FG1D87ZJT8X7H8Y.LARGE.jpg", "https://cdn.instructables.com/FWQ/3KEL/JT8X7JA3/FWQ3KELJT8X7JA3.LARGE.jpg", "https://cdn.instructables.com/FKB/Y4PT/JT8X7JJY/FKBY4PTJT8X7JJY.LARGE.jpg"], "step_title": "Step 5: Making the Joysticks - Step 5"}, {"step": 6, "steps_text": "I cut 2 pieces of aluminium tube @ 4.5 cm long and using a hammer, I inserted a nut in each tube. If you do not have aluminium tube, an old pen could very well do the trick.\nThen, for the nob, I used 2 Christmas balls. I filled them with hot glue and then inserted a long nut in it.", "step_imgs": ["https://cdn.instructables.com/FSV/ZIJT/JT4TLWNL/FSVZIJTJT4TLWNL.LARGE.jpg", "https://cdn.instructables.com/FQV/7861/JT4TLWNX/FQV7861JT4TLWNX.LARGE.jpg", "https://cdn.instructables.com/F5X/OYGT/JT91MJVS/F5XOYGTJT91MJVS.LARGE.jpg"], "step_title": "Step 6: Making the Joysticks - Step 6"}, {"step": 7, "steps_text": "Before cutting the transparent plastic contact layers of the keyboard, I used a multi-meter to determine which connection is which. You will note that the main connection lines run in horizontal and vertical lines. I noted down the horizontal lines as A,B,C,.. and the vertical connection lines as 1,2,3,... and then determined which keys are triggered when connecting a horizontal line to a vertical line. For example, connecting horizontal line A to vertical line 1 triggers the letter 'Q'.\nWhen this was done, I started cutting the material according to the size of the buttons that I would use. After placing the plastic in position on the 3/4\" plywood piece that I had cut for the joystick, I used some small screws to connect wires to it. This part was easier than I had thought and the tiny screws made a very good contact for the plastic and the wires.", "step_imgs": ["https://cdn.instructables.com/F3M/X1CL/JT8X7JSE/F3MX1CLJT8X7JSE.LARGE.jpg", "https://cdn.instructables.com/FGP/QEV1/JT91MH0O/FGPQEV1JT91MH0O.LARGE.jpg", "https://cdn.instructables.com/FMM/RI3P/JT4TLWCL/FMMRI3PJT4TLWCL.LARGE.jpg", "https://cdn.instructables.com/F5F/63ML/JT8X7HEP/F5F63MLJT8X7HEP.LARGE.jpg", "https://cdn.instructables.com/FT5/VY91/JT8X7JQ0/FT5VY91JT8X7JQ0.LARGE.jpg", "https://cdn.instructables.com/FZR/71KC/JT8X7HKR/FZR71KCJT8X7HKR.LARGE.jpg"], "step_title": "Step 7: Customising the Keyboard Plastic Contact Layers"}, {"step": 8, "steps_text": "For installing the other buttons, I did the same thing. I cut the keyboard's plastic contact layers accordingly and fixed it on a piece of plywood. Then, I attached some wires to it using some small screws and finally, fixed the keyboard buttons over it with some screws.", "step_imgs": ["https://cdn.instructables.com/FD0/IUWS/JT8X7HQK/FD0IUWSJT8X7HQK.LARGE.jpg", "https://cdn.instructables.com/F1V/XT5C/JT8X7HXU/F1VXT5CJT8X7HXU.LARGE.jpg", "https://cdn.instructables.com/FZ3/XPHH/JT8X7IKJ/FZ3XPHHJT8X7IKJ.LARGE.jpg", "https://cdn.instructables.com/FXF/T906/JT8X7I9H/FXFT906JT8X7I9H.LARGE.jpg"], "step_title": "Step 8: Installing the Other Keys"}, {"step": 9, "steps_text": "It was now time to connect the keyboard's PCB to the DIY game controller wires.\nFirstly, I sanded the PCB connection part lightly and then soldered wires to all the connectors. (Please note that for this project I have used the brown PCB from the third picture. I have used the green Keyboard PCB for illustration purposes as I had not taken any picture while doing that part.)\nAfter soldering all the wires, I applied hot glue to the soldered part to secure them firmly.\nThen, I connected the Keyboard USB to my laptop and used a free emulator like snes9x to test the buttons.\nThis part was a bit tricky. On a keyboard you cannot press various keys simultaneously. Sometimes when pressing 1 key may prevent another key from working.\nAfter several trials and errors, I have found that the combination of keys as used in picture 5 and 6 were 1 solution to this problem.", "step_imgs": ["https://cdn.instructables.com/FKJ/LMZV/JT91MGQ5/FKJLMZVJT91MGQ5.LARGE.jpg", "https://cdn.instructables.com/FEM/MTGY/JT91MGQF/FEMMTGYJT91MGQF.LARGE.jpg", "https://cdn.instructables.com/FA7/R7KI/JT8X7ISL/FA7R7KIJT8X7ISL.LARGE.jpg", "https://cdn.instructables.com/FL3/VFLZ/JT8X7IVY/FL3VFLZJT8X7IVY.LARGE.jpg", "https://cdn.instructables.com/FDG/KVYK/JT91SN50/FDGKVYKJT91SN50.LARGE.jpg", "https://cdn.instructables.com/FXX/RHPS/JT91SN51/FXXRHPSJT91SN51.LARGE.jpg"], "step_title": "Step 9: Connecting the Buttons to the Keyboard's PCB"}, {"step": 10, "steps_text": "After ensuring that everything was working fine, it was now time to fix everything in place and make a decent looking enclosure box. I used some leftover 1/2\" & 3/4\" plywood pieces to make the walls of the box. For the game controller top, I used a piece of 1/2\" plywood and drilled appropriate holes for the places where the buttons would pop out.", "step_imgs": ["https://cdn.instructables.com/FW3/70LB/JT4TLWCO/FW370LBJT4TLWCO.LARGE.jpg", "https://cdn.instructables.com/F1R/GTGW/JT4TLWCK/F1RGTGWJT4TLWCK.LARGE.jpg", "https://cdn.instructables.com/FFC/KS2U/JT4TLWCM/FFCKS2UJT4TLWCM.LARGE.jpg", "https://cdn.instructables.com/FM4/MLP1/JT4TLWCJ/FM4MLP1JT4TLWCJ.LARGE.jpg", "https://cdn.instructables.com/FAV/E120/JT4TLWCW/FAVE120JT4TLWCW.LARGE.jpg", "https://cdn.instructables.com/FYP/TAS2/JT4TLWCQ/FYPTAS2JT4TLWCQ.LARGE.jpg"], "step_title": "Step 10: Fixing Everything Together"}, {"step": 11, "steps_text": "For now, everything was working but the joystick's movements were very loose and sensitive and secondly, it was not very accurate, for eg, if I push it to the right it will sometime moves up-right or down right.\nSo, to fix the looseness issue, I used a piece of inner tyre tube, which I fixed below the controller box plywood. This acted a very good spring and would always bring the joystick back to the center.\nSecondly, to improve accuracy, I took a piece of plastic from an empty car shampoo bottle and fixed it on the area where the joystick would move as shown in the pictures above. The plastic acted as a guide for the joystick movements as well as prevented the joystick from breaking if someone would apply extensive force over it.", "step_imgs": ["https://cdn.instructables.com/FON/SKUG/JT4TLWDB/FONSKUGJT4TLWDB.LARGE.jpg", "https://cdn.instructables.com/FXE/4NVI/JT4TLWDL/FXE4NVIJT4TLWDL.LARGE.jpg", "https://cdn.instructables.com/FK8/GJXX/JT4TLWHT/FK8GJXXJT4TLWHT.LARGE.jpg", "https://cdn.instructables.com/FJW/Z1IE/JT4TLWDO/FJWZ1IEJT4TLWDO.LARGE.jpg", "https://cdn.instructables.com/FKM/K08U/JT91MH0H/FKMK08UJT91MH0H.LARGE.jpg", "https://cdn.instructables.com/FXQ/HHNT/JT4TLWDU/FXQHHNTJT4TLWDU.LARGE.jpg", "https://cdn.instructables.com/FG9/55VM/JT4TLWE2/FG955VMJT4TLWE2.LARGE.jpg", "https://cdn.instructables.com/FJK/WE62/JT4TLWEB/FJKWE62JT4TLWEB.LARGE.jpg", "https://cdn.instructables.com/FPZ/JAC5/JT4TLWDZ/FPZJAC5JT4TLWDZ.LARGE.jpg", "https://cdn.instructables.com/FPD/QT6Z/JT4TLWDH/FPDQT6ZJT4TLWDH.LARGE.jpg", "https://cdn.instructables.com/FDR/1WA9/JT4TLWDD/FDR1WA9JT4TLWDD.LARGE.jpg"], "step_title": "Step 11: Improving the Toughness and Accuracy of the Game Controller"}, {"step": 12, "steps_text": "I used a piece of leftover tile to cover the wooden top of the controller. Using an angle grinder with a tile cutter disk, I cut out holes as in the picture above and glued the tile to the top of the controller.\nI must say the tile piece completely changed the look of the controller. ;)", "step_imgs": ["https://cdn.instructables.com/FDN/HE2D/JT4TLWD0/FDNHE2DJT4TLWD0.LARGE.jpg", "https://cdn.instructables.com/FKH/5C0V/JT4TLWD9/FKH5C0VJT4TLWD9.LARGE.jpg", "https://cdn.instructables.com/FDJ/45V2/JT4TLWHQ/FDJ45V2JT4TLWHQ.LARGE.jpg", "https://cdn.instructables.com/F6P/XBXV/JT4TLWI0/F6PXBXVJT4TLWI0.LARGE.jpg"], "step_title": "Step 12: Adding the Controller's Top"}, {"step": 13, "steps_text": "To prevent the pieces of tyre inner tube from tearing with time, I secured it using the small copper metal which I found from an old lifeless flexible water hose. This fitted nicely in place. I used a nut to secure everything on the joystick rode together.", "step_imgs": ["https://cdn.instructables.com/FND/PIHU/JT4TLWE5/FNDPIHUJT4TLWE5.LARGE.jpg", "https://cdn.instructables.com/F0Q/7THV/JT4TLWE8/F0Q7THVJT4TLWE8.LARGE.jpg", "https://cdn.instructables.com/FER/XCJW/JT4TLWRY/FERXCJWJT4TLWRY.LARGE.jpg", "https://cdn.instructables.com/FA4/X570/JT4TLWTN/FA4X570JT4TLWTN.LARGE.jpg"], "step_title": "Step 13: Securing the Tyre Inner Tube"}, {"step": 14, "steps_text": "Now that everything was working flawlessly, it was now time to improve on the game controller's appearance. I used an empty white plastic container to add some borders around the buttons and the joystick.\nIn addition to that, in order to prevent the controller from sliding, I cut some circular pieces of inner tyre tube which I glued below the controller.\nThe only thing that I BOUGHT for this project was a piece of veneer contact paper which I glued all over the plywood box.\nHope you like this instructable and find it easy to understand.\nIf you have any questions or suggestions, please feel free to comment.", "step_imgs": ["https://cdn.instructables.com/F4E/IS6A/JT4TLWG2/F4EIS6AJT4TLWG2.LARGE.jpg", "https://cdn.instructables.com/FCR/2TL7/JT4TLWG1/FCR2TL7JT4TLWG1.LARGE.jpg", "https://cdn.instructables.com/FVJ/HUWT/JT4TLWTP/FVJHUWTJT4TLWTP.LARGE.jpg", "https://cdn.instructables.com/F8X/AXLW/JT4TLWTX/F8XAXLWJT4TLWTX.LARGE.jpg", "https://cdn.instructables.com/FJC/L70W/JT4TLWU3/FJCL70WJT4TLWU3.LARGE.jpg", "https://cdn.instructables.com/FLK/VZB5/JT4TLWU9/FLKVZB5JT4TLWU9.LARGE.jpg", "https://cdn.instructables.com/FDF/V0IU/JT8X7J39/FDFV0IUJT8X7J39.LARGE.jpg", "https://cdn.instructables.com/FNO/ILE9/JT4TLVYD/FNOILE9JT4TLVYD.LARGE.jpg", "https://cdn.instructables.com/F7T/KJ5Y/JT4TLVUI/F7TKJ5YJT4TLVUI.LARGE.jpg"], "step_title": "Step 14: Improving the Look"}], "channel": "Video Games"}, {"category": "Play", "description": "Today I will teach you how to make a simple chest for holding your D&D dice and other gear such as miniatures and pens.", "title": "How to Make a Dice Chest", "url": "https://www.instructables.com/id/How-to-Make-a-Dice-Chest/", "steps": [{"step": 1, "steps_text": "You will need a saw, a drill, a small and a large Phillips screwdriver, screws, a set of hinges, and a latch. You will also need enough wood to create a 14x6 1/2 inches box (the exact measurements are provided in the next step).\nWARNING: Sharp tools are needed for this project so make sure to use proper eye protection and practice safe use of the tools.", "step_imgs": ["https://cdn.instructables.com/FVI/HZ7X/JTEN99AO/FVIHZ7XJTEN99AO.LARGE.jpg", "https://cdn.instructables.com/F0R/SJRK/JTEN99VC/F0RSJRKJTEN99VC.LARGE.jpg", "https://cdn.instructables.com/FTK/UGJA/JTEN99R6/FTKUGJAJTEN99R6.LARGE.jpg"], "step_title": "Step 1: Required Materials"}, {"step": 2, "steps_text": "The lid of the box will need to be 14 inches long and 6 1/2 inches wide.\nThe sides of the box will be 14 inches long and 1 3/4 inches wide.\nYou will need to cut two end pieces that will be 4 1/2 inches long and 2 inches wide.\nThe bottom of the box will be 12 inches long and 4 1/2 inches wide.\nMake sure to exercise caution when cutting the wood. There are multiple factors such as knots and the grain of the wood that can make cutting difficult without the use of power tools.", "step_imgs": ["https://cdn.instructables.com/FIO/P1X7/JTEN99BQ/FIOP1X7JTEN99BQ.LARGE.jpg", "https://cdn.instructables.com/FZN/40W1/JTEN99EG/FZN40W1JTEN99EG.LARGE.jpg", "https://cdn.instructables.com/FHR/P8MJ/JTEN99F9/FHRP8MJJTEN99F9.LARGE.jpg", "https://cdn.instructables.com/FMU/1FGZ/JTEN99N4/FMU1FGZJTEN99N4.LARGE.jpg"], "step_title": "Step 2: Cutting the Wood"}, {"step": 3, "steps_text": "Place the bottom of the box down and put the two side pieces next to it making sure to leave enough space on the ends for the two end pieces then screw them into place. Then place the two end pieces in the space between the two side pieces and screw them into place. Make sure to add a screw that goes into the end pieces from the side after attaching them.", "step_imgs": ["https://cdn.instructables.com/FGB/SUL5/JTEN99DP/FGBSUL5JTEN99DP.LARGE.jpg", "https://cdn.instructables.com/FQU/00KO/JTEN99C1/FQU00KOJTEN99C1.LARGE.jpg", "https://cdn.instructables.com/FPR/XIZL/JTEN99N7/FPRXIZLJTEN99N7.LARGE.jpg"], "step_title": "Step 3: Assembling the Box"}, {"step": 4, "steps_text": "Take the hinges and place them about 1 1/2 inches from the edge of the box. Make sure to align the middle hinges between the two pieces of wood then screw them into place.", "step_imgs": ["https://cdn.instructables.com/FRJ/SWXU/JTEN99EK/FRJSWXUJTEN99EK.LARGE.jpg", "https://cdn.instructables.com/FM1/FWKZ/JTEN99BV/FM1FWKZJTEN99BV.LARGE.jpg"], "step_title": "Step 4: Connecting the Lid"}, {"step": 5, "steps_text": "Align the two pieces of the latch with the center of the side of the box that does not have the hinges then screw into place.", "step_imgs": ["https://cdn.instructables.com/FNQ/PHY2/JTEN99CB/FNQPHY2JTEN99CB.LARGE.jpg"], "step_title": "Step 5: Attaching the Latch"}, {"step": 6, "steps_text": "Now that the box is complete you can customize it to fit your taste. You could add some felt lining, a foam insert with cutouts to hold your dice, or you could use it to store miniatures along with your dice.", "step_imgs": ["https://cdn.instructables.com/F9U/3EOD/JTEN9DE9/F9U3EODJTEN9DE9.LARGE.jpg", "https://cdn.instructables.com/FBO/SKSD/JTEN99J7/FBOSKSDJTEN99J7.LARGE.jpg", "https://cdn.instructables.com/FRJ/SWXU/JTEN99EK/FRJSWXUJTEN99EK.LARGE.jpg", "https://cdn.instructables.com/FPR/XIZL/JTEN99N7/FPRXIZLJTEN99N7.LARGE.jpg"], "step_title": "Step 6: Finished Product"}], "channel": "Table-top"}, {"category": "Play", "description": "This is a fun and simple project to make. It consists of 12 pieces that are all the same size. The pieces are glued together to make 3 assemblies. Getting it apart or putting it together is the challenge. As always, there is a trick.\nFor those that want to get straight to chase - see the solution video here.\nNote that I'm not the originator of the design. If you are not up to building it, similar versions can be purchased online.", "title": "Hexagon Puzzle", "url": "https://www.instructables.com/id/Hexagon-Puzzle/", "steps": [{"step": 1, "steps_text": "Tools:\nTable Saw\nMiter Saw\nWood Clamps\nTape Measure\nPencil\nMaterial:\n1x4 by 12\" Long\nWood Glue", "step_imgs": [], "step_title": "Step 1: Tools/Materials"}, {"step": 2, "steps_text": "The puzzle size is arbitrary. After viewing the solution, you will see that something that fits in your hand is ideal. However, feel free to scale this up or down based on your preference.", "step_imgs": ["https://cdn.instructables.com/F3S/JE9J/JTCSGBLO/F3SJE9JJTCSGBLO.LARGE.jpg", "https://cdn.instructables.com/FUH/FX4A/JTCSGBMD/FUHFX4AJTCSGBMD.LARGE.jpg"], "step_title": "Step 2: Top Level Drawing"}, {"step": 3, "steps_text": "This is the only part drawing with dimensions. The thickness doesn't really matter. I used the standard thickness from the 1x4 (.75\"). The chosen width will drive the length of the block. I picked 1\" since the geometry worked out to a roughly 4.5\" wide puzzle. With this, the overall length of the block turned out to be 2.887\". Note that the cut length (2.31\") is twice the hypotenuse (1.155\") of the triangle. Keep this in mind if scaling up or down.\nYou will need to cut 12 of these pieces.", "step_imgs": ["https://cdn.instructables.com/F9C/OOOC/JTCSGBN0/F9COOOCJTCSGBN0.LARGE.jpg"], "step_title": "Step 3: Part Drawing"}, {"step": 4, "steps_text": "I used a scrap piece of pine 1x4 and cut it into 1\" strips. Note that this piece was 24\" long so I had enough to build 2 puzzles.", "step_imgs": ["https://cdn.instructables.com/FOH/73O8/JTCSG0LB/FOH73O8JTCSG0LB.LARGE.jpg", "https://cdn.instructables.com/F5D/Z80K/JTCSG0LC/F5DZ80KJTCSG0LC.LARGE.jpg"], "step_title": "Step 4: Strips"}, {"step": 5, "steps_text": "I used a miter saw to cut the 30 degree angle. The stop block allowed me to cut all the pieces in a few minutes.", "step_imgs": ["https://cdn.instructables.com/F3R/OLNQ/JTCSG0LE/F3ROLNQJTCSG0LE.LARGE.jpg", "https://cdn.instructables.com/FEO/625U/JTCSG0LF/FEO625UJTCSG0LF.LARGE.jpg"], "step_title": "Step 5: 30 Degree Cuts"}, {"step": 6, "steps_text": "Four pieces are required for each assembly. I found it easier to make subassemblies first. Glue the pieces together as shown. Due to the geometry, this was tricky to get the clamping pressure. I finally found a use for the clamp I won in a previous instructables contest :). Another option is to use a small amount of superglue along with wood glue (separated) and hold the pieces together by hand for 30 seconds.\nMake six of these.", "step_imgs": ["https://cdn.instructables.com/F56/YD56/JTCSGBN1/F56YD56JTCSGBN1.LARGE.jpg", "https://cdn.instructables.com/FYB/9G07/JTCSG0LG/FYB9G07JTCSG0LG.LARGE.jpg"], "step_title": "Step 6: Gluing Parts - Step 1"}, {"step": 7, "steps_text": "Glue two of the subassemblies together as shown. This was obviously much easier.\nMake 3 of these.", "step_imgs": ["https://cdn.instructables.com/FEF/NUOI/JTCSGBN2/FEFNUOIJTCSGBN2.LARGE.jpg", "https://cdn.instructables.com/FDC/50PX/JTCSG0LI/FDC50PXJTCSG0LI.LARGE.jpg", "https://cdn.instructables.com/F5J/I1Z7/JTCSGBN3/F5JI1Z7JTCSGBN3.LARGE.jpg", "https://cdn.instructables.com/F05/0VOI/JTCSG0LJ/F050VOIJTCSG0LJ.LARGE.jpg"], "step_title": "Step 7: Gluing Parts - Step 2"}, {"step": 8, "steps_text": "Do a fit check of your puzzle (refer to video in the intro). If it binds, sand the surfaces as shown. I had to hand sand each surface for about 30 seconds.", "step_imgs": ["https://cdn.instructables.com/FQR/IFTW/JTCSGBN4/FQRIFTWJTCSGBN4.LARGE.jpg"], "step_title": "Step 8: Fit Check"}, {"step": 9, "steps_text": "Refer to video :)", "step_imgs": ["https://cdn.instructables.com/FC3/I7KH/JTCSG0LK/FC3I7KHJTCSG0LK.LARGE.jpg"], "step_title": "Step 9: Ready to Assemble"}, {"step": 10, "steps_text": "Hopefully, these help if you can't figure out the drawings.", "step_imgs": ["https://cdn.instructables.com/FKQ/B9TO/JTCSG0LW/FKQB9TOJTCSG0LW.LARGE.jpg", "https://cdn.instructables.com/FNK/Z0MP/JTCSG0LR/FNKZ0MPJTCSG0LR.LARGE.jpg", "https://cdn.instructables.com/FF2/NJOD/JTCSG0LP/FF2NJODJTCSG0LP.LARGE.jpg", "https://cdn.instructables.com/FKX/TM0G/JTCSG0LM/FKXTM0GJTCSG0LM.LARGE.jpg"], "step_title": "Step 10: Pictures"}, {"step": 11, "steps_text": "", "step_imgs": ["https://cdn.instructables.com/FZB/3U8Y/JTCSG0M1/FZB3U8YJTCSG0M1.LARGE.jpg", "https://cdn.instructables.com/FVC/YLGP/JTCSG0MC/FVCYLGPJTCSG0MC.LARGE.jpg", "https://cdn.instructables.com/FTP/R3RU/JTCSG0MK/FTPR3RUJTCSG0MK.LARGE.jpg", "https://cdn.instructables.com/FQ7/O5H2/JTCSG0MJ/FQ7O5H2JTCSG0MJ.LARGE.jpg"], "step_title": "Step 11: More Pictures"}, {"step": 12, "steps_text": "I include STP & STL files for those interested in 3D Printing. Note that you might need to do some post sanding to get a workable puzzle.", "step_imgs": [], "step_title": "Step 12: CAD Files"}, {"step": 13, "steps_text": "I'm happy with how it turned out. The cost was minimal - less than a $1. Besides waiting for the glue to dry, it took me about an hour to make the puzzle. I feel I could have done a little better with the gaps but being patient was never my strong suit :).\nAs always, thanks for viewing!", "step_imgs": ["https://cdn.instructables.com/FM6/Y3DJ/JTCSG0MM/FM6Y3DJJTCSG0MM.LARGE.jpg", "https://cdn.instructables.com/FQ7/1XXF/JTCSG0MU/FQ71XXFJTCSG0MU.LARGE.jpg"], "step_title": "Step 13: Final Thoughts"}], "channel": "Puzzles"}, {"category": "Play", "description": "My mum puzzles a lot. Most puzzles she does are 1000 pieces and a lot of work but not very hard to do. There is a system in laying these puzzles. You start with the corners and the edges, then sort the colors and divide the puzzles in parts, like the sky, the bricks, the grass etc.\nSo to make an impossible puzzle, I wanted to mess with all these ideas.\nFirst I make it only a couple of pieces.\nThere will be no image.\nAnd those corners...\nYou will need\nLasercutter\nAcrylic\nGlue", "title": "How to Design an Impossible Puzzle", "url": "https://www.instructables.com/id/How-to-Design-an-Impossible-Puzzle/", "steps": [{"step": 1, "steps_text": "I design in Gravit Designer, but AI, Corel or Inkscape will work as well.\nFor this project I took my drawing tablet from under the dust, but a mouse or trackpad will work fine.\nLook at the pictures for the instructions.\nSet the grid at the average size you want your puzzle pieces to guide you.\nThe first step is the outer border of the puzzle. This is also the first trick. I've made the 'square' nog fully square, and it is also not exactly straight, so the puzzle will only fit in one way.\nFinally I slightly curved two edges to make it even harder to fit the puzzle in.", "step_imgs": ["https://cdn.instructables.com/F96/38D8/JTCRI5RU/F9638D8JTCRI5RU.LARGE.jpg", "https://cdn.instructables.com/F9T/IA1Z/JTCRI5K7/F9TIA1ZJTCRI5K7.LARGE.jpg", "https://cdn.instructables.com/FAF/X78F/JTCRI5LO/FAFX78FJTCRI5LO.LARGE.jpg"], "step_title": "Step 1: Design the Monster"}, {"step": 2, "steps_text": "I design the puzzle first in black for easy designing and only change it to thin red lines for the laser when I am finished.\nAn experienced puzzler will start with the corners, so I will add a fifth corner somewhere in the middle of the puzzle.\nThe next pieces that a puzzler will go for are the edge pieces, so I make sure dat some of the edge pieces look like they belong in the middle.\nTo make it even harder I will also copy some sides of pieces so they will fit to the wrong pieces as well as the right piece.", "step_imgs": ["https://cdn.instructables.com/FHK/FOUA/JTCRI5OI/FHKFOUAJTCRI5OI.LARGE.jpg", "https://cdn.instructables.com/F10/SQUJ/JTCRI5S4/F10SQUJJTCRI5S4.LARGE.jpg", "https://cdn.instructables.com/FL8/I4NP/JTCRI5TO/FL8I4NPJTCRI5TO.LARGE.jpg", "https://cdn.instructables.com/FMG/MEXK/JTCRI5V8/FMGMEXKJTCRI5V8.LARGE.jpg"], "step_title": "Step 2: Corners and Edges"}, {"step": 3, "steps_text": "When the whole puzzle is designed, I change the lines in the red thin cutting lines for the laser.\nZoom in to see the details.\nMake the teeth of the pieces smooth. (don't change the copied pieces or they won't fit to each other anymore)\nMake sure that all lines connect.\nI also added tekst that didn't line up, to make it even harder to solve the puzzle.\nBecause to me the fun is in the designing, I didn't include the designs this time, to challenge you to design your own.", "step_imgs": ["https://cdn.instructables.com/F3I/BZC7/JTCRI5WJ/F3IBZC7JTCRI5WJ.LARGE.jpg", "https://cdn.instructables.com/F86/ZWW8/JTCRI5WL/F86ZWW8JTCRI5WL.LARGE.jpg", "https://cdn.instructables.com/FW3/9LUR/JTCRI5XA/FW39LURJTCRI5XA.LARGE.jpg"], "step_title": "Step 3: Clean It Up"}, {"step": 4, "steps_text": "Before going to the laser, I taped both sides of the acrylic to get a clean cut.\nTo retrieve all the small pieces easily from the laser cutter, I put some packing tape on top, so the pieces can't fall in the crumble tray.\nAlso cut from an other color of acrylic, just the outer dimensions for the under layer of the puzzle.", "step_imgs": ["https://cdn.instructables.com/FL9/5AHE/JTCRI5XC/FL95AHEJTCRI5XC.LARGE.jpg", "https://cdn.instructables.com/FAB/5FL3/JTCRI5XD/FAB5FL3JTCRI5XD.LARGE.jpg", "https://cdn.instructables.com/FZL/IFIL/JTCRI5XE/FZLIFILJTCRI5XE.LARGE.jpg", "https://cdn.instructables.com/F8U/R9SX/JTCRI5XH/F8UR9SXJTCRI5XH.LARGE.jpg", "https://cdn.instructables.com/FIL/RIVP/JTCRI4XU/FILRIVPJTCRI4XU.LARGE.jpg", "https://cdn.instructables.com/FFT/9WXM/JTCRI50U/FFT9WXMJTCRI50U.LARGE.jpg", "https://cdn.instructables.com/FV8/WP68/JTCRI56C/FV8WP68JTCRI56C.LARGE.jpg"], "step_title": "Step 4: Laser"}, {"step": 5, "steps_text": "By far the most work is the removal of the tape. (if someone has a really good method for it, please let me know)\nGlue the outer border on the under layer. Make sure to have both pieces the right way, because the square isn't square, remember?!\nPut something heavy on top to let it dry.", "step_imgs": ["https://cdn.instructables.com/FIY/1F86/JTCRI54V/FIY1F86JTCRI54V.LARGE.jpg", "https://cdn.instructables.com/FGI/60Z4/JTCRI5Y6/FGI60Z4JTCRI5Y6.LARGE.jpg", "https://cdn.instructables.com/F5R/HXNX/JTCRI5Y7/F5RHXNXJTCRI5Y7.LARGE.jpg", "https://cdn.instructables.com/FUU/KKMA/JTCRI5Y8/FUUKKMAJTCRI5Y8.LARGE.jpg"], "step_title": "Step 5: Remove the Tape"}, {"step": 6, "steps_text": "I've also made a box for it and wanted to show it to you, just to show off.", "step_imgs": ["https://cdn.instructables.com/F6T/B1A5/JTCRI5YA/F6TB1A5JTCRI5YA.LARGE.jpg", "https://cdn.instructables.com/F5Z/SDKP/JTCRI5YB/F5ZSDKPJTCRI5YB.LARGE.jpg"], "step_title": "Step 6: Make a Box"}, {"step": 7, "steps_text": "It took some very bright kids 10 minutes to finish the easy, 26 piece puzzle. It took my mum more than half an hour.\nWe haven't tried the 29 pieces hard one yet, but we will be soon.\nI've found out that I am not the first one to design a puzzle like this so if you want to buy one and you are not from the Netherlands you must be able to find it somewhere.", "step_imgs": ["https://cdn.instructables.com/F8C/T4DX/JTCRI5D7/F8CT4DXJTCRI5D7.LARGE.jpg", "https://cdn.instructables.com/FWX/3ZDF/JTCRI5EP/FWX3ZDFJTCRI5EP.LARGE.jpg", "https://cdn.instructables.com/F82/LDD4/JTCRI5HG/F82LDD4JTCRI5HG.LARGE.jpg"], "step_title": "Step 7: Start Puzzling"}], "channel": "Puzzles"}, {"category": "Play", "description": "Long before rubber bands were invented, clever engineers powered their war machines with bundles of twisted rope, known as torsion bundles. One of the most iconic uses of this engineering technique is manifested in the ballista, which employed twin torsion bundles to power a pair of throwing arms that hurl bolts.\nThe key to a successful pocket-sized ballista is to create durable torsion bundles that can be tightly wound-up without breaking. Cotton string is too thick and frays too easily at such a tiny scale, so you’ll be using a clever alternative… dental floss!\nThis Instructable is a full excerpt from my book, Launchers, Lobbers and Rockets Engineer. Enjoy!", "title": "Pocket-Sized Ballista", "url": "https://www.instructables.com/id/Pocket-Sized-Ballista/", "steps": [{"step": 1, "steps_text": "regular 4.5x0.5\" (11.4x1.3cm) craft sticks\nHot glue\nPliers\nDrill with 1/8\" and 1/16\" bits (30mm and 15mm)\nWaxed dental floss *\n1/8\" (30mm) bamboo skewers **\nsmall paper clips\nutility knife\nsmall ¾\" (1.9cm) binder clip\nmasking tape\nscissors\n* It's critical to use waxed dental floss. Floss has extremely high tensile strength, which means that it can hold many pounds of force before breaking. The waxy coating is also important because it makes it much easier to thread into the tiny holes, and it protects the floss from fraying.\n**Bamboo skewers can't be substituted with wood dowels or similar materials. The fibrous structure of the bamboo is resistant to being crushed or snapped, which makes it ideal for holding up against the crushing forces of the torsion bundles. It's also very thin yet inexpensive!", "step_imgs": ["https://cdn.instructables.com/FAT/U9YU/JT91M85M/FATU9YUJT91M85M.LARGE.jpg"], "step_title": "Step 1: Gather Materials"}, {"step": 2, "steps_text": "Hot glue the edges of two pairs of craft sticks together as shown (picture 1).\nOverlap the glued pairs of sticks by about 2\" (5cm). The bottom pair of sticks will be the front end of the ballista (picture 2).\nGlue a single stick onto the underside of the front of the frame (picture 3).", "step_imgs": ["https://cdn.instructables.com/FKV/QV21/JT91N38I/FKVQV21JT91N38I.LARGE.jpg", "https://cdn.instructables.com/FE3/PHSZ/JT91N3AG/FE3PHSZJT91N3AG.LARGE.jpg", "https://cdn.instructables.com/FMI/KNQL/JT91N3C5/FMIKNQLJT91N3C5.LARGE.jpg"], "step_title": "Step 2: Build the Frame"}, {"step": 3, "steps_text": "Use a pair of pliers to grip and snap off sixteen pieces of craft sticks that are about 3/8\" (1cm) square (pictures 1 and 2).\nGlue the square pieces of sticks in stacks of 4 as shown, then glue another stick on top (pictures 3 and 4).\nIf you have a more convenient material than bits of craft sticks, like corks or wooden cubes, you can use that instead.", "step_imgs": ["https://cdn.instructables.com/FMW/I8QL/JT91N3DV/FMWI8QLJT91N3DV.LARGE.jpg", "https://cdn.instructables.com/FU0/L5BG/JT91N3HD/FU0L5BGJT91N3HD.LARGE.jpg", "https://cdn.instructables.com/FT8/6NOV/JT91N3J3/FT86NOVJT91N3J3.LARGE.jpg", "https://cdn.instructables.com/FXV/OTQG/JT91N3KS/FXVOTQGJT91N3KS.LARGE.jpg"], "step_title": "Step 3: Create the Front of the Frame"}, {"step": 4, "steps_text": "First drill two 1/8\" (3.2mm) holes, and four 1/16\" (1.6mm) as shown*. Make sure to space all the holes about ¼\" (6.4mm) apart (picture 1).\nCut and straighten a paperclip into two 1.25 (3.2cm) pieces, and cut one of the bamboo skewers into four 1\" (2.5cm) and two 3.5\" (8.9cm) pieces (picture 2). The paperclips will be pegs that hold the bundles in place, the short bamboo pieces will be the winding pegs, and the long bamboo pieces will be the throwing arms.\n*Pro tip - Here's how to drill holes in craft sticks without splitting the wood:\nPut the ballista on top of a disposable piece of wood.\nGet the drill in position, and rev it up to the highest speed.\nSlowly rest the weight of the drill onto the craft stick. Once the hole starts forming, don't increase the weight, but keep the drill spinning as fast as possible. If you drill into the stick too fast, the wood might split.\nThe wood is already unlikely to split because it's strengthened by the stacks of stick pieces from the previous step. If it does break, no big deal! Cut off the broken stick with a pair of wire cutters, and glue on a new one.", "step_imgs": ["https://cdn.instructables.com/FO5/LQRA/JT91N3MK/FO5LQRAJT91N3MK.LARGE.jpg", "https://cdn.instructables.com/FYF/467S/JT91N3RO/FYF467SJT91N3RO.LARGE.jpg"], "step_title": "Step 4: Prepare the Torsion Mechanism"}, {"step": 5, "steps_text": "Cut a scrap of cardboard or other material to about 1\" (2.5cm) wide (picture 1). Wrap the waxed dental floss around it ≈10 times. Repeat, and tie the ends together to create two loops (picture 2).\nCreating a thick bundle of floss makes the torsion bundle more durable, which in turn, allows you to wind it up more and generate more power.\nThis is where the waxy floss begins to show its value! Any other material - like sewing thread - would be very difficult to work with.\nPinch the waxed loop of floss together on one end, and insert it into the 1/8\" (3.2mm) holes (picture 3). Once through, separate the strands again (picture 4).", "step_imgs": ["https://cdn.instructables.com/FYU/8GRE/JT91N3OA/FYU8GREJT91N3OA.LARGE.jpg", "https://cdn.instructables.com/FMM/6FWT/JT91N3PZ/FMM6FWTJT91N3PZ.LARGE.jpg", "https://cdn.instructables.com/FEX/LYPG/JT91N3TE/FEXLYPGJT91N3TE.LARGE.jpg", "https://cdn.instructables.com/F4U/MIN6/JT91N3V3/F4UMIN6JT91N3V3.LARGE.jpg"], "step_title": "Step 5: Create the Torsion Bundles"}, {"step": 6, "steps_text": "Insert the 3.5\" (8.9cm) and two of the 1\" (2.5cm) pieces of skewers in between the strands of floss as shown (picture 1). Again, the 3.5\" skewer is the throwing arm, and the 1\" skewers are now the pegs that will wind up the torsion spring.\nRotate the 1\" (2.5cm) winding pegs to make the 3.5\" (8.9cm) throwing arm press into the front of the ballista (picture 2). In this picture, the pegs are wound counterclockwise. When the throwing arm is pressed firmly against the frame, insert one of the paperclip pieces into the appropriate hole to prevent it from unwinding.\nFor now, don’t wind it up too much – you’ll increase the tension later.\nRepeat with the second arm (picture 3).", "step_imgs": ["https://cdn.instructables.com/F8H/1Y1A/JT91N3Y5/F8H1Y1AJT91N3Y5.LARGE.jpg", "https://cdn.instructables.com/FAV/HV5U/JT91N3ZV/FAVHV5UJT91N3ZV.LARGE.jpg", "https://cdn.instructables.com/FTE/EF8I/JT91N41M/FTEEF8IJT91N41M.LARGE.jpg"], "step_title": "Step 6: Install the Throwing Arms"}, {"step": 7, "steps_text": "Carefully split the tip of each throwing arm with the utility knife (picture 1).\nSlip a 11\" (28cm) piece of floss into the split, with about 1.5\" (3.8cm) of hanging out one side (picture 2).\nWrap the short end of the floss tightly around the tip of the throwing arm to hold it in place. Importantly, this also prevents the throwing arm from splitting further (picture 3).\nRepeat on the other side, and cut off the excess floss. Apply a dab of hot glue onto the wrapped floss to prevent it from unwinding (picture 4).", "step_imgs": ["https://cdn.instructables.com/FKZ/IKH9/JT91N43C/FKZIKH9JT91N43C.LARGE.jpg", "https://cdn.instructables.com/FI5/HS1D/JT91N45E/FI5HS1DJT91N45E.LARGE.jpg", "https://cdn.instructables.com/F2J/WRJZ/JT91N4B3/F2JWRJZJT91N4B3.LARGE.jpg", "https://cdn.instructables.com/FJJ/NSCG/JT91N4GF/FJJNSCGJT91N4GF.LARGE.jpg"], "step_title": "Step 7: String the Ballista"}, {"step": 8, "steps_text": "Finish the ballista by hot gluing a binder clip onto the back of the frame (picture 1).\nTo create a bipod, cut a craft stick in half at about a 45° angle, and glue the pieces to the front of the ballista as shown. Make sure the ends of the pieces do not protrude in front of the center gap.\nNote: You can choose to forgo the bipod to make the ballista even more pocket-friendly :)\nThe ballista is complete! Now time to make the bolts.", "step_imgs": ["https://cdn.instructables.com/FLQ/86KR/JT91N4I4/FLQ86KRJT91N4I4.LARGE.jpg"], "step_title": "Step 8: Create the Trigger and Bipod"}, {"step": 9, "steps_text": "Cut another skewer to 7\" (17.8cm), then carefully fold a 1\" (2.5cm) piece of tape over the blunt end of the skewer, leaving about ¼\" (6.4mm) exposed at the very end (picture 1).\nTrim the fins into a tapered shape that protrudes no more than ¼\" (6.4mm) from the skewer (picture 2). The fins must be able to easily fit through the front gap of the ballista frame.\nStraighten a whole small paperclip, and then wrap it tightly around the tip of the skewer (picture 3 and 4). This creates a leading weight*\nUsing the tip of the utility knife, carefully carve out a small nock at the back of the skewer. Make sure the gap in the nock is aligned with the fins as shown (picture 5).\n*Adding weight to the tip of the bolt is crucial. Why? Imagine trying to throw a long strip of paper. It won’t go very far and it definitely won’t go straight. Now imagine attaching a rock to one end of the paper and throwing it again. The momentum of the rock will carry the paper through the air and the paper will trail behind it in a straight line. This same idea applies to long projectiles — like a bolt. It needs weight at the tip to generate momentum that'll carry it far and straight.", "step_imgs": ["https://cdn.instructables.com/F87/DBLS/JT91N4JT/F87DBLSJT91N4JT.LARGE.jpg", "https://cdn.instructables.com/FQK/CFHZ/JT91N4LI/FQKCFHZJT91N4LI.LARGE.jpg", "https://cdn.instructables.com/F6Z/M7YX/JT91N4NL/F6ZM7YXJT91N4NL.LARGE.jpg", "https://cdn.instructables.com/FMQ/AJ2R/JT91N4PC/FMQAJ2RJT91N4PC.LARGE.jpg", "https://cdn.instructables.com/FTI/7T3X/JT91N4SO/FTI7T3XJT91N4SO.LARGE.jpg"], "step_title": "Step 9: Make the Bolts"}, {"step": 10, "steps_text": "Add more tension (not pictured). Remove the paperclips that are stopping the winding pegs. Rotate the winding pegs evenly to slowly increase the tension. The bundled dental floss is extremely strong, so don’t be afraid to really crank it up (the winding pegs will break before the floss does!) Make sure to rotate the top and bottom winding pegs evenly, and that the tension is even for both throwing arms. If one arm is more powerful than the other, your shot won’t be accurate. You may need to make small adjustments to the amount of tension in each torsion bundle to make them even.\nLoad and fire! Insert the bolt through the front of the ballista, and position the nock onto the string. With your other hand, hold the back of the bolt in place. This frees your first hand to switch positions (picture 1).\nPinch the bolt near the fins, and open the trigger (picture 2). Avoid having your hands (or anything else!) in front of the ballista as you're loading it in case of a misfire.\nPush the bolt into the trigger (picture 3).\nCenter the bolt, aim, and simply press the trigger to fire (picture 4).", "step_imgs": ["https://cdn.instructables.com/F44/W9CL/JT91N4T3/F44W9CLJT91N4T3.LARGE.jpg", "https://cdn.instructables.com/F0O/43X0/JT91N4T8/F0O43X0JT91N4T8.LARGE.jpg", "https://cdn.instructables.com/FD2/D406/JT91N4T0/FD2D406JT91N4T0.LARGE.jpg", "https://cdn.instructables.com/FE2/4BOA/JT91N351/FE24BOAJT91N351.LARGE.jpg"], "step_title": "Step 10: Add Tension, Load, and Fire!"}, {"step": 11, "steps_text": "When you're not waging pocket-sized warfare, take out the tension from the torsion bundles by unwinding the pegs one full rotation. You don't need to completely undo the torsion bundle.\nDecreasing the tension will improve the longevity of your ballista.\nThanks for reading this far! If you build your own mini siege machine, share a picture in the comments!", "step_imgs": [], "step_title": "Step 11: Long Live Your Ballista"}], "channel": "Siege Engines"}]