[{"category": "Workshop", "description": "Hi there! Here is a bowl made with a bandsaw (using no lathe).\nI use left over pine wood from another project. But any wider wood board would work.\nI have a small bandsaw with a thin blade (but a scrollsaw would work even better).\nThis is the first time I make this design, and I think it turned out pretty decent. If you want there is a short video covering this build too.\nPlease let me know if you have any questions, and I will try to answer. Also consider following me here for more projects like this in the future!\nFor this build I used\n- pine board (any kind of wider solid board will work)\n- bandsaw(or scrollsaw even)\n- wood glue\n- pen\n- compass (woodworking divider?)\n- ruler\n- square\n- some clamps\n- palm sander\n- sandingpaper\n- steelwool (optional)\n- disc sander (optional)\n- spray lacquer (optional)\nThe project is pretty easy and fun to make. The time to make this is a couple of hours over a couple of days. The glue needs to set over night and it is up to you how much you need/want to sand it.\nThis is a perfect project to make if you have the urge to make a bowl, but have no lathe! :-)", "title": "Bandsaw Bowl", "url": "https://www.instructables.com/id/Bandsaw-Bowl/", "steps": [{"step": 1, "steps_text": "I find the center of the board by using a ruler from coner to corner - making an \"X\". The center of the board is where the lines meet (this is true if the sides are all straight). You can check that with a square first.\nThen I use a compass and make the largest possible circle on the board.", "step_imgs": ["https://cdn.instructables.com/FPX/B0OR/JF34GW53/FPXB0ORJF34GW53.LARGE.jpg", "https://cdn.instructables.com/FKV/YFT7/JF34GW4G/FKVYFT7JF34GW4G.LARGE.jpg", "https://cdn.instructables.com/F42/D6BX/JF34GW4Q/F42D6BXJF34GW4Q.LARGE.jpg", "https://cdn.instructables.com/FT8/4USX/JF34GW6B/FT84USXJF34GW6B.LARGE.jpg"], "step_title": "Step 1: Finding the Center and Drawing the First Circle"}, {"step": 2, "steps_text": "After the base is traced I set the bandsaw table at an angle. More about the angle on the next step! :-)\nI cut around the circle, and I save one of the off cuts as a template piece. Also more on this in the next step.", "step_imgs": ["https://cdn.instructables.com/FAL/6O8D/JF34GW77/FAL6O8DJF34GW77.LARGE.jpg", "https://cdn.instructables.com/F2G/PZPZ/JF34GW79/F2GPZPZJF34GW79.LARGE.jpg"], "step_title": "Step 2: Cutting the Base and Setting the Angle"}, {"step": 3, "steps_text": "About the angle\nMany people ask me what angle I use. That is really up to you. I have seen many other great woodworkers/makers having all kinds of mathematical calculations (and yes - its not advanced either). But I believe in-place-meassurment is faster, accurate enough and less prone to scale on misstakes. :-)\nI used about 20 degrees in this bowl. But the choice is yours! :-)\nSet the table to anything you fancy. The rule to remember is - the steeper the angle (or less angle from the base for instance 5 degrees) the thinner the walls will be). The thicker piece of wood you will need from start.\nI used a small cut off piece and placed it behind the band saw blade after cutting the base plate. The template piece must be the same thickness as the bowl. Otherwise the angle will be wrong.\nI trace a line with a pen, copying the angle of the blade.\nYou can see that in the first picture.\nThen I use a square marking the sides from the line. From the top and the bottom of the line. This will give the thickness of the next rings. The base from the last ring will sit on top of the next ring. And you do not need any calculations. I use the template piece in the next step to mark the sizes of the other rings.\nI hope this step is clear, otherwise just let me know in the comments! :-)", "step_imgs": ["https://cdn.instructables.com/F2P/E1R0/JF34GW7C/F2PE1R0JF34GW7C.LARGE.jpg", "https://cdn.instructables.com/FP6/KTO2/JF34GW7G/FP6KTO2JF34GW7G.LARGE.jpg", "https://cdn.instructables.com/FX5/35CY/JF34GWAL/FX535CYJF34GWAL.LARGE.jpg", "https://cdn.instructables.com/FQ8/DTS1/JF34GWD1/FQ8DTS1JF34GWD1.LARGE.jpg"], "step_title": "Step 3: Getting the Thickness of the Other Rings"}, {"step": 4, "steps_text": "When I know how wide the rings/circles should be I can make as many rings I want for the size I want of the finished bowl. I use my compass and trace the circles.\nAs you can see in the picture I place the template piece, with the width and I make a mark. Then move it one ring closer to the center and make the next mark.", "step_imgs": ["https://cdn.instructables.com/FGX/AMN0/JF34GWEQ/FGXAMN0JF34GWEQ.LARGE.jpg", "https://cdn.instructables.com/FDL/G3EH/JF34GWES/FDLG3EHJF34GWES.LARGE.jpg", "https://cdn.instructables.com/FZW/060K/JF34GWEX/FZW060KJF34GWEX.LARGE.jpg", "https://cdn.instructables.com/FZM/0N5O/JF34GWEZ/FZM0N5OJF34GWEZ.LARGE.jpg", "https://cdn.instructables.com/FYQ/6CPD/JF34GWF1/FYQ6CPDJF34GWF1.LARGE.jpg", "https://cdn.instructables.com/FSP/7NL5/JF34GWFJ/FSP7NL5JF34GWFJ.LARGE.jpg", "https://cdn.instructables.com/FNY/P41H/JF34GWGV/FNYP41HJF34GWGV.LARGE.jpg", "https://cdn.instructables.com/FTX/QO8P/JF34GWHP/FTXQO8PJF34GWHP.LARGE.jpg"], "step_title": "Step 4: Drawing the Other Circles"}, {"step": 5, "steps_text": "I made some arrows reminding me of the grain direction.\nWhen you make the glue up, make sure to keep the orientation of the rings in the same grain direction. When the wood expands and contracts there will be less stress if the movement is in the same direction.", "step_imgs": ["https://cdn.instructables.com/FXE/Z3S0/JF34GWHS/FXEZ3S0JF34GWHS.LARGE.jpg"], "step_title": "Step 5: TIP: Grain Direction"}, {"step": 6, "steps_text": "I use the same angle at the bandsaw table.\nI try to make each entry cut in the same direction as the grain.\nTIP: When cutting at the bandsaw, you will get much cleaner cuts if you keep the work piece moving all the time. If you need to stop and turn or change grip, the blade will make a small ridge/cut. You can always sand afterwards but if you need the bandsaw cut to be as clean as possible - try to stop as seldom as possible.", "step_imgs": ["https://cdn.instructables.com/FXE/H4BO/JF34GWIQ/FXEH4BOJF34GWIQ.LARGE.jpg", "https://cdn.instructables.com/F2F/U1DF/JF34GWLY/F2FU1DFJF34GWLY.LARGE.jpg", "https://cdn.instructables.com/FRG/T8LI/JF34GWM4/FRGT8LIJF34GWM4.LARGE.jpg"], "step_title": "Step 6: Cutting the Rings/walls"}, {"step": 7, "steps_text": "First make a dry fit. Just to see that you have the angles right.\nI removed the burr from the bandsaw cutting with some light sanding.\nThe glue up is pretty straight forward. As you can see in the pictures I used a small clamp to close the ring while glueing the next ring. I try not to get the ring openings on the same spot. Twist each ring a little.\nTry to wipe the glue squeeze out from the inside as soon as possible. It will save you some time later.\nI let the glue set over night under preassure from my trusty anvil.", "step_imgs": ["https://cdn.instructables.com/FZK/KTII/JF34GWOM/FZKKTIIJF34GWOM.LARGE.jpg", "https://cdn.instructables.com/FW3/HCB5/JF34GWR3/FW3HCB5JF34GWR3.LARGE.jpg", "https://cdn.instructables.com/FV8/0LGP/JF34GWS0/FV80LGPJF34GWS0.LARGE.jpg", "https://cdn.instructables.com/F3O/A3Q5/JF34GWSY/F3OA3Q5JF34GWSY.LARGE.jpg", "https://cdn.instructables.com/F6L/26GV/JF34GWU4/F6L26GVJF34GWU4.LARGE.jpg", "https://cdn.instructables.com/FZG/QEFV/JF34GWWF/FZGQEFVJF34GWWF.LARGE.jpg", "https://cdn.instructables.com/FWS/JF81/JF34GWZ0/FWSJF81JF34GWZ0.LARGE.jpg"], "step_title": "Step 7: The Assembling (the Glue Up)"}, {"step": 8, "steps_text": "First I sanded the outside. I really recommend some kind of disc sander or mounted belt sander. It makes it so much easier. If you dont have a disc sander or belt sander - you can see my make shift sander (a drill clamped to my work table). I turn the bowl and grind down all the ridges.\nThe outside is easier than the inside. I used a small chisel to clear out the glue (that is right now my favorite tool at this moment). It is super sharp - and shiny!\nThen I sanded using a palm sander from grit 80 to 240. I hand sanded and finally used steel wool to make the surface smooth and nice to the touch.", "step_imgs": ["https://cdn.instructables.com/F3V/H7HK/JF34GX2C/F3VH7HKJF34GX2C.LARGE.jpg", "https://cdn.instructables.com/F4D/LWKI/JF34GWZQ/F4DLWKIJF34GWZQ.LARGE.jpg", "https://cdn.instructables.com/F5P/IVNX/JF34GX4N/F5PIVNXJF34GX4N.LARGE.jpg", "https://cdn.instructables.com/F9J/JLHP/JF34GX6K/F9JJLHPJF34GX6K.LARGE.jpg", "https://cdn.instructables.com/FIA/9L7N/JF34GX8C/FIA9L7NJF34GX8C.LARGE.jpg"], "step_title": "Step 8: Sanding"}, {"step": 9, "steps_text": "I buffed the sanded bowl with a scrubbing sponge (Is that really the correct word?) :-)\nI used spray lacquer and sanded ligthly with steel wool inbetween coats. I hade about 4 coats of lacquer.", "step_imgs": ["https://cdn.instructables.com/FMP/9149/JF34GXBS/FMP9149JF34GXBS.LARGE.jpg", "https://cdn.instructables.com/FDJ/JTC7/JF34GXEG/FDJJTC7JF34GXEG.LARGE.jpg", "https://cdn.instructables.com/FN9/VGA4/JF34GXH5/FN9VGA4JF34GXH5.LARGE.jpg"], "step_title": "Step 9: Finish With Spray Lacquer"}, {"step": 10, "steps_text": "Here is the finished result! If you like you can see a short video of this project too.\nThis was a fun project to make. If I make it again, I will have some more interesting type of wood or make my own lamination with different grain direction.\nThank you for reading this instructable - please leave a comment or follow me here - it would be much appreciated!", "step_imgs": ["https://cdn.instructables.com/FBS/BSUI/JF34GXJH/FBSBSUIJF34GXJH.LARGE.jpg", "https://cdn.instructables.com/FA0/RSMU/JF34GXME/FA0RSMUJF34GXME.LARGE.jpg"], "step_title": "Step 10: Action Shots! :-)"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "Can’t find pins when you need them?\nDo your sheets get damaged due to board pins and staple pins? Is making sure your paper is straight a pain? Do sheets keep slipping out of the board pins? If these things about your display board do bother you, ‘P(A)INLESS’ is your solution.\nWhat will you need?\nMaterials :\nOHP sheet (600 mm X 700mm)\nVinyl sheet (600 mm X 700 mm)\nPVC pipe (d = 25 mm , l = 600 mm) X 2\nCotton rope (d = 6 mm , l= 250 mm ) X 2\nNuts and bolts (d =5 mm ) X 6\nPrimer and white paint\nTurquoise or Yellow Dye\nTools :\nLaser cutter\nVinyl cutter\nTable Saw\nHand drill\n6 mm drill bit\n8 mm drill bit", "title": "P(A)INLESS BOARD", "url": "https://www.instructables.com/id/PAINLESS-BOARD/", "steps": [{"step": 1, "steps_text": "Cut the OHP sheet and the Vinyl sheet with a laser cutter and a vinyl cutter respectively. I have attached the .dxf files below.", "step_imgs": ["https://cdn.instructables.com/FNI/KTP5/JF34FVAE/FNIKTP5JF34FVAE.LARGE.jpg", "https://cdn.instructables.com/FJD/8I5Q/JF34FV4G/FJD8I5QJF34FV4G.LARGE.jpg", "https://cdn.instructables.com/FVU/AMCL/JF34FZT6/FVUAMCLJF34FZT6.LARGE.jpg", "https://cdn.instructables.com/FPU/ZT9D/JF34FZT7/FPUZT9DJF34FZT7.LARGE.jpg"], "step_title": "Step 1: Cutting"}, {"step": 2, "steps_text": "Clean the laser cutter marks from the OHP sheet using a cloth, water and some soap. Dry the OHP sheet with a clean cloth. Align the Vinyl sheet with the OHP sheet using the reference holes at the top and bottom. Then slowly peel and stick the Vinyl sheet onto the OHP sheet.", "step_imgs": ["https://cdn.instructables.com/FPU/JDSL/JF34FZTG/FPUJDSLJF34FZTG.LARGE.jpg", "https://cdn.instructables.com/FLU/7NKI/JF34FZTI/FLU7NKIJF34FZTI.LARGE.jpg", "https://cdn.instructables.com/F7J/0OE1/JF34G5IZ/F7J0OE1JF34G5IZ.LARGE.jpg", "https://cdn.instructables.com/FU0/IRLV/JF34FZTS/FU0IRLVJF34FZTS.LARGE.jpg", "https://cdn.instructables.com/F6K/OBZ3/JF34FZTF/F6KOBZ3JF34FZTF.LARGE.jpg"], "step_title": "Step 2: Cleaning and Sticking"}, {"step": 3, "steps_text": "Using the band saw cut a slit into the PVC pipes. Then clamp the pipes in a vice to flatten the central and the side parts of the pipe. Mark holes using the cut OHP sheet. Then using a drill and a 6 mm drill bit, drill holes at the marked places. Then turn the pipe around so the slit is at the bottom and mark holes at the two sides on top. Drill holes through the 2 marked holes using an 8 mm drill bit.", "step_imgs": ["https://cdn.instructables.com/FM4/8LIB/JF34FZWE/FM48LIBJF34FZWE.LARGE.jpg", "https://cdn.instructables.com/FYP/GU0U/JF34FZVK/FYPGU0UJF34FZVK.LARGE.jpg", "https://cdn.instructables.com/FA5/DIVM/JF34FZVD/FA5DIVMJF34FZVD.LARGE.jpg", "https://cdn.instructables.com/F9E/3ITL/JF34FZVH/F9E3ITLJF34FZVH.LARGE.jpg", "https://cdn.instructables.com/F9H/WBRS/JF34FZVU/F9HWBRSJF34FZVU.LARGE.jpg", "https://cdn.instructables.com/FDO/S7UU/JF34FZW4/FDOS7UUJF34FZW4.LARGE.jpg"], "step_title": "Step 3: Making the Mount"}, {"step": 4, "steps_text": "Spray the PVC pipes with primer and let them dry for 3 hours. Then spray the PVC pipes with white paint. Dye the thread in a container with either turquoise or yellow dye for about an hour. Remove the thread, wash and let it dry for about 3 hours.", "step_imgs": ["https://cdn.instructables.com/FE6/HZSE/JF34G1JQ/FE6HZSEJF34G1JQ.LARGE.jpg", "https://cdn.instructables.com/FO2/3LQY/JF34G1JZ/FO23LQYJF34G1JZ.LARGE.jpg", "https://cdn.instructables.com/FP4/KWDG/JF34G1JJ/FP4KWDGJF34G1JJ.LARGE.jpg"], "step_title": "Step 4: Add Some Colour"}, {"step": 5, "steps_text": "Align the holes of the OHP sheet with the holes on the PVC pipe by sliding it through the slit. Insert nuts into all three of the holes. Pass the thread through the hole on top and around the nut and out of the top hole again. Tie a knot on top to secure it Do the same on the other side. Secure the nuts with bolts. Align the other PVC pipe at the holes at the bottom of the OHP sheet by passing the OHP sheet through the slit. Secure it with nuts and bolts as well.", "step_imgs": ["https://cdn.instructables.com/FIZ/CBOW/JF34G03W/FIZCBOWJF34G03W.LARGE.jpg", "https://cdn.instructables.com/FMB/UA91/JF34G03V/FMBUA91JF34G03V.LARGE.jpg", "https://cdn.instructables.com/F65/T9KN/JF34FZXQ/F65T9KNJF34FZXQ.LARGE.jpg", "https://cdn.instructables.com/FLY/B8CQ/JF34FZXT/FLYB8CQJF34FZXT.LARGE.jpg", "https://cdn.instructables.com/FAG/T6SL/JF34FZXY/FAGT6SLJF34FZXY.LARGE.jpg", "https://cdn.instructables.com/FU0/WXJI/JF34FZXX/FU0WXJIJF34FZXX.LARGE.jpg"], "step_title": "Step 5: Step 4 : Assembly"}, {"step": 6, "steps_text": "Always start from the bottom right corner of the first unit in the grid. Align the top left corner of the sheet with the slit and slide the corner into the slit. Do this for all 4 corners. Your sheet is now secure!\nThis 'P(A)INLESS' board can accommodate A3, A4, A5, and A6 paper sizes in both the vertical and horizontal orientation. It can also be rolled up with the papers inside and carried around. The board can be tied to any two points using the threads at the two sides.\nWell, Its time to go P(A)INLESS!", "step_imgs": ["https://cdn.instructables.com/FX6/YCB5/JF34G0M1/FX6YCB5JF34G0M1.LARGE.jpg", "https://cdn.instructables.com/F4Q/5UUZ/JF34G0HC/F4Q5UUZJF34G0HC.LARGE.jpg", "https://cdn.instructables.com/F0Z/TJN4/JF34G0HN/F0ZTJN4JF34G0HN.LARGE.jpg", "https://cdn.instructables.com/FIS/UNZU/JF34G0HY/FISUNZUJF34G0HY.LARGE.jpg", "https://cdn.instructables.com/FC4/JEOE/JF34G0H1/FC4JEOEJF34G0H1.LARGE.jpg"], "step_title": "Step 6: How to Use It"}], "channel": "Organizing"}, {"category": "Workshop", "description": "In this Instructable I'll show you how I took a piece of wood destined to rot away or be burned and made an Epoxy Waterfall River Table out of it. It was my first time using epoxy and my first time welding, so I had a lot of fun with this one. Hope you enjoy the project!\nBe sure to watch the video above, and if you like it please subscribe to my YouTube channel!\nYou can also see a more detailed blog post where a detailed easy to follow plan is available at:\nhttp://fixthisbuildthat.com/diy-waterfall-epoxy-river-table/", "title": "Epoxy Waterfall River Table", "url": "https://www.instructables.com/id/Epoxy-Waterfall-River-Table/", "steps": [{"step": 1, "steps_text": "Tools Used\nRIDGID 12\" Miter Saw\nRIDGID 18V Circular Saw\nRIDGID 18V Grinder\nLincoln MP210 MIG Welder\nISOtunes Bluetooth Earbuds\nTablesaw\nMaterials/Supplies\nHardwood live edge slab\n1\" Square Tube Steel\nEpoxy Resin (much larger than I used)\nSealant Tape\nMetallic Pigments", "step_imgs": [], "step_title": "Step 1: Gather Materials and Tools"}, {"step": 2, "steps_text": "The heart of this project is this old nasty slab of wood. I saw it at a friend of the families and it was just sitting there literally rotting away. The guy had planned to do something with it but never have and was talking about just burning it. I told him I thought I could do something cool with it and got it from him. It took me a couple years to figure out what to do with it, but I finally figured it out! The slab had some nice curves to it. So to find the best cut line to split it in half, I used a string and centered it on each end of the slab.\nI clamped a straight edge to the live edge slab and split it down my cut line to form two halves.\nI surfaced the slabs with my jointer and planer to get them flat and ready for the next steps.\nThe slabs were too thick and long so I cut them to the size I needed on my miter saw.\nThe final prep steps were to fill any cracks in the slab edges with 5 minute epoxy and then sand and clean up the live edge for the epoxy pour.", "step_imgs": ["https://cdn.instructables.com/FBE/GJJY/JF342IHW/FBEGJJYJF342IHW.LARGE.jpg", "https://cdn.instructables.com/FEN/VIAX/JFCTBGC0/FENVIAXJFCTBGC0.LARGE.jpg", "https://cdn.instructables.com/FK4/ZMT6/JF342IHY/FK4ZMT6JF342IHY.LARGE.jpg", "https://cdn.instructables.com/F0Z/CSX3/JF342II6/F0ZCSX3JF342II6.LARGE.jpg", "https://cdn.instructables.com/FFH/PYZS/JF342II3/FFHPYZSJF342II3.LARGE.jpg", "https://cdn.instructables.com/FKW/QY03/JF342II0/FKWQY03JF342II0.LARGE.jpg"], "step_title": "Step 2: Split and Prep the Slab"}, {"step": 3, "steps_text": "I used ¾” MDF for the form but plywood or melamine can also be used here. To keep the resin from sticking to the form I covered the pieces in a special tape.\nI screwed the sides to the form base and then sealed the inside corners of the form with more tape. If I do it again I’ll probably use silicone in the corners as the taping took quite a while to get right.\nI put the slabs in the form, clamped the wood down and screwed it to the form from underneath. You could also just clamp them down if you don’t want holes in the underside.\nI also hot glued some small gaps at the end of the slabs to keep the epoxy out. The last thing I did to prep the form was to level it so the epoxy would flow out.", "step_imgs": ["https://cdn.instructables.com/F8O/3W9K/JF342IIF/F8O3W9KJF342IIF.LARGE.jpg", "https://cdn.instructables.com/FA3/O3ZO/JF342IIJ/FA3O3ZOJF342IIJ.LARGE.jpg", "https://cdn.instructables.com/FJ7/MU1T/JF342IIA/FJ7MU1TJF342IIA.LARGE.jpg", "https://cdn.instructables.com/F7D/TFSC/JF342IIQ/F7DTFSCJF342IIQ.LARGE.jpg", "https://cdn.instructables.com/FFH/T7QM/JF342IH1/FFHT7QMJF342IH1.LARGE.jpg"], "step_title": "Step 3: Build the Form"}, {"step": 4, "steps_text": "To get the amount of epoxy resin I needed I measured the gap between the slabs in 4 to 8” segments at a time and multiplied the average gap by the length of that segment. I added up all those numbers and multiplied by the height of the slab to get the total volume of the gap.\nI used an epoxy with a 2 to 1 resin to hardener mix. I used a two-color pour so I measured out 1.5L of the 2 to 1 mix in one container and 1L in the other.\nI added some metallic pigment to the epoxy resin and stirred each mix for several minutes.\nI poured the epoxy from both ends at the same time. I wouldn’t necessarily recommend this, but it worked for me. When the colors mixed together and it turned out amazing.", "step_imgs": ["https://cdn.instructables.com/FXX/I5AZ/JF342IH2/FXXI5AZJF342IH2.LARGE.jpg", "https://cdn.instructables.com/FIB/D19R/JF342IH4/FIBD19RJF342IH4.LARGE.jpg", "https://cdn.instructables.com/FCM/05UA/JF342IH5/FCM05UAJF342IH5.LARGE.jpg"], "step_title": "Step 4: Measure and Pour the Epoxy"}, {"step": 5, "steps_text": "I went with a simple metal base using 1” square tube.\nI tacked and welded it together in a C shape with an open end for a floating appearance.\nI ground down the welds on the base with my grinder and a flap disc. Then I drilled mounting holes in the base for the top, primed it, and sprayed on some matte black paint and matte clear coat.", "step_imgs": ["https://cdn.instructables.com/FS3/Y4IN/JF342IHD/FS3Y4INJF342IHD.LARGE.jpg", "https://cdn.instructables.com/F9N/Z3RF/JF342IHE/F9NZ3RFJF342IHE.LARGE.jpg", "https://cdn.instructables.com/FYQ/FGIZ/JF342IHF/FYQFGIZJF342IHF.LARGE.jpg", "https://cdn.instructables.com/FF4/H9EL/JF342IHG/FF4H9ELJF342IHG.LARGE.jpg"], "step_title": "Step 5: Build a Metal Base"}, {"step": 6, "steps_text": "After the 72 hour cure time was complete I unscrewed and removed the sides from the form then removed the slab from the form.\nI used my 13” planer to the level wood with the epoxy and remove excess from the bottom. You could also use a belt sander for this step on a larger piece.\nAfter the planing a few voids showed up and I filled them using 5 minute epoxy with some of the blue pigment added to blend it in. I squared up the slab on my table saw then started final prep on the slab.\nI sanded the wood up to 180 grit and took the epoxy up to 400 grit. I’d probably do this after the glue up next time though.", "step_imgs": ["https://cdn.instructables.com/FOD/SQ2R/JF342IH6/FODSQ2RJF342IH6.LARGE.jpg", "https://cdn.instructables.com/FX7/4YS9/JF342IH7/FX74YS9JF342IH7.LARGE.jpg", "https://cdn.instructables.com/F17/RE1N/JF342IH8/F17RE1NJF342IH8.LARGE.jpg", "https://cdn.instructables.com/FJ4/JQVI/JF342IH9/FJ4JQVIJF342IH9.LARGE.jpg", "https://cdn.instructables.com/FIX/TV7N/JF342IHA/FIXTV7NJF342IHA.LARGE.jpg", "https://cdn.instructables.com/FLM/TG7C/JF342IHB/FLMTG7CJF342IHB.LARGE.jpg", "https://cdn.instructables.com/FCR/R6O6/JF342IHC/FCRR6O6JF342IHC.LARGE.jpg"], "step_title": "Step 6: Clean Up the Top"}, {"step": 7, "steps_text": "I used my table saw and a crosscut sled and tilted the blade to 45 degrees for the initial bevel on the larger vertical piece.\nThen I flipped the smaller top piece over and back beveled it with a matching miter.\nI moved the blade back to 90 degrees and cut the larger piece to exact size for the base.\nTo glue up the miter I lined up the pieces with the miters facing down and put a piece of packing tape across the seam.\nI flipped the top over and used 5 minute epoxy for this connection and applied it liberally to one side of the joint then folded up the miter and clamped it together with right angle squares.", "step_imgs": ["https://cdn.instructables.com/FCG/WUCY/JF342IHH/FCGWUCYJF342IHH.LARGE.jpg", "https://cdn.instructables.com/FTX/O2ZH/JF342IHJ/FTXO2ZHJF342IHJ.LARGE.jpg", "https://cdn.instructables.com/FYM/1J3N/JF342IHK/FYM1J3NJF342IHK.LARGE.jpg", "https://cdn.instructables.com/F80/N37V/JF342IHL/F80N37VJF342IHL.LARGE.jpg", "https://cdn.instructables.com/FS3/VPGD/JF342IHM/FS3VPGDJF342IHM.LARGE.jpg"], "step_title": "Step 7: Make the Waterfall Edge"}, {"step": 8, "steps_text": "I applied a two part oil based finish to the slab and the cherry and epoxy really came to life.\nI buffed the oil off the surface and was ready for the base.\nI mounted the base upside down and shimmed the wood as necessary to fit the base. I left the top of the base open in the back so at no is the metal crossing under the epoxy and obscuring the light passing through.\nThis project really challenged me to try new things. It was fun to work with new materials like metal and epoxy resin and I’m looking forward to incorporating them into more projects in the future.\nBe sure to watch the video above, and if you like it please subscribe to my YouTube channel!\nYou can also see a more detailed blog post where a detailed easy to follow plan is available at:\nhttp://fixthisbuildthat.com/diy-waterfall-epoxy-river-table/", "step_imgs": ["https://cdn.instructables.com/FF2/QT66/JF342IHN/FF2QT66JF342IHN.LARGE.jpg", "https://cdn.instructables.com/FAQ/5FDM/JF342IHP/FAQ5FDMJF342IHP.LARGE.jpg", "https://cdn.instructables.com/F4L/SXFT/JF342IHQ/F4LSXFTJF342IHQ.LARGE.jpg"], "step_title": "Step 8: Finish and Assemble the Epoxy Resin River Table"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "If you have a damaged saw blade, don't throw it away, turn them into useful knifes! There are many ways to go about it, but in this Instructable, I will present how you can make a simple hook knife. A hook knife is a specialized knife for carving bowls or spoons. The process is very simple and can be done in home work shop with a handful of tools. The same process can be followed to create a general purpose carving knife, just don't hook the blade. You can find more Hacks and Builds from me on my YouTube channel and on Hacknbuild.com.\nDisclaimer: I am a hobbyist maker with no experience other than making a few saw blade and firewood knives for myself.\nMaterials Needed:\nDamaged circular saw blade\nA piece of hardwood firewood\nCopper pipe or conduit for the ferrule\nEpoxy\nMetalworking Tools:\nAngle Grinder\nMetal Files\nTubing cuter or hack saw (optional)\nForging Tools\nMap gas torch\nToaster oven or oven\nHammer\nWoodworking Tools:\nHatchet, machete or large knife like a cleaver\nDrill or drill press & drill bits\nMallet\nSharp chisels\nClamps\nSafety Gear:\nEye protection\nEar protection", "title": "Firewood and Saw Blade Knife", "url": "https://www.instructables.com/id/Firewood-and-Saw-Blade-Knife/", "steps": [{"step": 1, "steps_text": "Start by sketching out your knife on a sheet of paper.\nOnce you have a rough idea of what your knife will look like, you can determine the exact length of your blade.\nFor the hook knife, I modeled the length of the blade using a slip of paper. I made my hook knife into a longer hook shape, which due to the length isn't very suitable for carving spoons. A shorter shape would give you the angle you need to carve the shallow bowl of a spoon.\nI made the tang (the part that sits inside the handle) as long as the cutting depth of my twist drill would allow for.\nYou can create a 1:1 pattern in a vector drawing program. Inkscape is an open source vector graphics application and is excellent for this application. I am not that good at drawing this by hand, so Inkscape helps me to get the results I am looking for.", "step_imgs": ["https://cdn.instructables.com/FAX/M15M/JF34BLV9/FAXM15MJF34BLV9.LARGE.jpg", "https://cdn.instructables.com/FKX/QQE0/JF34D2HW/FKXQQE0JF34D2HW.LARGE.jpg", "https://cdn.instructables.com/FUZ/S0YN/JF34D2HY/FUZS0YNJF34D2HY.LARGE.jpg"], "step_title": "Step 1: Draw Your Knife"}, {"step": 2, "steps_text": "Now it is time to cut out the knife blanks. I prefer to use a paper pattern glued on with some spray adhesive, but there is no reason why the pattern cannot be traced or drawn freehand.\nApply Pattern\nCut out your pattern that you made in the previous step.\nApply spray ahesive\nStick it on the saw blade\nSetup Work\nI find it works best and is most comfortable for me to cut a waist level with my arms close to my body. Get some scraps of wood and put them on top of the table to set your work piece high enough so that the grinding wheel does not penetrate the surface of your table.\nCut Out Blade\nPut on you hearing and eye protection,\nCut out the blade.\nVideo link: Cutting the blade", "step_imgs": ["https://cdn.instructables.com/FOX/T3EQ/JF34B4IP/FOXT3EQJF34B4IP.LARGE.jpg", "https://cdn.instructables.com/F3L/49J8/JF34B6F1/F3L49J8JF34B6F1.LARGE.jpg", "https://cdn.instructables.com/FB1/YEJU/JF34B6K3/FB1YEJUJF34B6K3.LARGE.jpg"], "step_title": "Step 2: Cut Out the Blade"}, {"step": 3, "steps_text": "You have a couple different options for breaking down your log. I've found splitting the log by hand to be the simplest and easiest way.\nDivide the log up into sections. Take your hatchet, machete or splitting froe and lightly tap across each section with a mallet until you have a grid that represents how you want to divide up your stock. You'll want to leave some extra material so the rough part of the lumber can be cut away.\nContinue splitting. If you only split partially, it may be easier to keep the log standing up while you continue your work.\nSquare up your chunks. You can continue using your blade to rough-shape the stock to size. You can also use a chisel to take out material where needed.", "step_imgs": ["https://cdn.instructables.com/FWL/8IOJ/JF34BA7Q/FWL8IOJJF34BA7Q.LARGE.jpg", "https://cdn.instructables.com/F6Z/DYIG/JF34BA8F/F6ZDYIGJF34BA8F.LARGE.jpg", "https://cdn.instructables.com/FWM/KKS5/JF34BA99/FWMKKS5JF34BA99.LARGE.jpg", "https://cdn.instructables.com/FL6/KO7N/JF34BCFF/FL6KO7NJF34BCFF.LARGE.jpg"], "step_title": "Step 3: Break Down Your Log"}, {"step": 4, "steps_text": "Cut and Mark\nTake your square stock and cut it to length.\nMark an X on the end of the stock.\nUse a punch to mark where the hole will go.\nUse a small pair of dividers to scribe a circle on to the end of your stock that's the size of your ferrule. You could also simply trace around your ferrule.\nDrill Stock\nIn my design, the tang is tapered so I used a few bits for the hole: an initial pilot bit, a narrower bit then a wider bit. At minimum, you will need to drill a pilot hole then drill your final hole.", "step_imgs": ["https://cdn.instructables.com/FDW/6UHM/JF34BDM5/FDW6UHMJF34BDM5.LARGE.jpg", "https://cdn.instructables.com/FHV/YYVB/JF34D7UI/FHVYYVBJF34D7UI.LARGE.jpg", "https://cdn.instructables.com/F8P/M7OS/JF34DC8I/F8PM7OSJF34DC8I.LARGE.jpg", "https://cdn.instructables.com/F3B/KLXM/JF34D8L1/F3BKLXMJF34D8L1.LARGE.jpg", "https://cdn.instructables.com/FU7/YXGA/JF34D8KX/FU7YXGAJF34D8KX.LARGE.jpg"], "step_title": "Step 4: Cut and Drill the Handles"}, {"step": 5, "steps_text": "You're now ready to grind your bevel. I used a belt grinder for this, but you could also use an angle grinder with a grinding wheel or flap disc. The bevel is only ground on the outside of the knife, so make sure to put the bevel on the side of the knife you prefer. Note: I am left handed!\nI created a guide 20 degree guide block to get a consistent bevel but this step can also be done free hand. The knife was tabled to the guide block using some masking tape. I worked my way up from 120-600 grit belts.\nVideo Link: Grinding the bevel.", "step_imgs": ["https://cdn.instructables.com/FO1/CI4E/JF34BF1F/FO1CI4EJF34BF1F.LARGE.jpg"], "step_title": "Step 5: Grind the Bevel"}, {"step": 6, "steps_text": "If you've decided to make a hook knife rather than a carving or whittling knife you can start shaping the blade. This should be done hot, but you have a number of options on how to do it. You don't need a forge to do this per-set, but it helps to set some bricks around your torch to keep the heat in.\nShaping the Blade\nI heated my blade up to bright orange, and then rounded the tip on the curved part of a steel block I am using for an anvil. This is a small blade and was done using very light taps. Another approach that might work would be to hammer it over a piece of steel pipe or round bar stock.\nVideo link: Shaping the blade", "step_imgs": ["https://cdn.instructables.com/FO7/ZS2T/JF34DBNG/FO7ZS2TJF34DBNG.LARGE.jpg", "https://cdn.instructables.com/FXK/3WW0/JF34DBL1/FXK3WW0JF34DBL1.LARGE.jpg", "https://cdn.instructables.com/F5Z/OB83/JF34DBL3/F5ZOB83JF34DBL3.LARGE.jpg"], "step_title": "Step 6: Shaping the Hook (Optional)"}, {"step": 7, "steps_text": "A saw blade is already going to be hardened, so this step isn't really necessary if you've opted not to make your carving knife into a hook knife. For heat treating, followed a simple process based on my online research:\nHeat blade to cherry red\nQuench in vegetable oiI\nTemper in a toaster oven at 400F for 4 hours\nThe heat of the blade and the tempering temperature depends on the type of steel you're using, but this approach worked for me.", "step_imgs": ["https://cdn.instructables.com/F0O/I1X6/JF34BGBV/F0OI1X6JF34BGBV.LARGE.jpg", "https://cdn.instructables.com/FR3/D3PA/JF34BF7F/FR3D3PAJF34BF7F.LARGE.jpg", "https://cdn.instructables.com/FSY/WRU8/JF34BGCQ/FSYWRU8JF34BGCQ.LARGE.jpg"], "step_title": "Step 7: Heat Treating (optional)"}, {"step": 8, "steps_text": "For shaping the handle, I used a chisel and a small carving knife. You can use other tools like a spoke shave or knife for this task. Make sure both your chisel and knife are as sharp as possible. I try to carve away from myself wherever possible.\nMake it round I started by taking down the corners so the stock so it's shaped like an octagon, then take each corner down so it's shaped like a 16-sided polygon (hexadecagon?) The point is, keep taking down the corners until you essentially end up with a round shape.\nThe same process is repeated for the ferrule end. Use the outline as a guide. You can use a smaller knife here to aid\nVideo link: Shaping the handle", "step_imgs": ["https://cdn.instructables.com/FDM/7FU9/JF34DBVJ/FDM7FU9JF34DBVJ.LARGE.jpg", "https://cdn.instructables.com/FTA/4X95/JF34DBVK/FTA4X95JF34DBVK.LARGE.jpg", "https://cdn.instructables.com/FEN/RDY0/JF34DBVL/FENRDY0JF34DBVL.LARGE.jpg"], "step_title": "Step 8: Shape the Handle"}, {"step": 9, "steps_text": "Mark off a length of tubing. I left a little extra length since I would upset the ends of the pipe to add some character.\nIf you're using a soft material like copper or aluminium, you can use a standard tubing cutter. If you are cutting conduit, use a hack saw or angle grinder.\nAdd some character by upsetting and tapering with a hammer.\nVideo link: Cutting ferrule", "step_imgs": ["https://cdn.instructables.com/F8S/GE8C/JF34DFLO/F8SGE8CJF34DFLO.LARGE.jpg", "https://cdn.instructables.com/FX7/XR46/JF34DFAW/FX7XR46JF34DFAW.LARGE.jpg", "https://cdn.instructables.com/FVE/CPEN/JF34DIIW/FVECPENJF34DIIW.LARGE.jpg"], "step_title": "Step 9: Cut Ferrule"}, {"step": 10, "steps_text": "The hole I drilled for the tang was quite large, so I used some small wood wedges to wedge the blade in place. The wedges were created from some left over scrap form the handles. These wedges can be easily split with a chisel and then carved to shape.\nSince I was going to glue everything together with epoxy, I didn't worry about getting them perfect.", "step_imgs": ["https://cdn.instructables.com/F0E/8MY6/JF34DLY5/F0E8MY6JF34DLY5.LARGE.jpg", "https://cdn.instructables.com/FLW/RWA3/JF34DLZZ/FLWRWA3JF34DLZZ.LARGE.jpg", "https://cdn.instructables.com/F20/3QBB/JF34DLRS/F203QBBJF34DLRS.LARGE.jpg"], "step_title": "Step 10: Cut Wedges"}, {"step": 11, "steps_text": "Now you have all the parts in place, it's time to assemble the knife! It might be possible to assemble the knife using only wedges, but I am not that good of a craftsman and I never plan on removing the blade.\nMix up a small batch of epoxy\nApply some epoxy to the outside of the handle where the ferrule will go\nSet the ferrule in place by tapping on the table. I also light tapped the back end of the handle with a mallet.\nInstall the wedges\nApply epoxy to the tang and install the blade. To set the blade, I carefully held the blade and and rapped on the end.\nVideo link: Assemble knife", "step_imgs": ["https://cdn.instructables.com/F32/AF5C/JF34DMCC/F32AF5CJF34DMCC.LARGE.jpg", "https://cdn.instructables.com/FV3/4FEE/JF34DMCZ/FV34FEEJF34DMCZ.LARGE.jpg", "https://cdn.instructables.com/F47/ECCZ/JF34DMCR/F47ECCZJF34DMCR.LARGE.jpg", "https://cdn.instructables.com/FSE/F7V3/JF34DMCP/FSEF7V3JF34DMCP.LARGE.jpg", "https://cdn.instructables.com/FXI/Y5UF/JF34DMP3/FXIY5UFJF34DMP3.LARGE.jpg", "https://cdn.instructables.com/FBC/G95H/JF34DMCU/FBCG95HJF34DMCU.LARGE.jpg"], "step_title": "Step 11: Assemble Knife"}, {"step": 12, "steps_text": "Carve the final details into your knife.\nApply finish: An oil based finish such as Danish oil or linseed oil is very suitable.\nMake something!\nVideo link: Finish and enjoy", "step_imgs": ["https://cdn.instructables.com/FRK/FJ9K/JF34DFEK/FRKFJ9KJF34DFEK.LARGE.jpg", "https://cdn.instructables.com/FEK/WVOK/JF34DN4Z/FEKWVOKJF34DN4Z.LARGE.jpg", "https://cdn.instructables.com/FP9/GZRX/JF34DN94/FP9GZRXJF34DN94.LARGE.jpg"], "step_title": "Step 12: Finish and Enjoy"}], "channel": "Metalworking"}, {"category": "Workshop", "description": "The other day in the store i saw a rather expensive world map made out of wood. This got me thinking i could do this myself. In this instructable i'll try to explain how i made it and maybe help you make one to.", "title": "World Map Out of Wood", "url": "https://www.instructables.com/id/World-Map-Out-of-Wood/", "steps": [{"step": 1, "steps_text": "First you need to gather a few materials. The following list contains everything is used:\n- 2 pieces of 200x650x32mm pine\n- 1 piece of 2700x50x32mm pine\n- scrap bits of metal\n- small wood screws, any will do\n- paint (and brushes)\n- wood router\n- cordless drill\n- mitter saw\n- basic handtools", "step_imgs": ["https://cdn.instructables.com/FFR/CFNI/JF34D0KP/FFRCFNIJF34D0KP.LARGE.jpg"], "step_title": "Step 1: Gather Materials"}, {"step": 2, "steps_text": "Google a bit and find a map you would like to use. I then imported the file into GIMP (free image editor) and made it a little bit more printer friendly. Then i exported the file as .pdf an printed it on A3 sized paper.", "step_imgs": ["https://cdn.instructables.com/FTF/O042/JF34D0KJ/FTFO042JF34D0KJ.LARGE.jpg", "https://cdn.instructables.com/FAG/ICP2/JF34D0KL/FAGICP2JF34D0KL.LARGE.jpg", "https://cdn.instructables.com/FJJ/W8OZ/JF34D0KN/FJJW8OZJF34D0KN.LARGE.jpg", "https://cdn.instructables.com/FJO/74JD/JF34D0KO/FJO74JDJF34D0KO.LARGE.jpg"], "step_title": "Step 2: Find Your Map"}, {"step": 3, "steps_text": "Place the map on the wood, trace it with a pen (or something like that). Remove the paper and then use your pen to draw the map over the lines you just made.", "step_imgs": ["https://cdn.instructables.com/FM4/GEVR/JF34F675/FM4GEVRJF34F675.LARGE.jpg", "https://cdn.instructables.com/FQH/9OCX/JF34F688/FQH9OCXJF34F688.LARGE.jpg", "https://cdn.instructables.com/FYK/SYUL/JF34F69B/FYKSYULJF34F69B.LARGE.jpg"], "step_title": "Step 3: Transfer the Map to the Wood"}, {"step": 4, "steps_text": "Using the 2700x50x32mm piece of wood i bought, i made a frame around the map. I used wood dowels to connect and align the pieces, a bit of power fix made sure it wasn't going anywhere.", "step_imgs": ["https://cdn.instructables.com/F1Y/JFOB/JF34D0KV/F1YJFOBJF34D0KV.LARGE.jpg", "https://cdn.instructables.com/FWW/APF6/JF34F6KD/FWWAPF6JF34F6KD.LARGE.jpg", "https://cdn.instructables.com/FK5/WBFO/JF34F6NL/FK5WBFOJF34F6NL.LARGE.jpg"], "step_title": "Step 4: Making the Frame"}, {"step": 5, "steps_text": "It's now time to grab your wood router. I decided to put a frame around the map and brightened it up with some beautiful curves. Then i used another router bit to make the map look a little bit 3d.", "step_imgs": ["https://cdn.instructables.com/FFB/YNGX/JF34F6AE/FFBYNGXJF34F6AE.LARGE.jpg", "https://cdn.instructables.com/FZH/5JCQ/JF34F6CJ/FZH5JCQJF34F6CJ.LARGE.jpg", "https://cdn.instructables.com/FZ0/5LTQ/JF34F6EO/FZ05LTQJF34F6EO.LARGE.jpg", "https://cdn.instructables.com/F5B/VHOE/JF34F6FS/F5BVHOEJF34F6FS.LARGE.jpg"], "step_title": "Step 5: Grab Your Wood Router"}, {"step": 6, "steps_text": "Using the scrap bits of metal and a cordless drill i connected the two pieces of the map together. Using even more parts of scrap metal i connected the map to the frame.", "step_imgs": ["https://cdn.instructables.com/FRZ/UPPP/JF34F6J9/FRZUPPPJF34F6J9.LARGE.jpg", "https://cdn.instructables.com/FNS/0KU5/JF34F6NN/FNS0KU5JF34F6NN.LARGE.jpg", "https://cdn.instructables.com/FN8/QTEW/JF34F6GY/FN8QTEWJF34F6GY.LARGE.jpg"], "step_title": "Step 6: Putting It Al Together"}, {"step": 7, "steps_text": "I used blue acrylic paint to color in the sea, in hindsight i think the result was better without the blue paint. If you like the video and this instructable, please give it a thumbs up :)", "step_imgs": ["https://cdn.instructables.com/FRV/V3K5/JF34F6OR/FRVV3K5JF34F6OR.LARGE.jpg"], "step_title": "Step 7: Finish"}, {"step": 8, "steps_text": "I was really not liking the blue color i put on it. After some digging in my shed i found a color called 'inflatable blue'. I decided to paint it again using this color. Really, really pleased with the result.", "step_imgs": ["https://cdn.instructables.com/F4E/EA2B/JF34E0QX/F4EEA2BJF34E0QX.LARGE.jpg"], "step_title": "Step 8: Change of Heart (and Paint)"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "Hi Instructables Community,\nit's been well over six months since I published my last project. I moved to a new house and had to set up my workshop. Now that I'm settled I really look forward to get back into making stuff!\nMy first project is a throwback to one of my first projects. Back then I made four arrowheads from an old circular saw blade. Since the video of this project had a lot of new views recently I decided to revisit the idea but this time with a twist. Instead of just making a handful of pieces I decided to try to make a small batch with the intention to learn something new and also to sell them to create a budget for future projects.\nAnother first was that I produced a video with a complete voice over for the entire process so I would I appreciate if you had a few minutes to watch it.\nPlease note that I have added associate links to amazon products in this Instructable. Even if you do not want to buy a product I recommend I would appreciate if you could use the link if you plan a purchase. This won't cause you any additional cost but will result in direct support to me and my projects.", "title": "How to Make a Batch of DIY Arrowheads", "url": "https://www.instructables.com/id/How-to-Make-a-Batch-of-DIY-Arrowheads/", "steps": [{"step": 1, "steps_text": "When I made my first arrowheads I went into without really knowing much about the process of making them. One and a half years later I have a bit more experience and tried to use that starting with the design.\nThe first design featured two barbs which, although looking cool, was difficult to make and on a bigger scale would be too time consuming. I went and redesigned the arrowheads and got my followers on Instagram to decide which ones to try. In the designs I tried to combine functionality with a little style and easier production.\nTo create stencils I simply used a semi transparent sheet of plastic, transferred the two outlines and cut them out with an Exacto knife.\nNote: Since I was filming at the same time I probably did not take not as much care cutting as I should have. This resulted in an error in the smaller stencil.", "step_imgs": ["https://cdn.instructables.com/F8A/HTHG/JF3490PE/F8AHTHGJF3490PE.LARGE.jpg", "https://cdn.instructables.com/F6O/2M31/JF3490PF/F6O2M31JF3490PF.LARGE.jpg", "https://cdn.instructables.com/FNJ/MC1B/JF3490PI/FNJMC1BJF3490PI.LARGE.jpg", "https://cdn.instructables.com/FAD/SUP2/JF3490SA/FADSUP2JF3490SA.LARGE.jpg"], "step_title": "Step 1: Design and Stencil"}, {"step": 2, "steps_text": "As a material I chose an old and rusty two-man crosscut saw.\nThis saw was salvage from a scrap yard with the intention to use it as stock for projects.\nI spark and file tested the material and found that it was both high in carbon and hardened throughout. The thickness was around 1,5mm so quite ideal for what I had in mind.\nSome saws might be only hardened at the cutting edge or made of bi-metal were only the cutting edge can be used for blade projects.\nAn alternative would be thin circular saw blades or fresh stock from a metal supplier.", "step_imgs": ["https://cdn.instructables.com/FEL/JYEM/JF3490SB/FELJYEMJF3490SB.LARGE.jpg", "https://cdn.instructables.com/FHW/SCNZ/JF3490SC/FHWSCNZJF3490SC.LARGE.jpg", "https://cdn.instructables.com/F9Y/69OB/JF3490SD/F9Y69OBJF3490SD.LARGE.jpg"], "step_title": "Step 2: Material"}, {"step": 3, "steps_text": "Due to the size of the saw I didn't want to go for a chemical rust removal but instead for a mechanical solution.\nI clamped the blade down with two Wolfcraft Spring Clamps which held it in place securely enough.\nA 5\" Angle Grinder with a Wire Cup Brush was my tool of choice and it took me less then 10 minutes to get rid of all surface rust on both sides.\nIt should be noted that I went outside for this to avoid having that amount of dust inside the workshop. In addition I want to point out that you should wear eye protection and a respirator for your protection.", "step_imgs": ["https://cdn.instructables.com/FP8/U520/JF3490SH/FP8U520JF3490SH.LARGE.jpg", "https://cdn.instructables.com/FKY/GIZS/JF3490SI/FKYGIZSJF3490SI.LARGE.jpg", "https://cdn.instructables.com/FK1/31XG/JF3490SM/FK131XGJF3490SM.LARGE.jpg"], "step_title": "Step 3: Rust Removal"}, {"step": 4, "steps_text": "To transfer the shapes I used spray paint. This is something I had imagined to work way different than it actually did. In the end the transferred shapes weren't as precise wherever the spray paint went under the stencil resulting in blurred edges. I also think that I wasted a lot of material or could have made more pieces from what I had.\nFor more precise results I would approach this differently. Probably make a sample from aluminum and use that with dye cam to scribe the outlines on the material.", "step_imgs": ["https://cdn.instructables.com/FD3/7S3O/JF3490SQ/FD37S3OJF3490SQ.LARGE.jpg", "https://cdn.instructables.com/F1Z/ZBNX/JF3490SR/F1ZZBNXJF3490SR.LARGE.jpg", "https://cdn.instructables.com/FMR/KCXM/JF3490SS/FMRKCXMJF3490SS.LARGE.jpg"], "step_title": "Step 4: Design Transfer"}, {"step": 5, "steps_text": "In order to make the material easier to handle I mounted a 1mm cut-off disk on my Angle Grinder and cut the saw into four smaller pieces.", "step_imgs": ["https://cdn.instructables.com/F6A/2ZQQ/JF3490SV/F6A2ZQQJF3490SV.LARGE.jpg", "https://cdn.instructables.com/FZV/8T4C/JF3490SW/FZV8T4CJF3490SW.LARGE.jpg", "https://cdn.instructables.com/FZ6/LYDU/JF3490SX/FZ6LYDUJF3490SX.LARGE.jpg", "https://cdn.instructables.com/FU2/5RP3/JF3490SY/FU25RP3JF3490SY.LARGE.jpg"], "step_title": "Step 5: Stock Preparation"}, {"step": 6, "steps_text": "The previous process was repeated again and again until I had all shapes cut into single pieces.", "step_imgs": ["https://cdn.instructables.com/FTH/0SN7/JF3490SZ/FTH0SN7JF3490SZ.LARGE.jpg", "https://cdn.instructables.com/F7O/GZN5/JF3490T0/F7OGZN5JF3490T0.LARGE.jpg", "https://cdn.instructables.com/FEQ/T5IQ/JF3490T1/FEQT5IQJF3490T1.LARGE.jpg"], "step_title": "Step 6: More Prepwork"}, {"step": 7, "steps_text": "Some of the transferred outlines got damaged during the cutting action or peeled away due to heat (one more issue with spray paint). So I repeated my mistake but this time with a different color. Turns out yellow is even more susceptible to heat than blue spray paint.", "step_imgs": ["https://cdn.instructables.com/FQZ/IF37/JF3490T2/FQZIF37JF3490T2.LARGE.jpg", "https://cdn.instructables.com/FL6/U2OL/JF3490T3/FL6U2OLJF3490T3.LARGE.jpg"], "step_title": "Step 7: Fixing Up Paint"}, {"step": 8, "steps_text": "During the shaping I developed this process (and I would advise to watch the video for this).\nI made a little jig with a Toggle Clamp to keep the pieces in place over a water filled spark bucket.\nI set up my second angle grinder with a 1/4\" Grinding Wheel (A flap disk would work too) and used both alternatingly to shape the arrow heads. I would start with a series of relief cuts with the thin zip disk which where then followed up by shaping with the grinding wheel.\nIt is important not to remove too much material too quickly and don't get too close to the outline to avoid loosing the temper of the steel.", "step_imgs": ["https://cdn.instructables.com/F31/AW5F/JF3490T4/F31AW5FJF3490T4.LARGE.jpg", "https://cdn.instructables.com/F60/9N43/JF3490T6/F609N43JF3490T6.LARGE.jpg", "https://cdn.instructables.com/FYJ/VTWR/JF3490TA/FYJVTWRJF3490TA.LARGE.jpg", "https://cdn.instructables.com/FSL/H3L1/JF3490TB/FSLH3L1JF3490TB.LARGE.jpg"], "step_title": "Step 8: Rough Shaping"}, {"step": 9, "steps_text": "The rough shaping was followed up by more shaping on my bench grinder with a coarse stone.\nThis removes material very fast so it is very important to go slow with little pressure to avoid removing too much or destroying the temper.\nDo not wear gloves when doing this! They might get caught and result in severe injuries!\nIt might take a little practice but as you can see in the last picture you can achieve quite good results.", "step_imgs": ["https://cdn.instructables.com/F05/9UTB/JF3490TC/F059UTBJF3490TC.LARGE.jpg", "https://cdn.instructables.com/FO2/XAKL/JF3490TD/FO2XAKLJF3490TD.LARGE.jpg", "https://cdn.instructables.com/FAN/B70L/JF3490TE/FANB70LJF3490TE.LARGE.jpg", "https://cdn.instructables.com/FH0/NJ3B/JF3490TF/FH0NJ3BJF3490TF.LARGE.jpg"], "step_title": "Step 9: Shaping"}, {"step": 10, "steps_text": "I mounted my belt sander to my work bench to sand the faces of the arrowhead blanks with a coarse 80 grit belt. This had the purpose of removing any remaining rust and get a flatter surface. There was some pitting from rust in some places but I decided to keep it as a reminder of the previous life the arrowheads had.", "step_imgs": ["https://cdn.instructables.com/F45/5IYZ/JF3490TH/F455IYZJF3490TH.LARGE.jpg", "https://cdn.instructables.com/FTL/G11K/JF3490TI/FTLG11KJF3490TI.LARGE.jpg"], "step_title": "Step 10: Sanding"}, {"step": 11, "steps_text": "Once all arrowheads were shape I moved on to my 1\" x 30\" Belt Grinder to start the bevels with a 40 Grit belt.\nSince this grit is pretty aggressive it is important to go slow to avoid overheating the blade and maybe end up loosing the tip of the arrowhead.\nKeep a bucket with water nearby to cool the blades regularly. A good rule of thumb might be to cool them down as soon as they get too hot to hold :D", "step_imgs": ["https://cdn.instructables.com/FYV/Y0IB/JF3490TJ/FYVY0IBJF3490TJ.LARGE.jpg", "https://cdn.instructables.com/F8W/J5Z3/JF3490TK/F8WJ5Z3JF3490TK.LARGE.jpg", "https://cdn.instructables.com/FUN/1ZKB/JF3490TM/FUN1ZKBJF3490TM.LARGE.jpg"], "step_title": "Step 11: Bevels"}, {"step": 12, "steps_text": "I probably should have done this prior to creating the bevels but hey that's why we are learning every day.\nI mounted my Dremel Rotary Tool in a vise and used a sanding drum to finalize the shape.\nThis worked surprisingly well and led me to think about making a permanently mounted rotary tool with a flat work rest as a stationary tool.", "step_imgs": ["https://cdn.instructables.com/F38/MIV8/JF3490TZ/F38MIV8JF3490TZ.LARGE.jpg", "https://cdn.instructables.com/FR6/HNN8/JF3490U0/FR6HNN8JF3490U0.LARGE.jpg", "https://cdn.instructables.com/FN9/V7DO/JF3490U5/FN9V7DOJF3490U5.LARGE.jpg"], "step_title": "Step 12: Even More Shaping"}, {"step": 13, "steps_text": "Since the 40 Grit belt left a very rough finish I repeated the process with a 120 Grit belt followed by a 240 Grit belt. In this step I ensured that the cutting edge was properly going from end to end. This wasn't so easy as I did this free hand without a jig. With the higher grits heat builds up faster due to the greater surface area that is in touch with the material so again ensuring that the piece stays cool is vital.", "step_imgs": ["https://cdn.instructables.com/FC0/Y376/JF3490UA/FC0Y376JF3490UA.LARGE.jpg", "https://cdn.instructables.com/FDI/G0TJ/JF3490UF/FDIG0TJJF3490UF.LARGE.jpg", "https://cdn.instructables.com/FZ6/JULU/JF3490UG/FZ6JULUJF3490UG.LARGE.jpg"], "step_title": "Step 13: Refining Bevels"}, {"step": 14, "steps_text": "To finish the bevels I used a 400 Grit Belt and polished the bevels lengthwise.\nTo safe time I did this on the contact wheel and followed it up on the \"platten\" of the grinder.", "step_imgs": ["https://cdn.instructables.com/FX7/X9PD/JF3490UL/FX7X9PDJF3490UL.LARGE.jpg", "https://cdn.instructables.com/FXB/RZK9/JF3490UV/FXBRZK9JF3490UV.LARGE.jpg", "https://cdn.instructables.com/FAQ/CUZ0/JF3490UQ/FAQCUZ0JF3490UQ.LARGE.jpg"], "step_title": "Step 14: Polishing the Bevels"}, {"step": 15, "steps_text": "One last time I went to my belt sander and finished the faces with a 180 Grit satin finish. Now if this would be a knife I would follow this up with some hand sanding to ensure all lines are parallel but since the arrowheads should keep a somewhat DIY look I left it at that.", "step_imgs": ["https://cdn.instructables.com/FXQ/Y3HA/JF3490UW/FXQY3HAJF3490UW.LARGE.jpg", "https://cdn.instructables.com/F99/64JF/JF3490UX/F9964JFJF3490UX.LARGE.jpg", "https://cdn.instructables.com/F6Y/E93T/JF3490UY/F6YE93TJF3490UY.LARGE.jpg"], "step_title": "Step 15: Surface Finish"}, {"step": 16, "steps_text": "Another thing I wanted to experiment was to use gun blue as a finish. On the one hand the matte black finish looks appealing and on the other hand it adds protections against rust.\nI used it once before to blacken a bushcraft knife I made for my nephew.\nFrom that experience I knew that I had to use plenty of the liquid for an even finish. Before applying it is important to thoroughly clean the arrowheads. I applied the liquid with a brush as I didn't have enough to dip the blades in. For an even finished I used strokes in only one direction.\nOnce the chemical had a few minutes to react with the metal I used a shop towel to wipe it all off. This resulted in a very consistent finish.\nIn the end I polished the bevels with a 2000 Grit belt to remove the black color from the edge.", "step_imgs": ["https://cdn.instructables.com/FKO/UPGB/JF3490UZ/FKOUPGBJF3490UZ.LARGE.jpg", "https://cdn.instructables.com/F3N/3B3W/JF3490V0/F3N3B3WJF3490V0.LARGE.jpg", "https://cdn.instructables.com/FH9/T59R/JF3490V5/FH9T59RJF3490V5.LARGE.jpg", "https://cdn.instructables.com/FZ2/A5XN/JF3490VA/FZ2A5XNJF3490VA.LARGE.jpg", "https://cdn.instructables.com/F35/AF5C/JF3490VF/F35AF5CJF3490VF.LARGE.jpg"], "step_title": "Step 16: Blackening With Gun Blue"}, {"step": 17, "steps_text": "So I but quite some effort into showing and describing how to make arrowheads yourself. If you do not feel like making your own however but still want some you can visit my shop on Facebook and purchase them there.\nAh before I forget head to the next page to see how to attach those arrowheads to an arrow.", "step_imgs": ["https://cdn.instructables.com/FLD/KL7F/JF3490VK/FLDKL7FJF3490VK.LARGE.jpg", "https://cdn.instructables.com/FAZ/ZEQF/JF34DMEI/FAZZEQFJF34DMEI.LARGE.jpg", "https://cdn.instructables.com/FNY/8S6T/JF34DLZ5/FNY8S6TJF34DLZ5.LARGE.jpg", "https://cdn.instructables.com/F6L/07SC/JF34DM26/F6L07SCJF34DM26.LARGE.jpg", "https://cdn.instructables.com/FQ7/LOB2/JF34DM57/FQ7LOB2JF34DM57.LARGE.jpg"], "step_title": "Step 17: All Done, Now What?"}, {"step": 18, "steps_text": "So this is how I go about this, I haven't done a ton of research so make sure you check other sources as well.\nTo avoid splitting the wood I cut a notch into a 1cm wooden dowel (beech I believe). I used my bandsaw for convenience but this could also be done with a thin kerf saw.\nI cleaned up the notch with my belt grinder but just regular sandpaper will do too.", "step_imgs": ["https://cdn.instructables.com/F3P/RUN6/JF3490VL/F3PRUN6JF3490VL.LARGE.jpg", "https://cdn.instructables.com/FYU/1YGN/JF3490VM/FYU1YGNJF3490VM.LARGE.jpg", "https://cdn.instructables.com/FX2/DVJC/JF3490VN/FX2DVJCJF3490VN.LARGE.jpg"], "step_title": "Step 18: Hafting an Arrowhead"}, {"step": 19, "steps_text": "A disk sander is very helpful with shaping the shaft creating a tapered shape.\nUse masking tape to avoid having glue all over the blade after the glue up.", "step_imgs": ["https://cdn.instructables.com/FT6/FF6I/JF3490VS/FT6FF6IJF3490VS.LARGE.jpg", "https://cdn.instructables.com/FZ4/E4IK/JF3490VT/FZ4E4IKJF3490VT.LARGE.jpg", "https://cdn.instructables.com/FZO/XHM5/JF3490VY/FZOXHM5JF3490VY.LARGE.jpg", "https://cdn.instructables.com/FXC/CR7E/JF3490W3/FXCCR7EJF3490W3.LARGE.jpg"], "step_title": "Step 19: Hafting Cont."}, {"step": 20, "steps_text": "I selected a glue that I knew would remain flexible after the glue up as I didn't want too much rigidity. In hindsight I would probably use a 5 minute epoxy next time as it has a longer open time and better consistency to work with.\nI created a loop with the string and held it in place with a spring clamp. Now I went back and began to twist the string around the shaft beginning approx. 12mm (1/2\") below the notch (this should help keep it from splitting).\nThe string was then wrapped around the shaft towards the tip and in the end threaded to the loop and pulled back under the wraps locking it in place.\nI used a small clamp to create some pressure during the glue up but the round surface makes this very difficult. I will have to think about a better way to do this next time.\nFinally I used CA glue to lock the wraps and seal them. It is important to keep moving while spreading and massaging the glue into the wraps.", "step_imgs": ["https://cdn.instructables.com/F3Y/9Z4A/JF3490W8/F3Y9Z4AJF3490W8.LARGE.jpg", "https://cdn.instructables.com/FWO/5W58/JF3490WD/FWO5W58JF3490WD.LARGE.jpg", "https://cdn.instructables.com/FG9/NLEZ/JF3490WE/FG9NLEZJF3490WE.LARGE.jpg", "https://cdn.instructables.com/FEV/W0W7/JF3490WJ/FEVW0W7JF3490WJ.LARGE.jpg", "https://cdn.instructables.com/FZM/W80V/JF3490WO/FZMW80VJF3490WO.LARGE.jpg", "https://cdn.instructables.com/F08/NII0/JF3490WZ/F08NII0JF3490WZ.LARGE.jpg", "https://cdn.instructables.com/FQY/4O7I/JF3490WP/FQY4O7IJF3490WP.LARGE.jpg", "https://cdn.instructables.com/FIB/02BC/JF3490WQ/FIB02BCJF3490WQ.LARGE.jpg", "https://cdn.instructables.com/F3W/S1SJ/JF3490X0/F3WS1SJJF3490X0.LARGE.jpg"], "step_title": "Step 20: And Finishing That Too"}], "channel": "Metalworking"}, {"category": "Workshop", "description": "Hello everyone ! i wanted to share with you my last tank.\nThis is the Panzer IV, or the PzKpfW IV Ausf. G / H (without / with the plates). It was the most used and the most emblematic german tank during the WWII.\nThe scale is approximatively 1:18, with its 38cm length, 17cm width, and 16cm height.\nYou can find the plans on its Thingiverse page, with my others models. Also, an online 3D model is available here .\nThanks caractere for working on the motorization and the code.\nThe majority of the parts are cut in 3mm material. A small part is cut in 6mm and 2.5mm material.\nThere are more than 500+ parts, so you will need to be patient when you cut it. Dont throw away your scraps, there are parts inside other parts or really tiny parts. You will also need :\n12x Ø3mm 10mm screws,\n16x Ø3mm 20mm screws,\n11x Ø3mm 50mm screw,\n26x (if possible) Ø4mm 8mm long tubes as wheels hinges (i used those),\n2x Ø3mm ~6cm rods,\nA large amount of toothpicks (Ø2mm),\nA Ø22mm bearing (the same ones used for the fidget spinners),\n4x little zipties,\nIf you want to motorize it, you will need :\nA NodeMCU as microcontroller,\na servo 9G for the turret,\na servo 32G for the tracks,\na 4.5V battery,\nand a tiny breadboard to wire all this stuff.", "title": "Carter's Lasercut Tank - Panzer IV G/H (motorized)", "url": "https://www.instructables.com/id/Carters-Lasercut-Tank-Panzer-IV-GH-motorized/", "steps": [{"step": 1, "steps_text": "To begin, just assemble the main part of the model. This one is easy. We will add all the details at the end.", "step_imgs": ["https://cdn.instructables.com/F58/DHEI/JE4KNDKX/F58DHEIJE4KNDKX.LARGE.jpg"], "step_title": "Step 1: The Frame"}, {"step": 2, "steps_text": "It begin to be trickier. Don't mistake the \"D\" and \"S\" frame, the \"D\" stand for the driver side (left side), and the \"S\" stands for the shooter side (right). The perpendicular rods are here the handle the plates and the relief details.", "step_imgs": ["https://cdn.instructables.com/FO3/M0IE/JE4KNDLS/FO3M0IEJE4KNDLS.LARGE.jpg", "https://cdn.instructables.com/FA6/YQ6N/JE4KNDME/FA6YQ6NJE4KNDME.LARGE.jpg"], "step_title": "Step 2: The Top"}, {"step": 3, "steps_text": "Assemble some inside details before glueing everything; you won't have access to the inside after.", "step_imgs": ["https://cdn.instructables.com/FH1/DCJR/JF34FKLU/FH1DCJRJF34FKLU.LARGE.jpg", "https://cdn.instructables.com/F69/8CS6/JF34FKM4/F698CS6JF34FKM4.LARGE.jpg", "https://cdn.instructables.com/F8T/GLQW/JF34FKM5/F8TGLQWJF34FKM5.LARGE.jpg", "https://cdn.instructables.com/F8C/ZX3G/JF34FKM6/F8CZX3GJF34FKM6.LARGE.jpg", "https://cdn.instructables.com/FKQ/3MXQ/JF34FKM7/FKQ3MXQJF34FKM7.LARGE.jpg", "https://cdn.instructables.com/FS0/7ARQ/JF34FKM8/FS07ARQJF34FKM8.LARGE.jpg", "https://cdn.instructables.com/FE5/YHW8/JF34FKMC/FE5YHW8JF34FKMC.LARGE.jpg", "https://cdn.instructables.com/FWB/K3WX/JF34FKM9/FWBK3WXJF34FKM9.LARGE.jpg", "https://cdn.instructables.com/FBH/LSQ7/JF34FKMD/FBHLSQ7JF34FKMD.LARGE.jpg"], "step_title": "Step 3: The Turret"}, {"step": 4, "steps_text": "Stack all those circles on the 50mm (or 40mm) screw through the bearing.", "step_imgs": ["https://cdn.instructables.com/FB1/7891/JF34FKMH/FB17891JF34FKMH.LARGE.jpg", "https://cdn.instructables.com/FK8/DM6Z/JF34FL1W/FK8DM6ZJF34FL1W.LARGE.jpg", "https://cdn.instructables.com/FR2/DJ2B/JF34FL1X/FR2DJ2BJF34FL1X.LARGE.jpg"], "step_title": "Step 4: Attach the Turret to the Top"}, {"step": 5, "steps_text": "those parts are handled with the four bolts we tied onto the main frame. I made it removable to have a better access to the electronic parts we will put later.", "step_imgs": ["https://cdn.instructables.com/FEU/Y5A4/JE4KNDOK/FEUY5A4JE4KNDOK.LARGE.jpg", "https://cdn.instructables.com/F6Y/D3DX/JE4KNDOM/F6YD3DXJE4KNDOM.LARGE.jpg", "https://cdn.instructables.com/FNX/6Z36/JE4KNDON/FNX6Z36JE4KNDON.LARGE.jpg"], "step_title": "Step 5: The Sides"}, {"step": 6, "steps_text": "We will stack every layers of each wheel around the plastic rolls (it allows a better roll and avoids the thread wear on the wheel). Make sure the wheels are perpendicular compared to the pivot axis. Beware, there are some details to not forget :\nFor the drive wheel, the teeth must be perfectly aligned. You can assemble the tool with the negative shape of the wheel to help you. Use the rods as a pivot for this wheel.\nFor the bottom wheels, align the holes for a better looking.\nFor the top wheels, watch out for the middle layer, this one is thin.", "step_imgs": ["https://cdn.instructables.com/FIU/MRTR/JF34FKMG/FIUMRTRJF34FKMG.LARGE.jpg", "https://cdn.instructables.com/F8N/J0MB/JF34FKMI/F8NJ0MBJF34FKMI.LARGE.jpg", "https://cdn.instructables.com/F46/5DKD/JF34FKMM/F465DKDJF34FKMM.LARGE.jpg", "https://cdn.instructables.com/FXL/GAZK/JF34FKP5/FXLGAZKJF34FKP5.LARGE.jpg", "https://cdn.instructables.com/FCE/R2NT/JF34FKMK/FCER2NTJF34FKMK.LARGE.jpg", "https://cdn.instructables.com/FKV/RTXY/JF34FKML/FKVRTXYJF34FKML.LARGE.jpg", "https://cdn.instructables.com/FLN/KT88/JF34FKMN/FLNKT88JF34FKMN.LARGE.jpg", "https://cdn.instructables.com/FZ4/5YHR/JF34FKMO/FZ45YHRJF34FKMO.LARGE.jpg"], "step_title": "Step 6: The Wheels"}, {"step": 7, "steps_text": "Aaaaah, the longest part. Do be hurry for it, it will be long, about half a day for each track.\nCut the tooth link part in 2.5mm material. Cut it in 3mm would be a bit too wide to fit in the wheels slots.\nThe holes have a different diameter. Those connected to the slat are a bit smaller to handle the toothpick, and the three others holes (on the two studs and the tooth link) are bit bigger to make a good hinge.", "step_imgs": ["https://cdn.instructables.com/FVT/IK8H/JF34FKME/FVTIK8HJF34FKME.LARGE.jpg", "https://cdn.instructables.com/FEH/6BMG/JF34FKMF/FEH6BMGJF34FKMF.LARGE.jpg"], "step_title": "Step 7: The Tracks"}, {"step": 8, "steps_text": "The best part. Follow the photos to put everything on its place.", "step_imgs": ["https://cdn.instructables.com/F0W/IC1J/JF34FL2E/F0WIC1JJF34FL2E.LARGE.jpg", "https://cdn.instructables.com/FTZ/RQP9/JF34FL2N/FTZRQP9JF34FL2N.LARGE.jpg", "https://cdn.instructables.com/FW9/PP3W/JF34FL2O/FW9PP3WJF34FL2O.LARGE.jpg"], "step_title": "Step 8: The Details"}, {"step": 9, "steps_text": "For the turret armor, glue the plates around the round frame. leave about 4.5mm down and 20.5 up for a correct height.\nFor the side armor, glue the stuff together. There is no indication about the plate position on the frame, glue 16mm away from the top of the frame and 40mm away from the front.", "step_imgs": ["https://cdn.instructables.com/FPG/OO2B/JF34FL20/FPGOO2BJF34FL20.LARGE.jpg", "https://cdn.instructables.com/F3K/KL2N/JF34FL23/F3KKL2NJF34FL23.LARGE.jpg"], "step_title": "Step 9: The Armor Plates"}, {"step": 10, "steps_text": "Coming soon !\nConnect the 32G servos to the drive wheels with the 6mm gears.\nFor the turret, fix the 9G motor.\nUpload the joined code on your microcontroller. For the pins :\nThe + side of the battery on the VCC pin, and the - side on the ground (GND),\nThe left 32G on the A1 pin,\nThe right one on the A2 pin,\nThe 9G on the A3 pin.\nConnect your phone or your computer to your NodeMCU via WiFi. open your navigator and go to 192.165.0.1. You now have access to the interface, and control your tank.", "step_imgs": ["https://cdn.instructables.com/FVF/GU8Z/JF34FMLU/FVFGU8ZJF34FMLU.LARGE.jpg"], "step_title": "Step 10: The Motorization"}], "channel": "Laser Cutting"}, {"category": "Workshop", "description": "In this Instructable I'm going to show you how I made some coin boxes out of white oak for some relatives of mine that are coin collectors and Tennessee Vol fans! (Hence the orange dye stain)\nFor more details, you watch the video above or read the in depth article on my website.\nDisclaimer: This article contains affiliate links.", "title": "How to Make a Coin Box", "url": "https://www.instructables.com/id/How-to-Make-a-Coin-Box/", "steps": [{"step": 1, "steps_text": "I made my boxes out of some rough 4/4 white oak I had on hand. But if you're not set up to work with rough lumber then find some 1/4\" or 3/8\" thick stock at your home improvement center.\nThe materials I used were:\nWhite Oak\nTitebond II\nGeneral Finishes Orange Dye Stain\nMinwax Spray Lacquer\nThe tools I used were:\nTable Saw\nMiter Saw (Miter Saw Station Video)\nJointer*\nPlaner*\nBandsaw*\nHandplane\n*only needed if you're working with rough lumber.", "step_imgs": ["https://cdn.instructables.com/FYV/DC79/JF34BAFT/FYVDC79JF34BAFT.LARGE.jpg"], "step_title": "Step 1: Collect Materials"}, {"step": 2, "steps_text": "The first step is breaking down your lumber!\nIf you're using rough lumber, you'll need to mill it to size. I jointed, planed, ripped, and re-sawed mine to about 3/8\" thick for the sides, and 1/4\" for the top and bottom. Then cut the pieces to length.\nIf you're working with ready to use lumber, just cut it to the width and lengths needed for whatever size you want your box to be.", "step_imgs": ["https://cdn.instructables.com/FLB/49L1/JF34BAIM/FLB49L1JF34BAIM.LARGE.jpg", "https://cdn.instructables.com/F5K/HJ7B/JF34BAJK/F5KHJ7BJF34BAJK.LARGE.jpg", "https://cdn.instructables.com/FRB/B98A/JF34BB44/FRBB98AJF34BB44.LARGE.jpg", "https://cdn.instructables.com/F7V/6M3Z/JF34BALO/F7V6M3ZJF34BALO.LARGE.jpg", "https://cdn.instructables.com/FKR/BGBZ/JF34BAUW/FKRBGBZJF34BAUW.LARGE.jpg", "https://cdn.instructables.com/FAW/8ZBB/JF34BBLW/FAW8ZBBJF34BBLW.LARGE.jpg", "https://cdn.instructables.com/F28/YXET/JF34BBX2/F28YXETJF34BBX2.LARGE.jpg", "https://cdn.instructables.com/FKJ/O9SG/JF34BCFG/FKJO9SGJF34BCFG.LARGE.jpg"], "step_title": "Step 2: Break Down Your Lumber"}, {"step": 3, "steps_text": "I prefer to miter on my table saw with my miter gage. For best results, do some test cuts first to make sure your blade is right on 45 degrees!\nFirst I just cut a miter on one end, and then set up the stop block on my miter gage to make sure the pieces are all the same size.", "step_imgs": ["https://cdn.instructables.com/FCP/ZH0G/JF34BCS6/FCPZH0GJF34BCS6.LARGE.jpg", "https://cdn.instructables.com/FQ9/VURJ/JF34BD05/FQ9VURJJF34BD05.LARGE.jpg"], "step_title": "Step 3: Miter the Sides"}, {"step": 4, "steps_text": "I used a flat tooth rip blade in my table saw to cut the dadoes for the top and bottom of the box. I also cut the top of the front pieces of the boxes so there would be a place for the top to slide in and out (skip ahead and look at the pics if this doesn't make sense).", "step_imgs": ["https://cdn.instructables.com/FXM/PMZB/JF34BDK4/FXMPMZBJF34BDK4.LARGE.jpg", "https://cdn.instructables.com/FPG/GY95/JF34BDZN/FPGGY95JF34BDZN.LARGE.jpg"], "step_title": "Step 4: Cut in the Dadoes"}, {"step": 5, "steps_text": "Before gluing I sanded the inside, this will be a lot harder after the glue up! Then I taped off the inside to make cleaning up any glue squeeze out a lot easier.\nFor a small box like this, tape gives ample clamping pressure so I prepped all the corner with tape before applying and spreading the glue.\nOnce the glue is on, I inserted the bottom into the dado, wrapped up the box and secured the last corner with tape.", "step_imgs": ["https://cdn.instructables.com/FU4/FAXS/JF34BEWG/FU4FAXSJF34BEWG.LARGE.jpg", "https://cdn.instructables.com/F7X/MADI/JF34BFDX/F7XMADIJF34BFDX.LARGE.jpg", "https://cdn.instructables.com/FEJ/R730/JF34BG0M/FEJR730JF34BG0M.LARGE.jpg", "https://cdn.instructables.com/FQT/GWQE/JF34BGIO/FQTGWQEJF34BGIO.LARGE.jpg", "https://cdn.instructables.com/F1Q/5XOZ/JF34BGZG/F1Q5XOZJF34BGZG.LARGE.jpg"], "step_title": "Step 5: Glue Up the Sides and Bottom"}, {"step": 6, "steps_text": "Before finishing the top piece and applying finish, I remove all the tape and give the outside of the box a good sanding. I take this opportunity to break all the corners so they're not too sharp.", "step_imgs": ["https://cdn.instructables.com/F7Q/64LN/JF34BH87/F7Q64LNJF34BH87.LARGE.jpg", "https://cdn.instructables.com/F0I/W7VI/JF34BHNC/F0IW7VIJF34BHNC.LARGE.jpg"], "step_title": "Step 6: Prep the Box for Finish"}, {"step": 7, "steps_text": "I insert the top into the dado and mark how long it needs to be before cutting it to length.\nThen I beveled the edges with a hand plane so it'll slide a little easier in the dadoes.\nNext up is a finger hole to make it easier to pull out the top, I used a 5/8\" forstner bit for this.\nThen sand, sand, sand!", "step_imgs": ["https://cdn.instructables.com/FR9/CX4B/JF34BHWX/FR9CX4BJF34BHWX.LARGE.jpg", "https://cdn.instructables.com/F35/BRFJ/JF34BI0L/F35BRFJJF34BI0L.LARGE.jpg", "https://cdn.instructables.com/FMQ/9SFB/JF34BID1/FMQ9SFBJF34BID1.LARGE.jpg", "https://cdn.instructables.com/FV0/F57X/JF34BIW4/FV0F57XJF34BIW4.LARGE.jpg", "https://cdn.instructables.com/FK1/RMZN/JF34BJ97/FK1RMZNJF34BJ97.LARGE.jpg", "https://cdn.instructables.com/FWZ/NEQA/JF34BJBC/FWZNEQAJF34BJBC.LARGE.jpg"], "step_title": "Step 7: Finishing Touches on the Top"}, {"step": 8, "steps_text": "I wanted to dye this orange because I made them for some Tennessee Vols fans, so I put on two coats of orange dye stain. I like the way dye stain doesn't hide the grain but helps the rays pop!\nThe stain doesn't offer any protection though, so I hit it with several coats of spray lacquer. Make sure to do this somewhere with plenty of ventilation.", "step_imgs": ["https://cdn.instructables.com/FCJ/Z31J/JF34BJJB/FCJZ31JJF34BJJB.LARGE.jpg", "https://cdn.instructables.com/FYB/EAYU/JF34BJNA/FYBEAYUJF34BJNA.LARGE.jpg", "https://cdn.instructables.com/FJS/IY64/JF34BJV7/FJSIY64JF34BJV7.LARGE.jpg"], "step_title": "Step 8: Apply Finish!"}, {"step": 9, "steps_text": "They're all done, so now it's time to load them up with coins, give them away, or do whatever you made them for! Hope you enjoyed this!", "step_imgs": ["https://cdn.instructables.com/F3B/EDCB/JF34BKUY/F3BEDCBJF34BKUY.LARGE.jpg", "https://cdn.instructables.com/FU1/Q6X4/JF34BK9I/FU1Q6X4JF34BK9I.LARGE.jpg"], "step_title": "Step 9: Enjoy!"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "With Easter coming up, I bought Ukrainian Easter eggs for my family from Ardyth at the eggnpagan Link to the shop where I bought my eggs and I wanted to make a platform to display them. In this Instructable I will describe how I made these. The platforms are made of either Zebrawood or Mahogany.", "title": "Easter Egg Display Platforms", "url": "https://www.instructables.com/id/Easter-Egg-Display-Platforms/", "steps": [{"step": 1, "steps_text": "Tools\nTable saw with a sled\nDrill Press with a 1/8 inch bit\n1 inch Forstner bit\nRoundover bit on router table\nSander with 220-grit paper\nMaterials\nZebrawood or Mahogany (Any wood will do). Three inches wide by 3/4 inch thick.\nTung oil", "step_imgs": ["https://cdn.instructables.com/FGD/GYX1/JF34E63H/FGDGYX1JF34E63H.LARGE.jpg"], "step_title": "Step 1: Tools and Materials"}, {"step": 2, "steps_text": "Use the table saw to cut three inch squares\nMark the center of each piece using a straight edge ruler.", "step_imgs": ["https://cdn.instructables.com/FIJ/OFNM/JF34E5XZ/FIJOFNMJF34E5XZ.LARGE.jpg", "https://cdn.instructables.com/F77/123U/JF34E5Y3/F77123UJF34E5Y3.LARGE.jpg", "https://cdn.instructables.com/F13/HPNU/JF34E5YQ/F13HPNUJF34E5YQ.LARGE.jpg"], "step_title": "Step 2: Cut the Wood Into Three Inch Squares and Mark the Center"}, {"step": 3, "steps_text": "Using the drill press, drill a 1/8 inch hole in the center. The nail on the sled will pass thru this", "step_imgs": ["https://cdn.instructables.com/FBI/R6FC/JF34E5Z7/FBIR6FCJF34E5Z7.LARGE.jpg"], "step_title": "Step 3: Drill a 1/8 Inch Hole in the Center"}, {"step": 4, "steps_text": "Make a very small diameter drill hole on your sled about 2 7/16 inches away from the blade\nTap a nail in the square.\nBegin cutting the edges by passing it thru the saw.\nRotate the square by a few degrees at a time until you have cut the square into a circle", "step_imgs": ["https://cdn.instructables.com/F17/PMQV/JF34E5ZP/F17PMQVJF34E5ZP.LARGE.jpg", "https://cdn.instructables.com/FVR/CIUJ/JF34BEHI/FVRCIUJJF34BEHI.LARGE.jpg", "https://cdn.instructables.com/F32/2LN7/JF34E607/F322LN7JF34E607.LARGE.jpg", "https://cdn.instructables.com/F7D/J4UD/JF34E60B/F7DJ4UDJF34E60B.LARGE.jpg"], "step_title": "Step 4: Cut a Circle Using the Sled"}, {"step": 5, "steps_text": "Again using the drill press use a 1 inch Forstner bit to make a 3/8 to 4/8 inch deep cup in the center of each disc.\nThis will be the cup where the egg rests", "step_imgs": ["https://cdn.instructables.com/FWM/EYYQ/JF34E611/FWMEYYQJF34E611.LARGE.jpg", "https://cdn.instructables.com/F4A/2970/JF34E61X/F4A2970JF34E61X.LARGE.jpg", "https://cdn.instructables.com/FYO/55PA/JF34E62F/FYO55PAJF34E62F.LARGE.jpg"], "step_title": "Step 5: Using a Forstner Bit, Make a 3/8 Inch Deep Hole 1 Inch Across."}, {"step": 6, "steps_text": "Carefully use a round-over bit on a router to round over and soften the top edge.\nThis is optional and if you like the stand to be a puck, that's up to you.\nSand all surfaces smooth using 220 or higher grit sandpaper", "step_imgs": ["https://cdn.instructables.com/FLE/AM44/JF34E62X/FLEAM44JF34E62X.LARGE.jpg", "https://cdn.instructables.com/FQL/DENZ/JF34E63Y/FQLDENZJF34E63Y.LARGE.jpg", "https://cdn.instructables.com/F5N/0H0D/JF34E64I/F5N0H0DJF34E64I.LARGE.jpg"], "step_title": "Step 6: Using a Router, Round Over the Top Edge"}, {"step": 7, "steps_text": "I used Tung Oil which is fast and provides a nice finish. This is not a project that is exposed to water and so Tung oil should be fine. Alternatively you can use Danish Oil, Teak Oil, Polyurethane or any finish you desire. I put on three coat with each coat applied about an hour apart.", "step_imgs": ["https://cdn.instructables.com/FO2/KQKS/JF34E64K/FO2KQKSJF34E64K.LARGE.jpg", "https://cdn.instructables.com/FTM/N6N8/JF34E653/FTMN6N8JF34E653.LARGE.jpg", "https://cdn.instructables.com/FL7/138G/JF34E662/FL7138GJF34E662.LARGE.jpg", "https://cdn.instructables.com/FK1/4IYM/JF34E65K/FK14IYMJF34E65K.LARGE.jpg"], "step_title": "Step 7: Apply Tung Oil or a Finish of Your Choice"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "Hello all!\n\nI've noticed that a lot of people in my community have dreamed about getting into blacksmithing and forging, but feel as if it's somewhat beyond their skillset, that the proper equipment would be difficult to locate, and that it would be hard to find adequate space for that kind of metalworking shop. I'm hoping that the Trellis Project can help to change that - it's a small modular jig system for shaping steel, simple to use and easy to build using tools that are readily available at most makerspaces.\n\nA hook is a useful thing to have around the house, and the making of it involves one of the most fundamental blacksmithing techniques - drawing out a bar to a point. It also involves the creation of a disk, one of the most fundamental tools for using on the Trellis. This makes it a perfect first project!\n\nLearn about how to build your own Trellis here (https://www.instructables.com/id/The-Trellis-Project-01-What-the-Trellis-Is-and-How/), and learn about how to build a disk for it here. If you've got those two things you're ready to roll.", "title": "The Trellis Project 02: Forging a Hook", "url": "https://www.instructables.com/id/The-Trellis-Project-Forging-a-Hook/", "steps": [{"step": 1, "steps_text": "Before you bend any steel you're going to need the holes for the pegs, and those holes are going to need to be in the correct places. This step is about that process.\nPlace the frame onto the baseplate as represented in the Pictures 1-2. After doing this, place the \"A\" Ruler into the frame at 1.10, and use a center-punch to make a dimple at hole A8, like in Picture 3. Make similar dimples at points 1.9/A6 and 1.6/A11 (represented in Pictures 4-5).\n\nNow use the \"B\" Ruler and the center-punch to make dimples at 2.3/B13 and 2.3/B14 (shown in Pictures 6-7), leaving you with all of the dimples you need (Picture 8). At this point you'll be ready for the next step.", "step_imgs": ["https://cdn.instructables.com/FAX/C8JA/JF347525/FAXC8JAJF347525.LARGE.jpg", "https://cdn.instructables.com/F4R/HTYU/JF347537/F4RHTYUJF347537.LARGE.jpg", "https://cdn.instructables.com/FFV/M0YU/JF347549/FFVM0YUJF347549.LARGE.jpg", "https://cdn.instructables.com/F58/XJ7E/JF34756S/F58XJ7EJF34756S.LARGE.jpg", "https://cdn.instructables.com/FWH/41O0/JF34757U/FWH41O0JF34757U.LARGE.jpg", "https://cdn.instructables.com/F9J/AWOW/JF34758W/F9JAWOWJF34758W.LARGE.jpg", "https://cdn.instructables.com/F4F/C520/JF3475AF/F4FC520JF3475AF.LARGE.jpg", "https://cdn.instructables.com/F7G/PNY3/JF3475BZ/F7GPNY3JF3475BZ.LARGE.jpg"], "step_title": "Step 1: Mark Out Your Peg Holes on the Baseplate"}, {"step": 2, "steps_text": "Now you're at the point where you can drill into the baseplate. To begin with, you can remove the frame and the rules and store them away - their work here is done.\n\nClamp the baseplate down to a table like in the Picture 1. When it's secure, drill the dimples out with a 3/8\" drill bit, like in Picture 2. You should be able to use a hand-drill to do this - I did. Picture 3 shows the final baseplate.\n\nUsing a drill press is also an option. However, if you do this you must be totally sure that the baseplate is secure and that if it were to come loose the movement of the drill press wouldn't cause it to hit you, because that hurts.", "step_imgs": ["https://cdn.instructables.com/FAB/PR87/JF3487WO/FABPR87JF3487WO.LARGE.jpg", "https://cdn.instructables.com/F90/Q26S/JF348823/F90Q26SJF348823.LARGE.jpg", "https://cdn.instructables.com/F0B/AEV6/JF34887H/F0BAEV6JF34887H.LARGE.jpg"], "step_title": "Step 2: Drill Out Your Holes"}, {"step": 3, "steps_text": "Grand! Now that the Trellis has its holes in it you can move on to working with the steel.\n\nThe first thing you want to do is draw your piece of steel bar out to a point, as shown in Picture 1. There are two ways that you could do this.\n\nThe first is through drawing it out (also known as forging a taper). Drawing out is one of the most basic techniques in blacksmithing, and it is simple enough to understand and do, but not simple to explain in writing, at least not for me. Rather than reading my confusing explanation, I would reccomend watching one of several wonderful tutorials on this available on Youtube. The following video is just one of many.\n\nYou don't have to have an anvil to do this either - a flat steel surface is all you need. You could use a piece of railroad track, a section of I-beam, a sledgehammer head fixed into a lump of concrete, or even a simple piece of steel block bought from a junkyard. Pictures 2-5 are all examples of makeshift anvils. Maximillian The Ruthless has a pretty great Instructable on makeshift anvils as well (https://www.instructables.com/id/Improvised-Anvils/).\nIf you prefer not to forge out a taper, you could try the second option. This is using an angle grinder or a file to make your point. To do this, you would simply fix your bar in a vise and shape it with your tool.\n\nEither way you form your point, make sure to round out all of the sharp angles when you're finished up. From the point where the bar begins to narrow to the tip it should be rounded. Everything before the point where it begins to narrow should be square.", "step_imgs": ["https://cdn.instructables.com/FQH/LJVH/JF347716/FQHLJVHJF347716.LARGE.jpg", "https://cdn.instructables.com/FYM/XDOZ/JF3478AG/FYMXDOZJF3478AG.LARGE.jpg", "https://cdn.instructables.com/FOA/EBCW/JF3478AH/FOAEBCWJF3478AH.LARGE.jpg", "https://cdn.instructables.com/FOS/EKJU/JF3478AI/FOSEKJUJF3478AI.LARGE.jpg", "https://cdn.instructables.com/F1Z/9WKJ/JF3478AJ/F1Z9WKJJF3478AJ.LARGE.jpg"], "step_title": "Step 3: Drawing Out Your Steel to a Point"}, {"step": 4, "steps_text": "The first bend you create is going to end up being the ornamental curl on the end of the hook (Picture 1). Start by securely clamping the Trellis down onto a table as in Step 2.\n\nTo make this bend put two pegs into the holes at 2.3/B13 and 2.3/B14. There will be a small gap in between them. (Pictures 2 and 3).\n\nNow heat up the tapered end of the steel bar until it's a bright orange color and place the tip of it into that gap (Picture 4). You'll be able to bend it into a curve quite simply and with little effort (Picture 5). Because the tapered end is thinner than the rest of the bar it will cool down faster, so take more than one heat to do this if you need to. You'll know that the bar needs to be reheated when it is only glowing a dull red (Picture 6).\n\nYou should end up with a curve like the one shown in Picture 6.", "step_imgs": ["https://cdn.instructables.com/F9S/SRFQ/JF348Q6I/F9SSRFQJF348Q6I.LARGE.jpg", "https://cdn.instructables.com/FP2/RTGB/JF3478UM/FP2RTGBJF3478UM.LARGE.jpg", "https://cdn.instructables.com/FRS/JPP6/JF3478UN/FRSJPP6JF3478UN.LARGE.jpg", "https://cdn.instructables.com/FVQ/1NZL/JF3478UO/FVQ1NZLJF3478UO.LARGE.jpg", "https://cdn.instructables.com/FIZ/V74V/JF2SVZYB/FIZV74VJF2SVZYB.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F9F/5WAH/JF3478UP/F9F5WAHJF3478UP.LARGE.jpg", "https://cdn.instructables.com/FJO/53FS/JF3478V1/FJO53FSJF3478V1.LARGE.jpg"], "step_title": "Step 4: Create Your First Bend"}, {"step": 5, "steps_text": "Next, you're going to use that bend you just made to help you to make the crook of the hook (Picture 1). But before you do that you need to shift the pegs around and add a disk.\n\nRemove the pegs from 2.3/B13 and 2.3/B14. Place pegs into 1.6/A11, 1.9/A6, and 1.10/A8. Also place a 5cm or 2\" disk onto the peg in 1.10/A8 (Picture 2). Reheat the tapered end of your steel bar, and ensure that about 20cm or 8\" of the bar behind the curve is also heated to a bright orange (Picture 3).\n\nNow quench the curved tip of your bar, but only just the tip (Picture 4). You want the curve to be cold and unyielding while the rest of the bar stays plastic. Hook the cooled tip onto the peg in 1.9/A6 and bend the steel bar around the disc in 1.10/A8 (Picture 5). Allow the peg in 1.6/A11 to stop the bend (Picture 6).", "step_imgs": ["https://cdn.instructables.com/FDC/FO5T/JF348QBC/FDCFO5TJF348QBC.LARGE.jpg", "https://cdn.instructables.com/FB3/FO93/JF3479JV/FB3FO93JF3479JV.LARGE.jpg", "https://cdn.instructables.com/FEI/S7YV/JF3479JW/FEIS7YVJF3479JW.LARGE.jpg", "https://cdn.instructables.com/FTM/ZH6B/JF348TWD/FTMZH6BJF348TWD.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FH8/AZLD/JF2SW2T2/FH8AZLDJF2SW2T2.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F79/BH77/JF3479JX/F79BH77JF3479JX.LARGE.jpg"], "step_title": "Step 5: Create the Crook"}, {"step": 6, "steps_text": "Now you'll be making the eye of the hook (Picture 1). This is the part that you'll use to fix it onto a wall.\n\nStick your bar back into your forge. This time you want to heat up the area that rests alongside the pin in 1.6/A11. If you need to, quench the crook but keep the rest hot, and fix it onto the disk as shown in Picture 2.\n\nThis is probably the trickiest part of the process. You need to wrap the steel bar around the pin in 1.6/A11 (Pictures 3). It may help to make this pin somewhat taller than the other ones.\n\nYou should end up with a bar shaped somewhat like the various examples in Pictures 4-7.", "step_imgs": ["https://cdn.instructables.com/FJX/IAV4/JF348QNU/FJXIAV4JF348QNU.LARGE.jpg", "https://cdn.instructables.com/FL7/6L1B/JF348U7A/FL76L1BJF348U7A.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FUN/G9Y6/JF347A0X/FUNG9Y6JF347A0X.LARGE.jpg", "https://cdn.instructables.com/FDA/SY9H/JF2SW4I0/FDASY9HJF2SW4I0.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FKQ/WPDL/JF347A0Y/FKQWPDLJF347A0Y.LARGE.jpg", "https://cdn.instructables.com/F3H/TJYH/JF347A0Z/F3HTJYHJF347A0Z.LARGE.jpg", "https://cdn.instructables.com/F9Y/CU98/JF347A10/F9YCU98JF347A10.LARGE.jpg", "https://cdn.instructables.com/FIG/GLZO/JF347A11/FIGGLZOJF347A11.LARGE.jpg"], "step_title": "Step 6: Create the Eye"}, {"step": 7, "steps_text": "In this step you'll be removing extra material. This can be a bit geometrically tricky the first time you do it so make sure to pay close attention to what you're cutting. Once you've done it one time it becomes much easier.\n\nClamp your piece of rod into a vise. I find that the manner shown in Picture 1 is the most appropriate.\n\nPictures 2 and 3 show where to put your hacksaw when cutting off excess material.\n\nHacksawing can be strange at first, so if this is your first time using one I'd recommend watching this video:\n\nOnce you've removed the extra metal and set it aside for another project later, you can take your hook out of the vise. It should look something like what is shown in Pictures 4 and 5.", "step_imgs": ["https://cdn.instructables.com/FEW/0I8P/JF347AZF/FEW0I8PJF347AZF.LARGE.jpg", "https://cdn.instructables.com/FPH/VX1Q/JF347AZG/FPHVX1QJF347AZG.LARGE.jpg", "https://cdn.instructables.com/F9R/C2G5/JF347AZH/F9RC2G5JF347AZH.LARGE.jpg", "https://cdn.instructables.com/F08/AVS6/JF347AZJ/F08AVS6JF347AZJ.LARGE.jpg", "https://cdn.instructables.com/FFA/7EL6/JF347AZK/FFA7EL6JF347AZK.LARGE.jpg"], "step_title": "Step 7: Cut Off Any Excess Metal"}, {"step": 8, "steps_text": "You'll have noticed that the eye is not quite lined up properly with the body of the hook. It's off the the side a bit, and the end of the steel is not quite touching the body (Picture 1). We want to close up that gap.\n\nFirst, heat up the eye in your forge. Once it's a nice orange colour take it out and flatten the eye so that it's level with the body of the hook. Then hammer closed any gap (Picture 2).\n\nNow heat up the whole hook. This is a good time to straighten out it out if it needs it. This is simple enough to do with the hammer and your steel block. You can even squish it straight by closing it into the vise while it's hot and squeezing it.\n\nNow that your hook is straight, heat up the eye and a little bit of the body behind it to a good deep red colour . Once it's hot, place the eye onto the pin in 1.9/A6. Fix your tongs or visegrips onto the body of the hook, and pull it against the disk in 1.10/A8 until it looks fairly true to the body, and it looks like it wouldn't swing off-centre if you were to hang it on the wall (Picture 3). Pictures 4-5 show the hook before and after bending the eye true.", "step_imgs": ["https://cdn.instructables.com/F9E/N461/JF347EUR/F9EN461JF347EUR.LARGE.jpg", "https://cdn.instructables.com/FOH/SR77/JF2SWI27/FOHSR77JF2SWI27.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F8U/55V5/JF2SWI5F/F8U55V5JF2SWI5F.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F6B/FSS7/JF347EUS/F6BFSS7JF347EUS.LARGE.jpg", "https://cdn.instructables.com/FKH/J00M/JF347EUU/FKHJ00MJF347EUU.LARGE.jpg"], "step_title": "Step 8: True the Eye Up"}, {"step": 9, "steps_text": "Ok, almost done! In this step you're going to be giving the tapered tip a more elegant appearance (Picture 1-2).\n\nThe process here is very simple. Heat up the tapered end a bit (Picture 3). Once it's an orange colour quench the crook but not the taper (Picture 4). Quenching the crook will remove the flexibility that comes with heat, ensuring that the crook won't deform as you tap the taper into a more elegant shape.\n\nHold your hammer very close to the head (Picture 4). As a general rule, the closer your hand is to the hammerhead the more control you'll have over where your blow lands, and during this step control is very important.\n\nAs you tap the taper with the hammer, a more aesthetic curl should begin to form. Lean into the direction that the taper was already curling and you should be able to get a nice shape with few problems (Picture 5). Alternatively, you could use a pair of needle nose pliers to make the curve more manually.", "step_imgs": ["https://cdn.instructables.com/F9K/L8BB/JF347SMP/F9KL8BBJF347SMP.LARGE.jpg", "https://cdn.instructables.com/FVQ/1C6J/JF347T2P/FVQ1C6JJF347T2P.LARGE.jpg", "https://cdn.instructables.com/FYY/B6O1/JF347SSY/FYYB6O1JF347SSY.LARGE.jpg", "https://cdn.instructables.com/FMB/K65M/JF347XTL/FMBK65MJF347XTL.LARGE.jpg", "https://cdn.instructables.com/FQY/BKRC/JF2SWIEI/FQYBKRCJF2SWIEI.ANIMATED.LARGE.gif"], "step_title": "Step 9: Twirl the Curl"}, {"step": 10, "steps_text": "Alright, this is the last step before cleaning everything up!\n\nFirst adjust two pairs of vicegrips so that they will easily grasp onto the eye of your hook, and set them down next to your vice. Then heat up the body of your hook to an ruddy-orange colour. When you take it out of the forge, quench the eye until it is hard and dark coloured again. This ensures that when you clamp your visegrips down onto it you won't make any marks on with the teeth.\n\nClamp your heated hook into the vise, and clamp the visegrips onto opposite sides of the eye (Picture 1). You're essentially using the visegrips to create a crank. Once they're clamped down, use them to make a twist in the body of the hook (Picture 2). Twist until it looks good to you and the eye is turned so that it will sit nicely on the wall (Picture 3).", "step_imgs": ["https://cdn.instructables.com/FDI/8KC0/JF347ZAH/FDI8KC0JF347ZAH.LARGE.jpg", "https://cdn.instructables.com/FCJ/64VS/JF2SWIJP/FCJ64VSJF2SWIJP.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F5S/C5WE/JF347ZFD/F5SC5WEJF347ZFD.LARGE.jpg"], "step_title": "Step 10: Make the Twist"}, {"step": 11, "steps_text": "And now you're done! The last thing to do is clean up the hook using a wire brush.\n\nIf you like, you can also heat it up in the forge until it is warm but not glowing and paint some beeswax onto it. The wax will turn the piece black (whenever you see steel that's been painted black, this is the look that they're trying to copy) while rustproofing it at the same time. Just make sure that you do this in a well-ventilated area, as the beeswax tends to smoke up.\n\nAt this point, you should have a grand hook, and the next one you make will be that much better.\nIf there are any improvements that I can make to this Instructable, please let me know in the comments!", "step_imgs": ["https://cdn.instructables.com/F4Q/QMSK/JFCT1PVU/F4QQMSKJFCT1PVU.LARGE.jpg", "https://cdn.instructables.com/FYN/7G72/JFCT1PWL/FYN7G72JFCT1PWL.LARGE.jpg"], "step_title": "Step 11: Cleaning It Up"}], "channel": "Metalworking"}, {"category": "Workshop", "description": "A great little project to make some tiny branding irons out of wire nails...", "title": "Branding Nails", "url": "https://www.instructables.com/id/Branding-Nails/", "steps": [{"step": 1, "steps_text": "MATERIALS\nWire nails - I used 125mm wire nails that have a head of about 10mm diameter\nBlock of wood - for the handle\nSticky backed vinyl sheet\nPropane gas\nTOOLS\nEtching tool - you will need to make your own, easy to do\nSalt water solution\nHammer\nFile\nSharp knife\nRotary tool + grinding wheel", "step_imgs": ["https://cdn.instructables.com/F9V/YSSB/JF34ALTM/F9VYSSBJF34ALTM.LARGE.jpg"], "step_title": "Step 1: Get Your Bits Together"}, {"step": 2, "steps_text": "Hammer the nail into the end of a block of wood...\n...this will make it easy to hold the nail to work on the end", "step_imgs": ["https://cdn.instructables.com/FY0/IEST/JF34ALU7/FY0IESTJF34ALU7.LARGE.jpg"], "step_title": "Step 2: Hammer"}, {"step": 3, "steps_text": "File the nail head flat ready for etching", "step_imgs": ["https://cdn.instructables.com/F7X/RTGB/JF34ALUP/F7XRTGBJF34ALUP.LARGE.jpg"], "step_title": "Step 3: File"}, {"step": 4, "steps_text": "Cut out your design from a sheet of sticky backed vinyl...it will be tiny!\nRemember to reverse the design especially for text and logos...as with all printing it has to be reversed so it will be the correct way when burnt into the wood\nFirmly stick the stencil to the nail head", "step_imgs": ["https://cdn.instructables.com/FJC/XIHU/JF34ALUW/FJCXIHUJF34ALUW.LARGE.jpg", "https://cdn.instructables.com/FIB/DDTV/JF34AMBM/FIBDDTVJF34AMBM.LARGE.jpg"], "step_title": "Step 4: Stencil"}, {"step": 5, "steps_text": "You will need to make an etching tool...check out my Metal Etching video or have a look at Laserage's Instructable on how to etch with a battery.\nAttach the etching tool\nPlug in the transformer\nPour out some salt water solution...\n...and dip the cotton wall on the end of the etching nail into the solution.\nPress the tool onto the end of the nail head and hear it sizzle...etching is taking place.\nFumes are produced...PLEASE make sure you undertake this in a SAFE well ventilated place and do not breath in the fumes.", "step_imgs": ["https://cdn.instructables.com/FRI/8NCN/JF34AMBN/FRI8NCNJF34AMBN.LARGE.jpg", "https://cdn.instructables.com/FGZ/8PWW/JF34AMB1/FGZ8PWWJF34AMB1.LARGE.jpg", "https://cdn.instructables.com/FLG/SDDD/JF34AMBA/FLGSDDDJF34AMBA.LARGE.jpg", "https://cdn.instructables.com/FQ0/8X21/JF34AMBC/FQ08X21JF34AMBC.LARGE.jpg", "https://cdn.instructables.com/F0T/DM2W/JF34AMBD/F0TDM2WJF34AMBD.LARGE.jpg", "https://cdn.instructables.com/F61/FMYT/JF34AMBE/F61FMYTJF34AMBE.LARGE.jpg", "https://cdn.instructables.com/FRQ/BPZH/JF34AMBF/FRQBPZHJF34AMBF.LARGE.jpg"], "step_title": "Step 5: Etch"}, {"step": 6, "steps_text": "It will take around ten minutes to produce a good deep etch and a nicely defined edge to your stencil.\nA crud will have formed on the end...scrape away with a knife to reveal your design", "step_imgs": ["https://cdn.instructables.com/FUH/PC7N/JF34AMBG/FUHPC7NJF34AMBG.LARGE.jpg", "https://cdn.instructables.com/FTX/98CE/JF34AMBL/FTX98CEJF34AMBL.LARGE.jpg"], "step_title": "Step 6: Clean Up"}, {"step": 7, "steps_text": "Cut away the excess metal around your design...\n...this is too enable the brand to be as clean as possible without metal to the side scorching around the brand.\nTake it slowly with a steady hand so the etched edge isn't nicked by the grinding wheel.\nA rotary tool and small grinding/cut off wheel works really well...a hand file should do the job as well.", "step_imgs": ["https://cdn.instructables.com/FVM/GPS3/JF34AMX1/FVMGPS3JF34AMX1.LARGE.jpg", "https://cdn.instructables.com/F3N/T7S3/JF34AMWZ/F3NT7S3JF34AMWZ.LARGE.jpg", "https://cdn.instructables.com/F75/HQXM/JF34AMX0/F75HQXMJF34AMX0.LARGE.jpg"], "step_title": "Step 7: Grind"}, {"step": 8, "steps_text": "Cut the wooden block to a convenient length as a handle...\n...plane...cut...sand to a nice finish that feels good in your hand.", "step_imgs": ["https://cdn.instructables.com/FFF/OH77/JF34AN5T/FFFOH77JF34AN5T.LARGE.jpg", "https://cdn.instructables.com/F2E/IZC4/JF34AN5L/F2EIZC4JF34AN5L.LARGE.jpg", "https://cdn.instructables.com/FUR/NXHK/JF34AN5R/FURNXHKJF34AN5R.LARGE.jpg", "https://cdn.instructables.com/F8B/IHIJ/JF34AN5S/F8BIHIJJF34AN5S.LARGE.jpg"], "step_title": "Step 8: Handle"}, {"step": 9, "steps_text": "All ready to brand some timber...\nHeat the end of the branding nail with a propane torch.\nIt will take a little practice to work out how hot you will need it...grab a scrap piece of wood and do some practice runs.\nPlace on the timber for a couple seconds...\n...pull away...\n...NICE!", "step_imgs": ["https://cdn.instructables.com/FBI/75AL/JF34ANDM/FBI75ALJF34ANDM.LARGE.jpg", "https://cdn.instructables.com/FYW/EVNQ/JF34ANL4/FYWEVNQJF34ANL4.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FM7/ZLL3/JF34ANL5/FM7ZLL3JF34ANL5.ANIMATED.LARGE.gif"], "step_title": "Step 9: Burn"}, {"step": 10, "steps_text": "Why not brand your own branding nail!\nIt makes sense so that you can easily see the design of the tool...especially that you will want to make lots of them.\nRemove the nail from the wood...\nHeat up the nail head as before...watch those fingers as you do not now have a nice timber handle to insulate from the heat!\nBrand the handle...\n...Carefully tap the nail back into the handle.", "step_imgs": ["https://cdn.instructables.com/F3Z/PVON/JF34ANLM/F3ZPVONJF34ANLM.ANIMATED.LARGE.gif"], "step_title": "Step 10: Brand Your Branding Nail!"}, {"step": 11, "steps_text": "", "step_imgs": ["https://cdn.instructables.com/F7L/L0AL/JF34ANDQ/F7LL0ALJF34ANDQ.LARGE.jpg", "https://cdn.instructables.com/FG5/EWNJ/JF34ANDT/FG5EWNJJF34ANDT.LARGE.jpg", "https://cdn.instructables.com/FKT/5RB8/JF34ANDU/FKT5RB8JF34ANDU.LARGE.jpg", "https://cdn.instructables.com/FOV/ORYS/JF34ANEA/FOVORYSJF34ANEA.LARGE.jpg"], "step_title": "Step 11: Looking Good!"}, {"step": 12, "steps_text": "These are super useful and so small...perfect for branding little things!\nI am entering this project into the Pocket Sized Contest as they are pocket sized! and if you have enjoyed this project, I would really appreciate your vote...thank you so much.\nThis project is part of my YouTube channel where I try to make cool and interesting projects.\nPlease check out my channel if you want to see more of the projects, if not there will be more coming to Instructables soon.\nWhy not check out what I am up to on Facebook.", "step_imgs": ["https://cdn.instructables.com/FCW/5TIJ/JF34ANL6/FCW5TIJJF34ANL6.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F7X/05KH/JF34ANDP/F7X05KHJF34ANDP.LARGE.jpg", "https://cdn.instructables.com/FG3/LG69/JF34ANDV/FG3LG69JF34ANDV.LARGE.jpg"], "step_title": "Step 12: ENJOY!"}], "channel": "Tools"}, {"category": "Workshop", "description": "I was tired of having a pile of shoes near my entryway, nowhere to sit when I put them on, and coats strewn all about my house. So I designed and made this piece, which I believe is called a \"hall tree\" in some parts. It's a bench with a shoe rack underneath and a coat rack up above.", "title": "Shoe Rack / Coat Rack / Bench Combo (Hall Tree)", "url": "https://www.instructables.com/id/Shoe-Rack-Coat-Rack-Bench-Combo-Hall-Tree/", "steps": [{"step": 1, "steps_text": "I started by cutting the very top cross-piece for the coat rack part. I used 1\" square steel tubing and cut the cross piece to 33\". The sides of the coat rack part are 72\" high. They came 72\" so they did not need to be cut. I'm using a handheld metal-cutting bandsaw here.", "step_imgs": ["https://cdn.instructables.com/FE6/RENG/JF348Z9I/FE6RENGJF348Z9I.LARGE.jpg"], "step_title": "Step 1:"}, {"step": 2, "steps_text": "Instead of cutting 45-degree miters for the joint, I notched out 1\" from the 33\" cross piece. That way I didn't have to cut the 72\" high pieces at all-- they just slid into place.", "step_imgs": ["https://cdn.instructables.com/F7X/CLSO/JF348ZAN/F7XCLSOJF348ZAN.LARGE.jpg"], "step_title": "Step 2:"}, {"step": 3, "steps_text": "In case the perspective is disorienting, here are the pieces I'm talking about.", "step_imgs": ["https://cdn.instructables.com/FP2/Q36E/JF348ZCP/FP2Q36EJF348ZCP.LARGE.jpg"], "step_title": "Step 3:"}, {"step": 4, "steps_text": "It's imperative to frequently check for square when welding... especially when it's very thin gauge steel. This square tubing is only 1/16\" thick, so it wants to bend and warp like crazy once it gets hot from welding.", "step_imgs": ["https://cdn.instructables.com/FMD/9IFN/JF348ZFM/FMD9IFNJF348ZFM.LARGE.jpg"], "step_title": "Step 4:"}, {"step": 5, "steps_text": "Once I have the corner at a nice 90-degree angle, I lock it into place with once of these welding magnets and tack it with the MIG gun. These are the top two corners in the 3D model image from before.", "step_imgs": ["https://cdn.instructables.com/FNH/3KH7/JF348ZHN/FNH3KH7JF348ZHN.LARGE.jpg"], "step_title": "Step 5:"}, {"step": 6, "steps_text": "I cut another piece at 31\" inches so that it will fit inside the two 72\" high pieces. This will be the back of the bench and act as another cross-brace for the tall coat rack.", "step_imgs": ["https://cdn.instructables.com/FCJ/MFWO/JF348ZJE/FCJMFWOJF348ZJE.LARGE.jpg"], "step_title": "Step 6:"}, {"step": 7, "steps_text": "I clamped the 31\" long cross brace in place and got it nice and square...", "step_imgs": ["https://cdn.instructables.com/F1E/ZM6U/JF348ZKL/F1EZM6UJF348ZKL.LARGE.jpg"], "step_title": "Step 7:"}, {"step": 8, "steps_text": "...then I tacked it in place in the front and the back of both sides.", "step_imgs": ["https://cdn.instructables.com/FS5/KF2I/JF348ZKW/FS5KF2IJF348ZKW.LARGE.jpg"], "step_title": "Step 8:"}, {"step": 9, "steps_text": "In the process of welding the 31\" cross-brace.", "step_imgs": ["https://cdn.instructables.com/F2Q/DZ6R/JF348ZM2/F2QDZ6RJF348ZM2.LARGE.jpg"], "step_title": "Step 9:"}, {"step": 10, "steps_text": "I then used that 31\" back cross-brace to reference and mark the length of another piece of tubing. This piece will be the front of the bench. It's important that this front piece is exactly the same length as the back piece, otherwise the bench will not have square 90-degree angles (it would be more of a trapezoid than a rectangle).", "step_imgs": ["https://cdn.instructables.com/F2Y/43V3/JF348ZPK/F2Y43V3JF348ZPK.LARGE.jpg"], "step_title": "Step 10:"}, {"step": 11, "steps_text": "After marking the correct length, I made the cut with the handheld bandsaw. I also cut two pieces to 16\". These will be the two front legs.", "step_imgs": ["https://cdn.instructables.com/FJZ/9UB0/JF348ZSG/FJZ9UB0JF348ZSG.LARGE.jpg"], "step_title": "Step 11:"}, {"step": 12, "steps_text": "Again, constantly making sure everything is square. This picture is showing one of the front legs and the front cross piece (see next image).", "step_imgs": ["https://cdn.instructables.com/FBM/PGDC/JF348ZUH/FBMPGDCJF348ZUH.LARGE.jpg"], "step_title": "Step 12:"}, {"step": 13, "steps_text": "Here's what we're looking at-- the joining of the 16\" legs to the 31\" front cross-brace.", "step_imgs": ["https://cdn.instructables.com/FG6/4BS2/JF348ZVD/FG64BS2JF348ZVD.LARGE.jpg"], "step_title": "Step 13:"}, {"step": 14, "steps_text": "Welding each leg to the front cross-brace.", "step_imgs": ["https://cdn.instructables.com/FPF/TXAA/JF348ZXF/FPFTXAAJF348ZXF.LARGE.jpg"], "step_title": "Step 14:"}, {"step": 15, "steps_text": "I used 1\" angle iron for the top sides of the bench. This is so I could easily attach the wood bench top with brackets without the brackets showing (more on that later). These pieces are 13\" long.", "step_imgs": ["https://cdn.instructables.com/FDT/AF5B/JF349021/FDTAF5BJF349021.LARGE.jpg"], "step_title": "Step 15:"}, {"step": 16, "steps_text": "I used an angle grinder to grind down the welds that connect the legs to the front cross-brace. This was so I'd have a nice flat surface to weld the angle iron to.", "step_imgs": ["https://cdn.instructables.com/FGG/Z993/JF34905S/FGGZ993JF34905S.LARGE.jpg"], "step_title": "Step 16:"}, {"step": 17, "steps_text": "I used a welding magnet again to keep everything square and welded the angle iron pieces to the front piece of the bench.", "step_imgs": ["https://cdn.instructables.com/FE7/CXCL/JF34908O/FE7CXCLJF34908O.LARGE.jpg"], "step_title": "Step 17:"}, {"step": 18, "steps_text": "This picture provides a better perspective. The structure is lying on its back. I'm welding one of the angle iron pieces into place to connect the front of the bench to the back/coat rack part.", "step_imgs": ["https://cdn.instructables.com/FX7/BV2U/JF3490DV/FX7BV2UJF3490DV.LARGE.jpg"], "step_title": "Step 18:"}, {"step": 19, "steps_text": "I cut two pieces of 1\" flat bar to 14\" in length. These two pieces will be the sides of the shoe rack.", "step_imgs": ["https://cdn.instructables.com/F7U/H6KN/JF3490FW/F7UH6KNJF3490FW.LARGE.jpg"], "step_title": "Step 19:"}, {"step": 20, "steps_text": "I drilled out 6 evenly spaced holes in the flat bar. I used a regular bit to make some pilot holes, then a step bit to make each hole 3/8\".", "step_imgs": ["https://cdn.instructables.com/FDU/Z917/JF3490H2/FDUZ917JF3490H2.LARGE.jpg"], "step_title": "Step 20:"}, {"step": 21, "steps_text": "Checking to make sure that the steel rods fit through the holes. I'm using 6 3/8\" rods to make the shoe rack.", "step_imgs": ["https://cdn.instructables.com/FPZ/TBY7/JF3490JY/FPZTBY7JF3490JY.LARGE.jpg"], "step_title": "Step 21:"}, {"step": 22, "steps_text": "I clamped some 5\" spacers to the legs to make sure that the shoe rack side pieces where the exactly level.", "step_imgs": ["https://cdn.instructables.com/FXI/9ZBC/JF3490LP/FXI9ZBCJF3490LP.LARGE.jpg"], "step_title": "Step 22:"}, {"step": 23, "steps_text": "Then I ran the 3/8\" rods through the holes and in to place.", "step_imgs": ["https://cdn.instructables.com/FPX/E1EE/JF3490NQ/FPXE1EEJF3490NQ.LARGE.jpg"], "step_title": "Step 23:"}, {"step": 24, "steps_text": "I used a cutoff wheel in the angle grinder to cut the rods off flush with the side pieces.", "step_imgs": ["https://cdn.instructables.com/FH6/HQ7H/JF3490PR/FH6HQ7HJF3490PR.LARGE.jpg"], "step_title": "Step 24:"}, {"step": 25, "steps_text": "After through-welding the rods in place, I used a flap disc in the angle grinder to grind then flush with the side pieces.", "step_imgs": ["https://cdn.instructables.com/FIB/Z605/JF3490RU/FIBZ605JF3490RU.LARGE.jpg"], "step_title": "Step 25:"}, {"step": 26, "steps_text": "I figured the bench could use a support piece in the middle, so I cut one down to length and welded it into place.", "step_imgs": ["https://cdn.instructables.com/F6Q/AYG2/JF3490TL/F6QAYG2JF3490TL.LARGE.jpg"], "step_title": "Step 26:"}, {"step": 27, "steps_text": "I used the remaining 1\" flat bar cutoffs to make some brackets to attach the coat rack wood to. These are 3/8\" holes again. I drilled 4 holes, then cut the piece in half to give me 2 brackets that each had 2 holes in them.", "step_imgs": ["https://cdn.instructables.com/FFB/WTSC/JF3490VM/FFBWTSCJF3490VM.LARGE.jpg"], "step_title": "Step 27:"}, {"step": 28, "steps_text": "I welded the brackets in place 1\" down from the top of the coat rack. The brackets are each 4\" long.", "step_imgs": ["https://cdn.instructables.com/F61/OW4Z/JF3490VX/F61OW4ZJF3490VX.LARGE.jpg"], "step_title": "Step 28:"}, {"step": 29, "steps_text": "I marked and cut the wood for the coat rack using a miter saw.", "step_imgs": ["https://cdn.instructables.com/FMM/MYES/JF3490W8/FMMMYESJF3490W8.LARGE.jpg"], "step_title": "Step 29:"}, {"step": 30, "steps_text": "Nice fit, right? I slowly crept up on the cut, checking each time to see if it was the fit I wanted.", "step_imgs": ["https://cdn.instructables.com/FK4/7AM5/JF3490X4/FK47AM5JF3490X4.LARGE.jpg"], "step_title": "Step 30:"}, {"step": 31, "steps_text": "I bought 5 of these hanger things from Home Depot. I marked, with even spacing, where I wanted each to be mounted.", "step_imgs": ["https://cdn.instructables.com/FNJ/ZRWD/JF3490YK/FNJZRWDJF3490YK.LARGE.jpg"], "step_title": "Step 31:"}, {"step": 32, "steps_text": "Then I drilled some holes for the mounting brackets.", "step_imgs": ["https://cdn.instructables.com/FAJ/YACX/JF3490ZQ/FAJYACXJF3490ZQ.LARGE.jpg"], "step_title": "Step 32:"}, {"step": 33, "steps_text": "I also drilled pilot holes in the back of the board to where it will mount to the brackets on the steel frame.", "step_imgs": ["https://cdn.instructables.com/F4Y/FHGD/JF349101/F4YFHGDJF349101.LARGE.jpg"], "step_title": "Step 33:"}, {"step": 34, "steps_text": "The wooden seat of the bench need to be 14\" deep. I had some boards of walnut that were 3/4\" thick and 5.5\" wide, so I ripped one down to 3\". 2 5.5\" boards plus the 3\" board will give me a depth of 14\".", "step_imgs": ["https://cdn.instructables.com/FIV/KSH1/JF349102/FIVKSH1JF349102.LARGE.jpg"], "step_title": "Step 34:"}, {"step": 35, "steps_text": "I glued up the board using pipe clamps and yellow wood glue. Make sure you follow the instructions for dry-time on the glue bottle.", "step_imgs": ["https://cdn.instructables.com/F5U/8P5F/JF34910E/F5U8P5FJF34910E.LARGE.jpg"], "step_title": "Step 35:"}, {"step": 36, "steps_text": "I sanded all the wooden pieces with 80, 150, 220, and 320 grit sandpaper on an orbital sander. You don't have to go all the way up to 320, but I think it makes a big tactile difference in the wood.", "step_imgs": ["https://cdn.instructables.com/F2C/1HF0/JF34910P/F2C1HF0JF34910P.LARGE.jpg"], "step_title": "Step 36:"}, {"step": 37, "steps_text": "I just used simple wipe-on polyurethane to finish the walnut. It dries fast, and it looks great.", "step_imgs": ["https://cdn.instructables.com/FV2/9GOE/JF349111/FV29GOEJF349111.LARGE.jpg"], "step_title": "Step 37:"}, {"step": 38, "steps_text": "For the steel, I painted it flat black with Rustoleum spray paint. I ended up doing 3 coats total.", "step_imgs": ["https://cdn.instructables.com/F0H/QP57/JF34911C/F0HQP57JF34911C.LARGE.jpg"], "step_title": "Step 38:"}, {"step": 39, "steps_text": "To account for wood movement, you don't want to attach the bench seat directly to the steel. That won't allow the wood to expand and contract as it absorbs/dissipates moisture from the air. I use these brackets meant for screen doors in situations like this. They'll just slide slightly back and forth as the wood moves, but they keep the wood solidly attached to the steel frame. You can find these brackets with all the other screen door hardware at Home Depot, Lowe's, etc.", "step_imgs": ["https://cdn.instructables.com/FMR/URNX/JF34911F/FMRURNXJF34911F.LARGE.jpg"], "step_title": "Step 39:"}, {"step": 40, "steps_text": "The coat hanger hooks simply slide onto the brackets. It took a little fiddling to get them tight enough to have a good friction fit, but loose enough that I could actually slide them on.", "step_imgs": ["https://cdn.instructables.com/FL2/395W/JF34911R/FL2395WJF34911R.LARGE.jpg"], "step_title": "Step 40:"}, {"step": 41, "steps_text": "To account for wood movement in the coat rack, I used a washer and a screw that was smaller than the hole in the bracket. This lets the screw move around as it needs to, but still provides enough friction to keep the wood tightly secured to the steel frame.", "step_imgs": ["https://cdn.instructables.com/FJH/GC5O/JF349122/FJHGC5OJF349122.LARGE.jpg"], "step_title": "Step 41:"}, {"step": 42, "steps_text": "Last step... attaching wooden part of the coat rack through the brackets in the back.", "step_imgs": ["https://cdn.instructables.com/FP6/J5GE/JF34912G/FP6J5GEJF34912G.LARGE.jpg"], "step_title": "Step 42:"}, {"step": 43, "steps_text": "Here's the finished product in the wild. I hope you've found this post useful... happy making!", "step_imgs": ["https://cdn.instructables.com/FLY/MNJB/JF34912S/FLYMNJBJF34912S.LARGE.jpg", "https://cdn.instructables.com/FCZ/YAVO/JF34912H/FCZYAVOJF34912H.LARGE.jpg"], "step_title": "Step 43:"}], "channel": "Furniture"}, {"category": "Workshop", "description": "Expanding on the butterfly map projection I laser cut on plywood, I wanted to try a new media. Leather is a great material to laser cut because it is malleable but doesn't fray.\nI added sewing holes to the file I had created previously, and put it all together with some synthetic nylon cord.\nYou can download the file here, and try it out for yourself.", "title": "Laser Cut Leather Globe", "url": "https://www.instructables.com/id/Laser-Cut-Leather-Globe/", "steps": [{"step": 1, "steps_text": "Leather is great because it doesn't fray, so you can cut out all kinds of shapes. I know some people aren't comfortable using animal products, but please don't substitute PVC pleather for leather in a laser cutter - it is toxic!\nI ran this file out of illustrator and cut it on an epilogue laser cutter. Whatever machine you use, the controls will be a little bit different. You need a fairly high powered laser cutter to cut through leather, and you will need to try different settings with every kind of hide.", "step_imgs": ["https://cdn.instructables.com/FYV/M9CW/JF348UKA/FYVM9CWJF348UKA.LARGE.jpg"], "step_title": "Step 1: Laser Cut the Leather"}, {"step": 2, "steps_text": "I used a non-toxic leather dye and a small paintbrush to colour in the water and land. Without being too precious, I followed along the shorelines and tried to create a watercolour effect. Remember to test your colour and technique on a scrap of leather that matches your piece.\nI sealed the dye with a non-toxic sealant that leaves a matte finish. Buff the finish with a soft cloth.", "step_imgs": ["https://cdn.instructables.com/FLL/GMPJ/JF348UJY/FLLGMPJJF348UJY.LARGE.jpg", "https://cdn.instructables.com/F92/GKAV/JF348UJZ/F92GKAVJF348UJZ.LARGE.jpg", "https://cdn.instructables.com/FDZ/H95E/JF348UKW/FDZH95EJF348UKW.LARGE.jpg"], "step_title": "Step 2: Paint and Seal the Leather"}, {"step": 3, "steps_text": "I used a synthetic nylon cord with two needles sewing in an X pattern. I sewed one X on top, and then one X on the bottom, but if I were to do this again I would come back a second time and stitch on the top and the bottom.\nIt's pretty tricky to pull the material tightly enough to have the seam flush and strong - I sewing in really short portions of the seam so I could include more knots. Experiments!\nI couldn't find any stuffing, so I stuffed this with fabric scraps. The final output is admittedly pretty lumpy. It has been called endearingly lumpy.", "step_imgs": ["https://cdn.instructables.com/FY1/0YOP/JF348UKL/FY10YOPJF348UKL.LARGE.jpg", "https://cdn.instructables.com/FXL/8YUH/JF348UKX/FXL8YUHJF348UKX.LARGE.jpg"], "step_title": "Step 3: Sew the Globe"}, {"step": 4, "steps_text": "", "step_imgs": ["https://cdn.instructables.com/FV3/R9CM/JF348UJN/FV3R9CMJF348UJN.LARGE.jpg"], "step_title": "Step 4: Cuddle Your Globe!"}], "channel": "Laser Cutting"}, {"category": "Workshop", "description": "Life begins after coffee...\n...and then we can make a super funky table to enjoy our coffee with!\nThis coffee table is straight forward to make, with most of the major cuts made with a sliding mitre saw.\nI will guide you through the stages with a top tip on how to make the leg mortice + tennon joints super easily with the mitre saw...and with a little more sweat it can also be made by hand.\nFinish your coffee and lets get started...", "title": "Coffee Table", "url": "https://www.instructables.com/id/Coffee-Table-9/", "steps": [{"step": 1, "steps_text": "Why timber and metal?\nIt looks cool...and I have been very fortunate to try out the Evolution Power Tool sliding saw that can cut timber and metal...at the same time!\nDon't worry if you don't own one, as I will give tips on how to achieve as good results by hand or with other tools as we go along...", "step_imgs": ["https://cdn.instructables.com/FL4/4MWP/JF2SWHFB/FL44MWPJF2SWHFB.LARGE.jpg", "https://cdn.instructables.com/FS7/S8XM/JF2SWHHK/FS7S8XMJF2SWHHK.LARGE.jpg", "https://cdn.instructables.com/FZY/WAAC/JF2SWHGS/FZYWAACJF2SWHGS.LARGE.jpg"], "step_title": "Step 1: WHY"}, {"step": 2, "steps_text": "The coffee table that I made was 375mm deep x 860mm long and 355mm high.\nChange the size to what works for you.\nMATERIALS\nSelection of timber strips for the top 45mm wide x 30mm thick - I used 5no. Oak, 2no. Maple and 2no. Utile [the dark strips 30x30mm]\nLegs Maple 375mm long 50x50mm widest dimension\nShelf end Walnut 30x70mm 300mm long should do\nMetal channel 3x35x35mm 2no. 375mm long\n12mm Reinforcing bar [rebar] 9 no. 700mm long\nBiscuits\nPVA wood glue\nGorilla Glue - polyurethane glue sticks metal to wood!\nHardwax oil\nBriwax\nBlack spray paint\nTOOLS\nSliding mitre saw\nGeneral wood working tools\nGeneral metal working tools\nBiscuit jointer\nWire wheel attachment for small angle grinder\nBandsaw or circular saw\nSafety gear - goggles, mask, ear defenders", "step_imgs": ["https://cdn.instructables.com/FTI/R6EA/JF2SWJW8/FTIR6EAJF2SWJW8.LARGE.jpg", "https://cdn.instructables.com/F6M/07K0/JF2SWJXG/F6M07K0JF2SWJXG.LARGE.jpg"], "step_title": "Step 2: Get Your Bits Together"}, {"step": 3, "steps_text": "Okay this is super easy way to cut out the mortice [socket] of the mortice + tennon joint for the legs.\nThe legs are splayed by about 10deg...and the mortice requires to be at an angle to match.\nThe reason to laminate up the top in strips, as well as looking good, is to be able to cut the mortice with the mitre saw.\nSet the mitre saw to the 10deg and cut the Utile strip...cut again to the width of the tennon.\nSet out the distance to the leg at the other end of the strip and cut out the mortice block...remember to reverse the angle so that the legs will splay out away from each other.\nRepeat for the second strip of Utile.\nJump to step 11 if you want to see the magic of this easy to cut mortice...", "step_imgs": ["https://cdn.instructables.com/FXK/187R/JF2SYMYV/FXK187RJF2SYMYV.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FZC/4T6L/JF2SYN0N/FZC4T6LJF2SYN0N.LARGE.jpg"], "step_title": "Step 3: Easy to Cut Mortice - TOP TIP!"}, {"step": 4, "steps_text": "I like to use timber biscuits to strengthen the joints of timber tops and it helps in keeping the top lined up when glueing together.\nCut the biscuits if using...and glue in as you put the board together.\nMake sure that the leg mortice blocks are left UNGLUED...push the rest of the strip tight up to the blocks so that it is a snug fit.\nCramp the board together, leaving the blocks in place whilst the board cures.", "step_imgs": ["https://cdn.instructables.com/FN7/TD01/JF2SYN08/FN7TD01JF2SYN08.LARGE.jpg", "https://cdn.instructables.com/F97/RWXQ/JF2SYNBY/F97RWXQJF2SYNBY.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F6U/7VPT/JF2SYN0G/F6U7VPTJF2SYN0G.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F3D/XT3A/JF2SYPGZ/F3DXT3AJF2SYPGZ.ANIMATED.LARGE.gif"], "step_title": "Step 4: Glue the Top Together"}, {"step": 5, "steps_text": "Cut out the legs for the coffee table...\nThe legs are solid with a maximum width of 50mm all around at the shoulder of the leg [where it meets the underside of the table top]\nThe legs taper to 20mm all around at the bottom.\nCut the taper with a circular saw, bandsaw or by hand.\nMake a simple jig with off cuts from shaping the legs to hold the rough sawn leg in place.\nSharpen up your plane and make the legs nice and smooth.", "step_imgs": ["https://cdn.instructables.com/F1C/J5EA/JF2SYPHA/F1CJ5EAJF2SYPHA.LARGE.jpg", "https://cdn.instructables.com/FLT/29XG/JF2SYPH2/FLT29XGJF2SYPH2.LARGE.jpg", "https://cdn.instructables.com/F9H/06P5/JF2SYPH6/F9H06P5JF2SYPH6.LARGE.jpg", "https://cdn.instructables.com/FYB/QZZ7/JF2SYPH9/FYBQZZ7JF2SYPH9.LARGE.jpg"], "step_title": "Step 5: It's Got Legs..."}, {"step": 6, "steps_text": "Mark the position of the shoulders of the tennon on the legs, this will be the same angle as the mortice block cut.\nSet the angle on the mitre saw.\nPlace a square on the leg and and tilt the mitre saw to the square...now halve the angle and lock in place.\nBy halving the angle will make the shoulders sit square to the table top on both sides of the tennon.\nThis is now a compound cut...angles in two planes.\nBefore we cut the tennon lets trim the end of the leg...this compound cut will allow the leg to sit flat on the floor.", "step_imgs": ["https://cdn.instructables.com/FQO/TLC6/JF2SYPQV/FQOTLC6JF2SYPQV.LARGE.jpg", "https://cdn.instructables.com/FRV/R94K/JF2SYPQW/FRVR94KJF2SYPQW.LARGE.jpg", "https://cdn.instructables.com/F8H/B02N/JF2SYPQQ/F8HB02NJF2SYPQQ.LARGE.jpg", "https://cdn.instructables.com/FIQ/HZWU/JF2SYPQR/FIQHZWUJF2SYPQR.LARGE.jpg", "https://cdn.instructables.com/FB3/BCAX/JF2SYPQT/FB3BCAXJF2SYPQT.LARGE.jpg"], "step_title": "Step 6: Cut the Tennon"}, {"step": 7, "steps_text": "Use a scrap piece of wood up against the fence of the mitre saw and screw on an end block that will give a accurate length cut for the shoulder of the tennon.\nFlip down the depth stop lever and set the depth required for the tennon.\nCut the shoulders of the tennons...the scrap wood allows the cut to go the whole way across the leg.", "step_imgs": ["https://cdn.instructables.com/F0C/ELMC/JF2SYQ89/F0CELMCJF2SYQ89.LARGE.jpg", "https://cdn.instructables.com/F2D/D06Y/JF2SYQ8A/F2DD06YJF2SYQ8A.LARGE.jpg", "https://cdn.instructables.com/FCZ/LBK2/JF2SYQ8B/FCZLBK2JF2SYQ8B.LARGE.jpg"], "step_title": "Step 7: Cut the Shoulders"}, {"step": 8, "steps_text": "Now to cut out the tennon...\nAdd a little wedge at the leg end of the jig to bring the centre line of the leg parallel to the mitre saw table.\nCut back and forth until the tennon has been cut...trenching.\nFlip the depth lever into the up position and cut off the end over long.", "step_imgs": ["https://cdn.instructables.com/F3C/1JC7/JF2SYQM4/F3C1JC7JF2SYQM4.LARGE.jpg", "https://cdn.instructables.com/FQ3/GM48/JF2SYQM5/FQ3GM48JF2SYQM5.LARGE.jpg", "https://cdn.instructables.com/FRQ/VZ86/JF2SYQM7/FRQVZ86JF2SYQM7.ANIMATED.LARGE.gif"], "step_title": "Step 8: Trench!"}, {"step": 9, "steps_text": "Clean up the tennon with a sharp chisel.\nThis tennon could easily have been cut with a hand saw and a chisel.", "step_imgs": ["https://cdn.instructables.com/F3F/ZVFO/JF2SYQYE/F3FZVFOJF2SYQYE.LARGE.jpg"], "step_title": "Step 9: Clean Up"}, {"step": 10, "steps_text": "Now is a good time to trim the table top to length.\nThe board is wider than the mitre can cut in one...so make a cut half way...\n...flip around...carefully line up the blade...and finish the cut", "step_imgs": ["https://cdn.instructables.com/FLV/F0C3/JF2SYR5S/FLVF0C3JF2SYR5S.LARGE.jpg", "https://cdn.instructables.com/F6Q/R119/JF2SYREM/F6QR119JF2SYREM.LARGE.jpg"], "step_title": "Step 10: Trim to Length"}, {"step": 11, "steps_text": "The magic of the top tip...\n...carefully knock out the motice blocks from the table top...\n...you now have perfect angled mortices that need no more work.\nPlane one side of the tennons on the legs so that it is a consistent thickness to match the mortices\nDry test for fit.", "step_imgs": ["https://cdn.instructables.com/FNP/CYA2/JF2SYREA/FNPCYA2JF2SYREA.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F2F/22DI/JF2SYRED/F2F22DIJF2SYRED.LARGE.jpg", "https://cdn.instructables.com/FBN/VZYG/JF2SYREH/FBNVZYGJF2SYREH.ANIMATED.LARGE.gif"], "step_title": "Step 11: Knock Out a Mortice"}, {"step": 12, "steps_text": "Metal breadboards!\nA breadboard on a table top is usually a piece of timber that is jointed and glued across the ends of the timber board to help keep the top flat...\n...The steel channel will do the same job.\nCut the channel to the width of the table top...a hacksaw, metal bandsaw or angle grinder will do the job well...\n...an Evolution mitre saw will do it also having just cut all the timber...it still amazes me that one saw blade can do it all", "step_imgs": ["https://cdn.instructables.com/FWH/3OK4/JF2SYRUU/FWH3OK4JF2SYRUU.LARGE.jpg", "https://cdn.instructables.com/F8Y/WRWT/JF2SYRUV/F8YWRWTJF2SYRUV.LARGE.jpg"], "step_title": "Step 12: Breadboards"}, {"step": 13, "steps_text": "Cut a housing in both ends of the table top to allow the steel breadboard to be fitted snuggly.\nCut the shoulder with the mitre saw and finish with a router of a chisel and mallet...\n...shape the arris's with a plane for a snug fit", "step_imgs": ["https://cdn.instructables.com/FD6/O6UT/JF348HY2/FD6O6UTJF348HY2.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FZU/2T22/JF348IDP/FZU2T22JF348IDP.ANIMATED.LARGE.gif"], "step_title": "Step 13: Housing"}, {"step": 14, "steps_text": "Add a chamfer to the steel breadboard so the corners are not too sharp.\nFile or grind...or set a 45deg tilt to the mitre saw, clamp a block of wood as a stop guide and cut a nice chamfer all around the ends.\nGlue the steel breadboards to the timber top...I use Gorilla Glue a polyurethane glue that will stick metal to timber and pretty much any other material.\nTo activate the glue the timber must be dampened with water.\nLightly clamp until cured so that the expanding glue doesn't push the breadboard out of position.\nCut off any glue that has foamed out of the joint.\nGive the edges a sand...a belt sander works well for this.", "step_imgs": ["https://cdn.instructables.com/FA2/K86F/JF348IEG/FA2K86FJF348IEG.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FIL/C444/JF348IFF/FILC444JF348IFF.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FBP/90I6/JF348IFG/FBP90I6JF348IFG.ANIMATED.LARGE.gif"], "step_title": "Step 14: Chamfer"}, {"step": 15, "steps_text": "Mark out and cut the slots for wedges in the ends of the leg tennons\nAngle them in a little to avoid splits forming in the leg and drill out the ends of the slots to help with this...maybe overkill though quick to do and will help.", "step_imgs": ["https://cdn.instructables.com/FG6/0QYB/JF348JKI/FG60QYBJF348JKI.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FB9/NNUF/JF348JKK/FB9NNUFJF348JKK.LARGE.jpg", "https://cdn.instructables.com/FXH/YACB/JF348JKH/FXHYACBJF348JKH.LARGE.jpg"], "step_title": "Step 15: Wedgey"}, {"step": 16, "steps_text": "Cut some contrasting coloured wedges...and glue and wedge the legs in to place", "step_imgs": ["https://cdn.instructables.com/FZ6/U1HS/JF348JY3/FZ6U1HSJF348JY3.LARGE.jpg", "https://cdn.instructables.com/F3B/V4TS/JF348JY6/F3BV4TSJF348JY6.ANIMATED.LARGE.gif"], "step_title": "Step 16: Wedges"}, {"step": 17, "steps_text": "What this coffee table needs is a shelf...from rebar!\nIt looks great when cleaned up and complements the metal breadboards...\n...it is just cool!\nRough cut to length...\n...clean up with a wire wheel...\n...and seal with Briwax", "step_imgs": ["https://cdn.instructables.com/FEJ/KPVX/JF348K9K/FEJKPVXJF348K9K.LARGE.jpg", "https://cdn.instructables.com/FY8/KI51/JF348K9L/FY8KI51JF348K9L.LARGE.jpg", "https://cdn.instructables.com/F7S/OQ0Y/JF348K9M/F7SOQ0YJF348K9M.LARGE.jpg", "https://cdn.instructables.com/FZK/43CX/JF348K9N/FZK43CXJF348K9N.LARGE.jpg"], "step_title": "Step 17: Heavy Metal"}, {"step": 18, "steps_text": "I chose to use a block of Walnut for the shelf ends.\nThe idea is for the rebar rods to poke through holes in the Walnut to be able to fix it to the legs.\nDrill the holes for the rebar right through the block of wood.\nCut the block down the middle...this will make the holes line up nicely especially if you do not have a pillar drill for accurate holes...I don't.\nPlane the angle of the legs onto the inner face of each piece...\n...Glue the rods into the timber ends with some Gorilla glue", "step_imgs": ["https://cdn.instructables.com/F9T/B0E5/JF348KUQ/F9TB0E5JF348KUQ.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FP6/KGAK/JF348KUR/FP6KGAKJF348KUR.LARGE.jpg", "https://cdn.instructables.com/F58/8MRP/JF348KUO/F588MRPJF348KUO.LARGE.jpg", "https://cdn.instructables.com/F3M/BO14/JF348KUP/F3MBO14JF348KUP.ANIMATED.LARGE.gif"], "step_title": "Step 18: Shelf Ends"}, {"step": 19, "steps_text": "I wanted to push the mitre saw to the limit and I cut the outer angled cut on the mitre saw...\n...pack the rebar up so the shelf is laying flat and clamp in down for safety.\nDon safety gear and taking it easy I cut right through the timber end and rebar rods...amazing.\nAs an alternative use a metal cutting disc and expect to do a bit more cleaning up as the timber will scorch...\n...or cut the timber angle before gluing and then cut off the rebar ends when cured.\nFinish off with a belt sander for a really cool look...the combination of shinny metal in the timber is great.", "step_imgs": ["https://cdn.instructables.com/FOW/RJG6/JF348LQ4/FOWRJG6JF348LQ4.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FZF/6OLX/JF348LQ3/FZF6OLXJF348LQ3.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FKU/I90W/JF348OSN/FKUI90WJF348OSN.LARGE.jpg"], "step_title": "Step 19: Slices Like a Hot Knife Through Butter"}, {"step": 20, "steps_text": "Cut the ends of the walnut ends to the angle of the legs...\n...cut some scrap pieces of timber to position the shelf at the desired height.\nI was going to pin the shelf to the legs with some rebar though decided that its diameter was just too large and went for some thin rod, wire nails...\n...it turned out to be too thin visually, I should have gone for a thicker rod around 5mm to be more visually robust.\nWhat ever size you go for, drill through the leg into the walnut, add some Gorilla glue, hammer in and clean off with a belt sander", "step_imgs": ["https://cdn.instructables.com/FD2/NVZB/JF348MNV/FD2NVZBJF348MNV.ANIMATED.LARGE.gif", "https://cdn.instructables.com/F57/DVWD/JF348OSE/F57DVWDJF348OSE.LARGE.jpg"], "step_title": "Step 20: Fit the Shelf"}, {"step": 21, "steps_text": "The coffee table is looking great...a couple of touches and it will be fantastic.\nTo reference the coffee theme spray paint the tips of the legs coffee black as if they have been dipped in coffee!...\n...I tried dipping them in coffee...real coffee...it didn't work!\nText is so important to my work and it says it all...", "step_imgs": ["https://cdn.instructables.com/F52/3VJ8/JF348NKN/F523VJ8JF348NKN.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FT7/71W6/JF348NKM/FT771W6JF348NKM.LARGE.jpg"], "step_title": "Step 21: Spray"}, {"step": 22, "steps_text": "Add your favourite finish to your coffee table...I like Hardwax Oil, easy to apply, enhances the timber and is hardwearing and allows for spills to be wiped away.\nA bit of Briwax to the metal to stop it rusting...Done.", "step_imgs": ["https://cdn.instructables.com/FO8/C2IE/JF348O93/FO8C2IEJF348O93.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FHK/F7LQ/JF348O94/FHKF7LQJF348O94.ANIMATED.LARGE.gif"], "step_title": "Step 22: Hard...wax"}, {"step": 23, "steps_text": "After all of that work you now have a fantastic coffee table to enjoy having a coffee with...perfect.\nI would like to thank you for getting this far and a big thank you to Evolution Power Tools for letting me test drive their new mitre saw...a great project and a great saw.\nI am entering this project into the Pro Tips Challenge and if you have enjoyed this project, I would really appreciate your vote...thank you so much.\nThis project is part of my YouTube channel where I try to make cool and interesting projects.\nPlease check out my channel if you want to see more of the projects, if not there will be more coming to Instructables soon.\nWhy not check out what I am up to on Facebook.", "step_imgs": ["https://cdn.instructables.com/FNS/9ZHH/JF348OSM/FNS9ZHHJF348OSM.LARGE.jpg", "https://cdn.instructables.com/FKV/BT4R/JF348ORZ/FKVBT4RJF348ORZ.LARGE.jpg", "https://cdn.instructables.com/FPR/4340/JF348OS3/FPR4340JF348OS3.LARGE.jpg", "https://cdn.instructables.com/FSW/V9K4/JF348OS5/FSWV9K4JF348OS5.LARGE.jpg", "https://cdn.instructables.com/FU0/X9DR/JF348OS6/FU0X9DRJF348OS6.LARGE.jpg", "https://cdn.instructables.com/FEB/3EG5/JF348OS8/FEB3EG5JF348OS8.ANIMATED.LARGE.gif", "https://cdn.instructables.com/FK9/OX63/JF348OSA/FK9OX63JF348OSA.LARGE.jpg", "https://cdn.instructables.com/F27/C2GW/JF348OSB/F27C2GWJF348OSB.LARGE.jpg", "https://cdn.instructables.com/FPG/OJ9M/JF348OSL/FPGOJ9MJF348OSL.LARGE.jpg"], "step_title": "Step 23: Time for a Coffee!"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "This whole project came about because we have no room in our house, and shoes always seem to have nowhere to go. So the idea is to design a narrow, space saving, piece that can hold a bunch of shoes, and that looks good at the same time.", "title": "DIY Minimalist Shoe Rack", "url": "https://www.instructables.com/id/DIY-Minimalist-Shoe-Rack/", "steps": [{"step": 1, "steps_text": "This is a basic project, using pine and some thin plywood. I began with measuring out how much space I wanted in between each pair of shoes and what angle to use.", "step_imgs": ["https://cdn.instructables.com/F9G/VUKG/JEYISIAU/F9GVUKGJEYISIAU.LARGE.jpg", "https://cdn.instructables.com/FOH/ARX6/JEYISIA5/FOHARX6JEYISIA5.LARGE.jpg"], "step_title": "Step 1: Planning"}, {"step": 2, "steps_text": "To hold the shelves in... grooves made on the router.\nSo I first made a little jig to follow and then routed grooves on an angle, then a short horizontal line, and then a long groove in the back for the backing piece.", "step_imgs": ["https://cdn.instructables.com/F17/HRUC/JEYISI9A/F17HRUCJEYISI9A.LARGE.jpg", "https://cdn.instructables.com/FT5/U974/JEYISI8V/FT5U974JEYISI8V.LARGE.jpg", "https://cdn.instructables.com/FE2/VHXW/JEYISI8N/FE2VHXWJEYISI8N.LARGE.jpg"], "step_title": "Step 2: The Router"}, {"step": 3, "steps_text": "For the shelves I used some 1/4 inch plywood that I cut up on the table saw and using a cross cut sled. I cut up the main shelves as well as some smaller backing pieces to fit.", "step_imgs": ["https://cdn.instructables.com/FRS/26AD/JEYISI8M/FRS26ADJEYISI8M.LARGE.jpg", "https://cdn.instructables.com/FOD/6728/JEYISI8E/FOD6728JEYISI8E.LARGE.jpg"], "step_title": "Step 3: Shelves"}, {"step": 4, "steps_text": "Once all the pieces were cut up, I first did a dry fit which revealed the back piece was a touch too wide, so after trimming that I was ready to assemble. I glued all the bigger shelves as well as the short back shelves and the larger backing and set everything up with some clamps for drying.", "step_imgs": ["https://cdn.instructables.com/FTJ/6FAD/JEYISI7I/FTJ6FADJEYISI7I.LARGE.jpg", "https://cdn.instructables.com/FEV/CC7P/JEYISI5X/FEVCC7PJEYISI5X.LARGE.jpg", "https://cdn.instructables.com/FE2/IKFH/JEYISI4C/FE2IKFHJEYISI4C.LARGE.jpg", "https://cdn.instructables.com/F59/41J1/JEYISI3E/F5941J1JEYISI3E.LARGE.jpg", "https://cdn.instructables.com/FT5/J5YS/JEYISI3B/FT5J5YSJEYISI3B.LARGE.jpg"], "step_title": "Step 4: Dry Fit & Gluing"}, {"step": 5, "steps_text": "Next, gluing and nailing in the top and bottom piece to secure.", "step_imgs": ["https://cdn.instructables.com/FN7/4GEP/JEYISI32/FN74GEPJEYISI32.LARGE.jpg", "https://cdn.instructables.com/FGA/5RRN/JEYISI2P/FGA5RRNJEYISI2P.LARGE.jpg"], "step_title": "Step 5: Top & Bottom"}, {"step": 6, "steps_text": "I always like when you add an architectural detail which is what I'm calling this top piece,which is simply a slightly larger 1/4 inch plywood piece to fit over the pine top and bottom. It adds a bit of dimension, however it's such a simple concept.", "step_imgs": ["https://cdn.instructables.com/FTN/WWNV/JEYISI2C/FTNWWNVJEYISI2C.LARGE.jpg", "https://cdn.instructables.com/F8V/2JG1/JEYISI21/F8V2JG1JEYISI21.LARGE.jpg", "https://cdn.instructables.com/FYR/AC28/JEYISI1T/FYRAC28JEYISI1T.LARGE.jpg", "https://cdn.instructables.com/FFG/U0IV/JEYISI1D/FFGU0IVJEYISI1D.LARGE.jpg"], "step_title": "Step 6: Detail"}, {"step": 7, "steps_text": "To cover the edge of the plywood on the shelves we cut up some thin strips of pine that were glued and stapled in place.", "step_imgs": ["https://cdn.instructables.com/FQK/UIFJ/JEYISI1C/FQKUIFJJEYISI1C.LARGE.jpg", "https://cdn.instructables.com/FLS/MMR1/JEYISI14/FLSMMR1JEYISI14.LARGE.jpg", "https://cdn.instructables.com/F9H/RZU2/JEYISI0W/F9HRZU2JEYISI0W.LARGE.jpg", "https://cdn.instructables.com/F8A/M9U8/JEYISI0M/F8AM9U8JEYISI0M.LARGE.jpg"], "step_title": "Step 7: Shelf Covers"}, {"step": 8, "steps_text": "Finally some sanding to get everything nice and smooth, and for a finish I ended up using a whitewash on the entire piece and then shellac for some extra protection.", "step_imgs": ["https://cdn.instructables.com/FFH/HJOG/JEYISI0E/FFHHJOGJEYISI0E.LARGE.jpg", "https://cdn.instructables.com/FXN/0RPK/JEYISI06/FXN0RPKJEYISI06.LARGE.jpg", "https://cdn.instructables.com/FBV/1Y0W/JEYISI05/FBV1Y0WJEYISI05.LARGE.jpg"], "step_title": "Step 8: Finishing"}, {"step": 9, "steps_text": "For a much better perspective, make sure to watch the video that goes over the various steps of the build.", "step_imgs": [], "step_title": "Step 9: Conclusion - Watch the Video"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "This is a tutorial on creating a laser cut contour map using Ordnance Surveys OpenData. I cut the map using a K40 laser with an upgraded smoothie board.\nI think the contours provide a pleasing and interesting aesthetic. The maps work best when you are featuring a section of coastline!", "title": "Laser Cut Contour Maps", "url": "https://www.instructables.com/id/Laser-Cut-Contour-Maps/", "steps": [{"step": 1, "steps_text": "UK Map\nHead to the ordnance survey webpage to download their OS Terrain® 50 ESRI Shapefile https://www.ordnancesurvey.co.uk/opendatadownload...\nUS Map\nI haven't attempted to cut a US map but the data here seems to be in the same format as the UK data https://topotools.cr.usgs.gov/contour_data.php\nOther areas\nContour shapefiles tend to be publicaly available through governmental scientific agencies for a lot of countries it just takes a bit of searching", "step_imgs": ["https://cdn.instructables.com/FMC/X81T/JEUKNVTY/FMCX81TJEUKNVTY.LARGE.jpg"], "step_title": "Step 1: Get the Data"}, {"step": 2, "steps_text": "Head over to QGIS and download and install their open source GIS application.\nAdd a new vector file using the tool in the top left tool bar\nYou now need to navigate to the specific OS50Terran file for the area you want to create. For the UK data you are looking for an AutoCAD shapefile its usually the largest file of the set. To make things easier you can narrow down the search by identifying the grid ref appended to the file name..Unfortunately narrowing down past the region is a bit of trial and error until you find the right tile.\n*You can open a series of files and they will start to join up to create a larger area\nOnce you have your desired area we need to export a SVG over to illustrator to prepare for the laser.\n1.Click 'New print composer' ignore the name box that pops up then a new window will open\n2. In the new window that opens click 'Add new map' and draw a bounding box on the white space - your map should now appear on this canvas\n3. Now click 'Export as SVG' in the top toolbar", "step_imgs": ["https://cdn.instructables.com/FX9/WO9Y/JEUKNXVJ/FX9WO9YJEUKNXVJ.LARGE.jpg", "https://cdn.instructables.com/FB7/AMAP/JEUKNX58/FB7AMAPJEUKNX58.LARGE.jpg", "https://cdn.instructables.com/FLE/3YKP/JEUKNZZ6/FLE3YKPJEUKNZZ6.LARGE.jpg"], "step_title": "Step 2: Locate the Data"}, {"step": 3, "steps_text": "We are now going to prepare the file for cutting -\nOpen Illustrator alternatively GIMP the open source vector program.\nWe now need to separate into layers what we are going to 'cut' the coastline,' and what we want 'etched' the contours...\n>Select All\n>Give all paths a single colour eg Blue and reduce stroke weight to 0.01pt\nWe now need to create a separate layer for the coastline and move the coastline paths on to this layer and color the stroke to red.\nThe final step is to create the shape of the map perimeter depending on the picture frame size you use. I used a 203mm square aperture in a cheap box frame bought from ebay. So i created a 203mm box around the map, as this was a cut path i set the colour to red and stroke to 0.01pt\nYour file is now ready to send to the laser cutter.", "step_imgs": ["https://cdn.instructables.com/FVK/PGP8/JEUKO0JX/FVKPGP8JEUKO0JX.LARGE.jpg"], "step_title": "Step 3: Prepare for the Laser"}, {"step": 4, "steps_text": "As there are many different laser machines and software that they run on i wont go too in too depth here. The file we have prepared should be suitable for most laser cutters.\nI have a Chinese K40 Ebay special that i modified with a Smoothieboard to run LaserWeb 4 https://github.com/LaserWeb/LaserWeb4\nI cut the 3mm plywood making 3 passes for the coast line to ensure the cut and 1 pass for the contours.", "step_imgs": ["https://cdn.instructables.com/FXL/4COX/JEUKO3U7/FXL4COXJEUKO3U7.LARGE.jpg"], "step_title": "Step 4: Cutting the File"}, {"step": 5, "steps_text": "Once the map is cut i used a piece 3mm blue acrylic the same size as the map to represent the sea, and attatched it the the ply with hot melt glue.\nI then located this within the box frame, covered with the backing board and your laser map is complete!", "step_imgs": ["https://cdn.instructables.com/F46/9WFP/JEUKOASR/F469WFPJEUKOASR.LARGE.jpg"], "step_title": "Step 5: Putting It All Together"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "Making a quality DIY custom photo album is a fun and easy way to make a special keepsake for storing all of your most memorable photos. I decided to make my photo album out of 1/8\" aluminum so that it could withstand the test of time. This album in particular was an engagement gift for my girlfriend Jenn. It is filled with lots of meaningful (and utterly ridiculous) pictures from throughout our relationship. I wanted to make it out of metal so that it would not only last a lifetime, but also represent the enormous heft of our love.", "title": "Indestructible Photo Album", "url": "https://www.instructables.com/id/Indestructible-Photo-Album/", "steps": [{"step": 1, "steps_text": "For this project you need:\n\n(x1) 12\" x 2\" x 1/8\" aluminum U-bracket\n(x2) 12\" x 10.5\" aluminum sheets ***\n(x2) 12\" length x 0.113\" knuckle diameter piano hinges (not pictured)\n(x2) 1-1/2\" binding posts\n(x10) M2.5 x 4MM bolts (not pictured)\n(x5) Photo album self-adhesive sheets\n\n*** I got 12\" x 12\" aluminum sheets and cut off 1.5\".", "step_imgs": ["https://cdn.instructables.com/FPE/4RCN/JAIJS4LX/FPE4RCNJAIJS4LX.LARGE.jpg"], "step_title": "Step 1: Materials"}, {"step": 2, "steps_text": "Align one side of the piano hinge length-wise with one edge of the U-bracket and clamp it in place.\n\nMake 5 markings centered along the length of the piano hinge using a punch.\n\nDrill these markings with a #46 drill bit.", "step_imgs": ["https://cdn.instructables.com/FQK/S1F1/JAIJS5LA/FQKS1F1JAIJS5LA.LARGE.jpg", "https://cdn.instructables.com/F6R/CNQC/JAIJS5O7/F6RCNQCJAIJS5O7.LARGE.jpg", "https://cdn.instructables.com/F6Z/5DMG/JAIJS5OD/F6Z5DMGJAIJS5OD.LARGE.jpg", "https://cdn.instructables.com/FK3/8NYX/JAIJS5PC/FK38NYXJAIJS5PC.LARGE.jpg", "https://cdn.instructables.com/FHJ/D37X/JAIJS5QH/FHJD37XJAIJS5QH.LARGE.jpg"], "step_title": "Step 2: Mark and Drill"}, {"step": 3, "steps_text": "Thread each of the holes that you just drilled in the U-bracket with a M2.5 tap.", "step_imgs": ["https://cdn.instructables.com/FOW/OU3K/JAIJS670/FOWOU3KJAIJS670.LARGE.jpg"], "step_title": "Step 3: Tap"}, {"step": 4, "steps_text": "Repeat this process on the other side of the U-bracket using the other piano hinge.", "step_imgs": ["https://cdn.instructables.com/F0X/8F0M/JAIJSAZS/F0X8F0MJAIJSAZS.LARGE.jpg"], "step_title": "Step 4: Repeat"}, {"step": 5, "steps_text": "Measure precisely 0.4\" in from one of the long edges of the aluminum U-shape and then 2.35\" in from each of the short edges and make a mark at both intersection using a punch.\n\nThese are the only two holes that it is imperative to get exactly right, as they need to line up with the holes punched in the photo sheets. Given this, you may want to double check the alignment of the markings using the actual sheet as a guide.\n\nOnce you are sure of the hole placement, drill each of the holes using a #7 drill bit.\n\nCounterbore each hole to a depth of about 1/8\" using a 1/2\" end mill at a low drill speed.\n\nIf you don't have an end mill, or are not keen on slightly misusing one for this purpose, you can choose to skip this part. It is not entirely necessary.", "step_imgs": ["https://cdn.instructables.com/FWM/DJA9/JAIJSCES/FWMDJA9JAIJSCES.LARGE.jpg"], "step_title": "Step 5: Drill and Counterbore"}, {"step": 6, "steps_text": "Align the undrilled edge of each piano hinge with one of the 12\" edges of the aluminum sheets, and clamp them together.\n\nAgain, make five markings centered along the hinge and drill through both the hinge and the sheet with a #46 bit.\n\nRepeat the process for the second hinge and aluminum sheet.", "step_imgs": ["https://cdn.instructables.com/FO7/X206/JAIJSE5W/FO7X206JAIJSE5W.LARGE.jpg", "https://cdn.instructables.com/F4E/5TU6/JAIJSE64/F4E5TU6JAIJSE64.LARGE.jpg"], "step_title": "Step 6: Mark and Drill Again"}, {"step": 7, "steps_text": "Thread all of the new holes in both sheets using a M2.5 tap.", "step_imgs": ["https://cdn.instructables.com/FVH/YT5V/JAIJSE78/FVHYT5VJAIJSE78.LARGE.jpg"], "step_title": "Step 7: Tap Again"}, {"step": 8, "steps_text": "For a more finished look, polish up all of the components to a nice shine.\n\nTo learn about polishing aluminum, check out the Finishing Lesson in the Metalworking Class.", "step_imgs": ["https://cdn.instructables.com/FZV/8TO1/JAIJSE9O/FZV8TO1JAIJSE9O.LARGE.jpg"], "step_title": "Step 8: Polish (optional)"}, {"step": 9, "steps_text": "Using M2.5 bolts, attach the piano hinges to the U-bracket and the aluminum sheets using all of the holes that were drilled and threaded.", "step_imgs": ["https://cdn.instructables.com/FIK/Y6OV/JAIJSEUJ/FIKY6OVJAIJSEUJ.LARGE.jpg", "https://cdn.instructables.com/FO5/1OKN/JAIJSEUL/FO51OKNJAIJSEUL.LARGE.jpg", "https://cdn.instructables.com/FNE/DK13/JAIJSEUQ/FNEDK13JAIJSEUQ.LARGE.jpg", "https://cdn.instructables.com/FQX/XX0Y/JAIJSEVP/FQXXX0YJAIJSEVP.LARGE.jpg"], "step_title": "Step 9: Assembled"}, {"step": 10, "steps_text": "Gather all of the photo album pages and insert a binding post through each of them.\n\nPass the binding posts through the appropriate holes in the U-channel. Once through, thread on the other half of the binding post.", "step_imgs": ["https://cdn.instructables.com/F9K/UP0T/JAMTSZYU/F9KUP0TJAMTSZYU.LARGE.jpg", "https://cdn.instructables.com/FXU/JF36/JAMTSZYV/FXUJF36JAMTSZYV.LARGE.jpg"], "step_title": "Step 10: Insert Pages"}, {"step": 11, "steps_text": "Fill the album with printouts of silly pictures you took using Instagram filters.\n\nOr... I guess you could put in whatever you want.", "step_imgs": ["https://cdn.instructables.com/FQB/X9W8/JF2SVTPC/FQBX9W8JF2SVTPC.LARGE.jpg"], "step_title": "Step 11: Fill the Album"}, {"step": 12, "steps_text": "Finally, you should create a bunch of lenticular postcards and propose to Jenn, but not my Jenn. She already said yes to me. Select a different Jenn.", "step_imgs": ["https://cdn.instructables.com/F23/YLT3/JAMU41SL/F23YLT3JAMU41SL.ANIMATED.LARGE.gif"], "step_title": "Step 12: Propose to Jenn"}], "channel": "Metalworking"}, {"category": "Workshop", "description": "In my first DIY build Instructable, I am going to show how you can build simple design floating night lamp, which is easy to build and doesn’t require any advanced tools.\nFull in depth build video:\nEQUIPMENT YOU'LL NEED:\nJigsaw\nClamp\nDrill\nHot glue gun\nWood glue\nSquare ruler\nRuler\nPaint brush\n80-120 and 220 grit sandpapers\nScissors\nMATERIALS YOU'LL NEED:\n1.5 x 1.5 cm wood board ~210 cm length\n3 x 3 cm wood board ~60 cm length\nLED Filament bulb 7W Warm White color ~700 Lumen\nBulb socket\nPower cord with On / Off switch\nPaint\nDouble side tape\nA4 paper / color paper / binders", "title": "DIY \"Floating\" Night Lamp", "url": "https://www.instructables.com/id/DIY-Floating-Night-Lamp/", "steps": [{"step": 1, "steps_text": "Wood parts:\n8 pieces 1.5 x 1.5 cm x 13 cm\n3 pieces 1.5 x 1.5 cm x 25 cm\n1 pieces 1.5 x 1.5 cm x 23 cm\n4 pieces 3 x 3 cm x 12 cm", "step_imgs": ["https://cdn.instructables.com/F06/H40B/JEYJ6FKC/F06H40BJEYJ6FKC.LARGE.jpg"], "step_title": "Step 1: Parts You Need to Cut From Wood Boards"}, {"step": 2, "steps_text": "Glue two 25 cm length pieces with two 13 cm length pieces. Hold pieces for 3-5 minutes while using hair dryer to speed up glue drying process.", "step_imgs": ["https://cdn.instructables.com/FS3/AGQC/JEYJ6F26/FS3AGQCJEYJ6F26.LARGE.jpg"], "step_title": "Step 2: Gluing First Part"}, {"step": 3, "steps_text": "Glue 23 cm and 25 cm pieces with two 13 cm pieces. Hold pieces for 3-5 minutes while using hair dryer to speed up glue drying process.", "step_imgs": ["https://cdn.instructables.com/FQ5/RXYU/JEYJ6F25/FQ5RXYUJEYJ6F25.LARGE.jpg"], "step_title": "Step 3: Gluing Second Part"}, {"step": 4, "steps_text": "Glue four 12 cm pieces and clamp them. Wait 20-24 hours until wood glue on all parts completely dry up.", "step_imgs": ["https://cdn.instructables.com/FKZ/AS6W/JEYJ6F23/FKZAS6WJEYJ6F23.LARGE.jpg"], "step_title": "Step 4: Gluing Base for the Lamp"}, {"step": 5, "steps_text": "Glue lamp's frame parts with last four 13 cm pieces.", "step_imgs": ["https://cdn.instructables.com/F3O/4CZC/JEYJ6F22/F3O4CZCJEYJ6F22.LARGE.jpg"], "step_title": "Step 5: Connecting Glued Lamp Parts"}, {"step": 6, "steps_text": "Add something heavier to press all four corners of the lamp. Wait 20-24 hours until glue completely dry up.", "step_imgs": ["https://cdn.instructables.com/FU5/HKAO/JEYJ6F1Z/FU5HKAOJEYJ6F1Z.LARGE.jpg"], "step_title": "Step 6: Pressing and Waiting"}, {"step": 7, "steps_text": "Drill a hole for the power cable at the back of a lamp (near 23 cm piece).", "step_imgs": ["https://cdn.instructables.com/F4Y/NMN5/JEYJ6F1Y/F4YNMN5JEYJ6F1Y.LARGE.jpg"], "step_title": "Step 7: Drilling"}, {"step": 8, "steps_text": "First sand rough spots and corners with 80 grit sandpaper and then sand everything with finer 220 grit sandpaper.", "step_imgs": ["https://cdn.instructables.com/FMU/L6HG/JEYJ6F1X/FMUL6HGJEYJ6F1X.LARGE.jpg"], "step_title": "Step 8: Sanding"}, {"step": 9, "steps_text": "Mark gluing spot for the lamp's frame. Lamp's frame should be 3 cm from the lamp's base edges.", "step_imgs": ["https://cdn.instructables.com/FH9/K82N/JEYJ6F1W/FH9K82NJEYJ6F1W.LARGE.jpg"], "step_title": "Step 9: Marking Gluing Spot"}, {"step": 10, "steps_text": "Add glue on the marked spot, place lamp's frame on the base and press it down with something heavier. You should wait 20-24 hours until glue completely dry up.", "step_imgs": ["https://cdn.instructables.com/FIT/BAIC/JEYJ6F1V/FITBAICJEYJ6F1V.LARGE.jpg"], "step_title": "Step 10: Connecting Frame to Base"}, {"step": 11, "steps_text": "I am using white water based paint to paint the lamp. They has almost no bad smell so you can paint inside at your home.", "step_imgs": ["https://cdn.instructables.com/F8Y/LTP1/JEYJ6F1U/F8YLTP1JEYJ6F1U.LARGE.jpg"], "step_title": "Step 11: Painting"}, {"step": 12, "steps_text": "Route the power cable through the hole and assemble bulb socket. Test it, before next step. I am using E27 T210 bulb socket type which connects to AC (120-250v) power from the wall.", "step_imgs": ["https://cdn.instructables.com/FXP/VTZH/JEYJ6F1T/FXPVTZHJEYJ6F1T.LARGE.jpg"], "step_title": "Step 12: Routing Cable"}, {"step": 13, "steps_text": "Hot glue around the cable, that you couldn't pull it out by an accident.", "step_imgs": ["https://cdn.instructables.com/FFN/6EU8/JEYJ6F2N/FFN6EU8JEYJ6F2N.LARGE.jpg"], "step_title": "Step 13: Hot Gluing Cable"}, {"step": 14, "steps_text": "Put hot glue on the bottom of the bulb socket and quickly press it down on the lamp's base.", "step_imgs": ["https://cdn.instructables.com/FY0/NG2I/JEYJ6F2M/FY0NG2IJEYJ6F2M.LARGE.jpg"], "step_title": "Step 14: Hot Gluing Bulb Socket"}, {"step": 15, "steps_text": "Add more hot glue around the bulb socket for firm bond.", "step_imgs": ["https://cdn.instructables.com/F9W/0ILK/JEYJ6F2K/F9W0ILKJEYJ6F2K.LARGE.jpg"], "step_title": "Step 15: Adding More Hot Glue"}, {"step": 16, "steps_text": "Cut two 12.5 cm x 24 cm double side orange paper pieces. Put some double side tape on the paper ends.", "step_imgs": ["https://cdn.instructables.com/F9P/MPIW/JEYJ6F2J/F9PMPIWJEYJ6F2J.LARGE.jpg"], "step_title": "Step 16: Cutting Paper Pieces"}, {"step": 17, "steps_text": "Place the paper pieces that those would be the same distance from lamp's left and right edges.", "step_imgs": ["https://cdn.instructables.com/F8N/6D0Q/JEYJ6F2I/F8N6D0QJEYJ6F2I.LARGE.jpg"], "step_title": "Step 17: Placing Paper"}, {"step": 18, "steps_text": "Add some double side tape on the A4 paper.", "step_imgs": ["https://cdn.instructables.com/FCN/E2C9/JEYJ6F2H/FCNE2C9JEYJ6F2H.LARGE.jpg"], "step_title": "Step 18: A4 Paper"}, {"step": 19, "steps_text": "Glue A4 paper to the backside of the lamp.", "step_imgs": ["https://cdn.instructables.com/FD9/QKOP/JEYJ6F2G/FD9QKOPJEYJ6F2G.LARGE.jpg"], "step_title": "Step 19: Gluing A4 Paper"}, {"step": 20, "steps_text": "Place some double side tape on any rubber you have and cut four legs for the lamp's base.", "step_imgs": ["https://cdn.instructables.com/FCB/J0HM/JEYJ6F2F/FCBJ0HMJEYJ6F2F.LARGE.jpg"], "step_title": "Step 20: Cutting Legs for the Lamp"}, {"step": 21, "steps_text": "Glue all four legs to the lamp's base. Try to glue as close as possible to the lamp's base edges for the best stability.", "step_imgs": ["https://cdn.instructables.com/FTA/QDAL/JEYJ6F2E/FTAQDALJEYJ6F2E.LARGE.jpg"], "step_title": "Step 21: Gluing Legs"}, {"step": 22, "steps_text": "First I was using standard 14W led bulb, but it was too bright, so I changed it to 7W led filament bulb warm white color. It gave way more beautiful colors at night.", "step_imgs": ["https://cdn.instructables.com/FMO/3A0Z/JEYJ6F2C/FMO3A0ZJEYJ6F2C.LARGE.jpg"], "step_title": "Step 22: Choosing Right Bulb"}, {"step": 23, "steps_text": "If you don't like using paper and want more robust material, you could use back side of the binders. They are cheap, has nice texture and come in variety of colors.", "step_imgs": ["https://cdn.instructables.com/FP2/CBX4/JEYJ6F2B/FP2CBX4JEYJ6F2B.LARGE.jpg"], "step_title": "Step 23: Other Materials You Could Use"}, {"step": 24, "steps_text": "Final look and some different look with other material (binders for paper).", "step_imgs": ["https://cdn.instructables.com/FVH/3HGT/JEYJ6F28/FVH3HGTJEYJ6F28.LARGE.jpg", "https://cdn.instructables.com/FJE/O3LO/JEYJ6F29/FJEO3LOJEYJ6F29.LARGE.jpg", "https://cdn.instructables.com/FSH/GJ1V/JEYJ6F2A/FSHGJ1VJEYJ6F2A.LARGE.jpg"], "step_title": "Step 24: BUILD Complete"}, {"step": 25, "steps_text": "Online 3D model - https://www.tinkercad.com/things/h7xeuXKbatF\nYOU CAN FOLLOW ME:\nYoutube: https://www.youtube.com/channel/UCaaSGD6wIhpYZhavY...\nTwitter: https://twitter.com/diyperspective\nInstagram: https://www.instagram.com/diyperspective\nFacebook: https://www.facebook.com/diyperspective", "step_imgs": [], "step_title": "Step 25: END"}], "channel": "Lighting"}, {"category": "Workshop", "description": "Hello you! This Instructable is about how to make a different picture frame with picture slide-in feature. In my Video you also see how I made it. Have fun watching & reading! Let's go!", "title": "The Different Picture Frame", "url": "https://www.instructables.com/id/The-Different-Picture-Frame/", "steps": [{"step": 1, "steps_text": "I start to build my frame using a wood slab. It's measurements are 3 by 1cm and it has a length of 100cm. I use beech wood which was easy to get in a hardware store where i live, but i think it can look good with other types of wood too.", "step_imgs": ["https://cdn.instructables.com/FTW/T6H8/JEYJ2MYB/FTWT6H8JEYJ2MYB.LARGE.jpg"], "step_title": "Step 1: The Wood"}, {"step": 2, "steps_text": "It's the first time for me working with a mitre saw so I keep the angles at 45° and 90° except the one which will be for the stand of the picture frame.\nSo, start to measure the picture that you want to frame. The short side of every piece should have about the size of the picture. You need two longer pieces and two smaller. All four pieces need a 45° angle at both ends, just like it would be at a normal picture frame (see in last picture of this step).", "step_imgs": ["https://cdn.instructables.com/F87/8B97/JEYJ2MV4/F878B97JEYJ2MV4.LARGE.jpg", "https://cdn.instructables.com/FVX/OFF0/JEYJ2MUR/FVXOFF0JEYJ2MUR.LARGE.jpg", "https://cdn.instructables.com/FDN/DF8M/JEYJ2MV7/FDNDF8MJEYJ2MV7.LARGE.jpg"], "step_title": "Step 2: Measure and Cut"}, {"step": 3, "steps_text": "Note: Since I had the idea to build this kind of picture frame while building I needed to make some extra steps that I leave out in this how to. It's still shown in my video, I hope it doesn't confuse.\nChoose one of the long pieces and put a mark at the back about 1cm from top. Use a chisel and hold it at a light angle to remove a very little material. It just needs to be enough for a picture to fit in.\nMake this on whole length of the piece (not just the small marked part like shown in the picture).", "step_imgs": ["https://cdn.instructables.com/FRE/9FXE/JEYJ2N3Y/FRE9FXEJEYJ2N3Y.LARGE.jpg", "https://cdn.instructables.com/F5T/30TO/JEYJ2N3Z/F5T30TOJEYJ2N3Z.LARGE.jpg"], "step_title": "Step 3: Make Slide-In Piece"}, {"step": 4, "steps_text": "For this frame you only need a \"half frame\" at the front, so only glue one side to make the first two pieces stay together. The long piece from last step is one of them. The side with removed wood needs to sit at the back.", "step_imgs": ["https://cdn.instructables.com/FOJ/UNX8/JEYJ2MVC/FOJUNX8JEYJ2MVC.LARGE.jpg"], "step_title": "Step 4: First Glue Up"}, {"step": 5, "steps_text": "Attach the second long piece to the back with some tape and find a nice angle for the picture frame. I used this little trick that I show in the picture and it worked very well. Then recut the piece with a saw.", "step_imgs": ["https://cdn.instructables.com/FCZ/625G/JEYJ2MVH/FCZ625GJEYJ2MVH.LARGE.jpg"], "step_title": "Step 5: Find Out the Right Angle for the Stand"}, {"step": 6, "steps_text": "Turn around the half frame so that the chiseled side looks up and attach the stand and the second small piece. I'm sure there's also a more professional way to attach than my duct tape version. Make sure to use not too much glue so the squeeze out won't remove the slide in feature.", "step_imgs": ["https://cdn.instructables.com/FVR/F9RA/JEYJ2MVV/FVRF9RAJEYJ2MVV.LARGE.jpg"], "step_title": "Step 6: Second Glue Up"}, {"step": 7, "steps_text": "Since it didn't look that stable to me I cut these two pieces shown in the pictures. The first is to stabilize the 45 degrees joint, the second for the stand and I marked them while holding them directly to the piece. Cut them and glue them to the frame.", "step_imgs": ["https://cdn.instructables.com/FBK/37MO/JEYJ2MW8/FBK37MOJEYJ2MW8.LARGE.jpg", "https://cdn.instructables.com/FZ7/YSBG/JEYJ2MWG/FZ7YSBGJEYJ2MWG.LARGE.jpg", "https://cdn.instructables.com/FGA/R9CL/JEYJ2MX8/FGAR9CLJEYJ2MX8.LARGE.jpg", "https://cdn.instructables.com/FNN/88E1/JEYJ2MXA/FNN88E1JEYJ2MXA.LARGE.jpg"], "step_title": "Step 7: Two More Pieces"}, {"step": 8, "steps_text": "Through gluing the two pieces for the stand I got a corner. Remove this corner with a saw for a better look.", "step_imgs": ["https://cdn.instructables.com/F74/1FRJ/JEYJ2MXH/F741FRJJEYJ2MXH.LARGE.jpg"], "step_title": "Step 8: Remove Corner"}, {"step": 9, "steps_text": "Now sand the frame to your satisfaction and finish it with the finishing product you like. I slowly increased up to 320 grid sanding paper and used mineral oil for finishing.", "step_imgs": ["https://cdn.instructables.com/FEH/A8CN/JEYJ2N44/FEHA8CNJEYJ2N44.LARGE.jpg", "https://cdn.instructables.com/F91/3MP6/JEYJ2MY8/F913MP6JEYJ2MY8.LARGE.jpg"], "step_title": "Step 9: Sanding and Finishing"}, {"step": 10, "steps_text": "Choose your favorite picture and it's done!\nHope you like the my spontaneous idea just to rearrange the parts of a common picture frame to make something new and different.\nMore videos and inspiration on my YouTube Channel Julian Do It . I hope to see you soon :)\nJulian\nI'm sorry for all spelling mistakes. I'm not a native english speaker, but I'm very happy if you tell me when there's a typo ;)", "step_imgs": ["https://cdn.instructables.com/FTK/C93S/JEYJ2N3T/FTKC93SJEYJ2N3T.LARGE.jpg"], "step_title": "Step 10: The Final"}], "channel": "Woodworking"}, {"category": "Workshop", "description": "Why cutting the oil filter open?\nIt's an standard procedure especially in aircraft or racing engine maintenance. After opening the filter you gain access to the filter material and you can inspect it for any signs of metal pieces/filings and assess internal condition of the engine. If any, the metal particles will be small, that's why it's important to not contaminate the inside of the filter while opening it using i.e. angle grinder.\nThere are specialized oil filter cutters available on the market but they aren't cheap.\nIt's quite a simple tool, so I've tried to make one myself.\nBased on https://bobistheoilguy.com/forums/ubbthreads.php/...\nTools used:\nMIG welder\nangle grinder\ndrill\nParts:\ncutting wheel\n628 ZZ bearings\nengine valve stems\nspring\npiece of small steel tube\nbolts, nuts and washers\nrandom bits of scrap metal", "title": "Oil FIlter Cutter", "url": "https://www.instructables.com/id/Oil-FIlter-Cutter/", "steps": [{"step": 1, "steps_text": "Size of the side brackets was precisely eyeballed.\nI've used old engine valve stems as bearings axles - they were 8mm in diameter and fit perfectly inside the bearings.\nEverything was spaced with thick washers and drilled out nuts.\nI've tacked the axles in place and boxed the side brackets.", "step_imgs": ["https://cdn.instructables.com/FMV/RWT2/JEYIV5H0/FMVRWT2JEYIV5H0.LARGE.jpg", "https://cdn.instructables.com/FCF/JUYT/JEYIV5HC/FCFJUYTJEYIV5HC.LARGE.jpg", "https://cdn.instructables.com/F8X/MSEY/JEYIV5HL/F8XMSEYJEYIV5HL.LARGE.jpg", "https://cdn.instructables.com/FOD/1KGP/JEYIV5KU/FOD1KGPJEYIV5KU.LARGE.jpg", "https://cdn.instructables.com/FDG/3VUI/JEYIV5M6/FDG3VUIJEYIV5M6.LARGE.jpg"], "step_title": "Step 1: Support Rollers"}, {"step": 2, "steps_text": "Two flat bars create a pivot arm with cutting wheel sandwiched between them.\nA threaded rod and butterfly nut is used to press the cutting wheel to the filter.\nThe spring was used to provide additional tension during cutting.", "step_imgs": ["https://cdn.instructables.com/FHF/10BV/JEYIV728/FHF10BVJEYIV728.LARGE.jpg", "https://cdn.instructables.com/FNG/4JSV/JEYIV72R/FNG4JSVJEYIV72R.LARGE.jpg", "https://cdn.instructables.com/F3H/MQCW/JEYIV71J/F3HMQCWJEYIV71J.LARGE.jpg", "https://cdn.instructables.com/F2F/QSJF/JEYIV727/F2FQSJFJEYIV727.LARGE.jpg"], "step_title": "Step 2: Cutting Arm"}, {"step": 3, "steps_text": "First cutting wheel did not do the job.\nIt had an integrated bearing, but the angle of the blade (~90 degrees) was too big, it was leaving an indentation instead of cutting the sheet metal.\nThe second one had narrower blade, it was also a bit bigger so I had to drill new hole for the axle.", "step_imgs": ["https://cdn.instructables.com/F56/1NJM/JEYIV7O7/F561NJMJEYIV7O7.LARGE.jpg", "https://cdn.instructables.com/FZI/12UR/JEYIV7OC/FZI12URJEYIV7OC.LARGE.jpg", "https://cdn.instructables.com/FAB/3FZ4/JEYIV7OQ/FAB3FZ4JEYIV7OQ.LARGE.jpg"], "step_title": "Step 3: Cutting Wheel"}, {"step": 4, "steps_text": "I've changed the pivot arm bolt for a longer one and added small piece of steel tube - it made rotating the tool much easier.\nIt still needs some additional changes like\nhandle for easier filter loading - it's hard to grip and compress the spring\nsome kind of retention bracket for filter - support rollers and cutting blade are not perfectly in line and at first it cuts a spiral\nBut it works!", "step_imgs": ["https://cdn.instructables.com/F3R/AY8Y/JEYIV7U8/F3RAY8YJEYIV7U8.LARGE.jpg"], "step_title": "Step 4: Final Touches and Testing"}], "channel": "Tools"}]